const duas = [

{
id:1,

title:"دعائے فرج",

english:"Dua-e-Imam Zaman",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`
اَللّٰهُمَّ كُنْ لِوَلِيِّكَ الْحُجَّةِ بْنِ الْحَسَنِ صَلَوَاتُكَ عَلَيْهِ وَعَلٰى اٰبَاۤئِه فِىْ هٰذِهِ السَّاعَةِ وَ فِىْ كُلِّ سَاعَةٍ وَلِيًّا وَّ حَافِظًا وَّ قَاۤئِدًا وَّ نَاصِرًا وَّ دَلِيْلًا وَّ عَيْنًا حَتّٰى تُسْكِنَهُ اَرْضَكَ طَوْعًا وَتُمَتِّعَهُ فِيْهَا طَوِيْلًا۔      `,

translation:`   
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
اے معبود ! محافظ بن جا اپنے ولی حجت القائم (ع) بن حسن(ع) کاتیری رحمت نازل ہو ان پر اور ان کے آباؤ اجداد پر اس لمحہ میں اور ہر آنے والے لمحہ میں، ان کا مددگاربن جا نگہبان پیشوا، حامی، راہنما اور نگہدار بن جا یہاں تک کہ تو لوگوں کی چاہت سے انہیں زمین کی حکومت دے اور مدتوں اس پر برقرار رکھے    ۔`,

reference:`<b> 📖 کتاب: الكافي
✍️ مصنف: الشيخ محمد بن يعقوب الكليني

📚 جلد: 4
📄 صفحہ: 162

كتاب: فضل شهر رمضان
باب: في ليلة ثلاث وعشرين من شهر رمضان

امام جعفر الصادق عليه السلام نے شبِ تئیسویں رمضان کے اعمال بیان فرمائے اور اس رات امامِ وقت کے لیے یہ دعا پڑھنے کی تعلیم دی:

«اللَّهُمَّ كُنْ لِوَلِيِّكَ فُلَانِ بْنِ فُلَانٍ...»

بعد کے علماء نے "فلان بن فلان" کی جگہ موجودہ امام حضرت الحجة بن الحسن عليه السلام کا نام پڑھنے کی ہدایت دی، اور یہی متن آج "دعائے فرج" کے نام سے مشہور ہے۔   `
},









{
id:2,

title:"دعائے عہد",

english:"Dua-e-Ahad",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`    
اللّهُمَّ رَبَّ النُّورِ العَظِيمِ وَرَبَّ الكُرسِي‌ِّ الرَفِيعِ وَرَبَّ البحْرِ المَسْجُورِ وَمُنْزِلَ التَّوْراةِ وَالإِنْجِيلِ وَالزَّبورِ وَرَبَّ الظِّلِّ وَالحَرُورِ وَمُنْزِلَ القُرْآنِ العَظِيمِ وَرَبَّ المَلائِكَةِ المُقَرَّبِينَ وَالأَنْبِياءِ وَالمُرْسَلِينَ اللّهُمَّ إِنِّي‌ أَسْئَلُكَ بِوَجْهِكَ الكَرِيمِ وَبِنُورِ وَجْهِكَ المُنِيرِ وَمُلْكِكَ القَدِيمِ يا حَي‌ُّ يا قَيُّومُ أَسْئَلُكَ بِاسْمِكَ الَّذِي‌ أَشْرَقَتْ بِهِ السَّماواتُ وَالأَرَضُونَ وَبِاسْمِكَ الَّذِي‌ يَصْلَحُ بِهِِ الأَوَّلُونَ وَالآخِرُونَ يا حَيّاً قَبْلَ كُلِّ حَي‌ٍّ وَيا حَيّاً بَعْدَ كُلِّ حَي‌ٍّ وَيا حَيّاً حِينَ لا حَي‌َّ يا مُحْيي‌َ المَوْتى وَمُمِيتَ الأَحْياءِ يا حَي‌ُّ لا إِلهَ إِلاّ أَنْتَ اللّهُمَّ بَلِّغْ مَوْلانا الأَمامَ الهادِي‌َ المَهْدِي‌َّ القائِمَ بِأَمْرِكَ صَلَواتُ اللهِ عَلَيْهِ وَعَلى آبائِهِ الطّاهِرِينَ عَنْ جَمِيعِ المُؤْمِنِينَ وَالمُؤْمِناتِ في‌ مَشارِقِ الأَرْضِ وَمَغارِبِها سَهْلِها وَجَبلِها وَبرِّها وَبَحْرِها وَعَنِّي‌ وَعَنْ والِدَي‌َّ مِنَ الصَّلَواتِ زِنَةَ عَرْشِ اللهِ وَمِدادَ كَلِماتِهِ وَما أَحْصاهُ عِلْمُهُ وَأَحاطَ بِهِ كِتابُهُ اللّهُمَّ إِنِّي‌ أُجَدِّدُ لَهُ في‌ صَبِيحَةِ يَوْمي‌ هذا وَما عِشْتُ مِنْ أَيّامي‌ عَهْداً وَعَقْداً وَبيعَةً لَهُ في‌ عُنُقي‌ لا أَحُولُ عَنْها وَلا أَزُولُ أَبداً اللّهُمَّ اجْعَلْني‌ مِنْ أَنْصارِهِ وَأَعْوانِهِ وَالذَّابِينَ عَنْهُ وَالمُسارِعِينَ إِلَيْهِ في‌ قَضاءِ حَوائِجِهِ وَالمُمْتَثِلِينَ لأَوامِرِهِ وَالُمحامِينَ عَنْهُ وَالسّابِقِينَ إِلى إِرادَتِهِ وَالمُسْتَشْهَدِينَ بيْنَ يدَيهِ اللّهُمَّ إِن‌ حالَ بَيْني‌ وَبَيْنَهُ المَوْتُ الَّذِي‌ جَعَلْتَهُ عَلي‌ عِبادِكَ حَتْماً مَقْضِياً فَأَخْرِجْني‌ مِنْ قَبْرِي‌ مُؤْتَزِراً كَفَني‌ شاهِراً سَيْفي‌ مُجَرِّداً قَناتي‌ مُلَبِّياً دَعْوَةَ الدّاعِي‌ في‌ الحاضِرِ وَالبادِي‌ اللّهُمَّ أَرِني‌ الطَّلْعَةَ الرَّشِيدَةَ وَالغُرَّةَ الحَمِيدَةَ وَأَكْحَلْ ناظِرِي‌ بِنَظْرَةٍ مِنِّي‌ إِلَيهِ وَعَجِّلْ فَرَجَهُ وَسَهِّلْ مَخْرَجَهُ وَأَوْسِعْ مَنْهَجَهُ وَاسْلُكْ بِهِ مَحَجَّتَهُ وَأَنْفِذْ أَمْرَهُ وَاشْدُدْ أَزْرَهُ وَأَعْمُرِ اللّهُمَّ بِهِ بِلادَكَ وَأَحْي‌ بِهِ عِبادَكَ فَإِنَّكَ قُلْتَ وَقَوْلُكَ الحَقُّ ظَهَرَ الفَسادُ في‌ البَرِّ وَالبَحْرِ بِما كَسَبَتْ أَيْدِي‌ النّاسِ فَأَظْهِرِ اللّهُمَّ لَنا وَلِيِّكَ وَابْنَ بِنْتِ نَبِيِّكَ المُسَمّى بِاسْمِ رَسُولِكَ صَلّىَ اللهُ عَلَيْهَ وَآلِهِ وَسَلَّمَ حَتّى لا يَظْفَرَ بِشَيْءٍ مِنَ الباطِلِ إِلاّ مَزَّقَهُ وَيُحِقَّ الحَقَّ وَيُحَقِّقَهُ وَاجْعَلْهُ اللّهُمَّ مَفْزَعاً لِمَظْلُومِ عِبادِكَ وَناصِراً لِمَنْ لا يَجِدُ لَهُ ناصِراً غَيْرَكَ وَمُجَدِّداً لِما عُطِّلَ مِن‌ أَحْكامِ كِتابِكَ وَمُشَيداً لِما وَرَدَ مِنْ أَعْلامِ دِينِكَ وَسُنَنِ نَبِيِّكَ صَلّىَ اللهُ عَلَيْهِ وَآلِهِ وَاجْعَلْهُ اللّهُمَّ مِمَّنْ حَصَّنْتَهُ مِنْ بَأْسِ المُعْتَدِينَ اللّهُمَّ وَسُرَّ نَبِيِّكَ مُحَمَّداً صَلّىَ اللهُ عَلَيْهِ وَآلِهِ بِرُؤْيتِهِ وَمَنْ تَبِعَهُ عَلى دَعْوَتِهِ وَارْحَمِ اسْتِكانَتَنا بعْدَهُ اللّهُمَّ اكْشِفْ هذِهِ الغُمَّةِ عَنْ هذِهِ الأُمَّةِ بِحُضُورِهِ وَعَجِّلْ لَنا ظُهُورَهُ إِنَّهُمْ يرَوْنَهُ بعِيداً وَنَراهُ قَرِيباً بِرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ (ثمّ يضرب‌ على فخذه‌ الأيمن‌ بيده‌ ثلاثاً ويقول‌ في‌ كلّ مرّة‌): العَجَل‌ العَجَل‌ يا مَولاي‌َ يا صَاحِبَ الزَّمانِ    `,

translation:` 
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
اے معبود اے عظیم نورکے پرودگار اے بلند کرسی کے پرودگار اے موجیں مارتے سمندر کے پرودگار اور اے توریت اور انجیل اور زبور کے نازل کرنے والے اور اے سایہ اور دھوپ کے پرودگار اے قرآن عظیم کے نازل کرنے والے اے مقرب فرشتوں اور فرستادہ نبیوں اور رسولوں کے پروردگار اے معبود بے شک میں سوال کرتا ہوں تیری ذات کریم کے واسطے سے تیری روشن ذات کے نور کے واسطے سے اور تیری قدیم بادشاہی کے واسطے سے اے زندہ اے پائندہ تجھ سے سوال کرتا ہوں تیرے نام کے واسطے سے جس سے چمک رہے ہیں سارے آسمان اور ساری زمینیں تیرے نام کے واسطے سے جس سے اولین وآخرین نے بھلائی پائی اے زندہ ہر زندہ سے پہلے اور اے زندہ ہر زندہ کے بعد اور اے زندہ جب کوئی زندہ نہ تھا اے مردوں کو زندہ کرنے والے اے زندوں کو موت دینے والے اے وہ زندہ کہ تیرے سواء کوئی معبود نہیں اے معبود ہمارے مولا امام ہادی مہدی کو جو تیرے حکم سے قائم ہیں ان پر اور ان کے پاک بزرگان پر خدا کی رحمتیں ہوں اور تمام مومن مردوں اور مومنہ عورتوں کی طرف سے جو زمین کے مشرقوں اور مغربوں میں ہیں  میدانوں اور پہاڑوں اور خشکیوں اور سمندروں میں میری طرف سے میرے والدین کیطرف سے بہت درود پہنچا دے جو ہم وزن ہو عرش اور اسکے کلمات کی روشنائی کے اور جو چیزیں اس کے علم میں ہیں اور اس کی کتاب میں درج ہیں اے معبود میں تازہ کرتا ہوں ان کے لیے آج کے دن کی صبح کو اور جب تک زندہ ہوں باقی ہے یہ پیمان یہ بندھن اور ان کی بیعت جو میری گردن پر ہے نہ اس سے مکروں گانہ کبھی ترک کروں گا اے معبود مجھے ان کے مدد گاروں ان کے ساتھیوں اور ان کا دفاع کرنے والوں قرار دے میں حاجت برآری کیلئے ان کی طرف بڑھنے والوں انکے احکام پر عمل کرنے والوں انکی طرف سے دعوت دینے والوں انکے ارادوں کو جلد پورے کرنے والوں اور انکے سامنے شہید ہونے والوں میں قرار دے اے معبود اگر میرے اور میرے امام کے درمیان موت حائل ہو جائے جو تو نے اپنے بندوں کے لیے آمادہ کر رکھی ہے تو پھر مجھے قبر سے اس  طرح نکالنا کہ کفن میرا لباس ہو میری تلوار بے نیام ہو میرا نیزہ بلند ہو داعی حق کی دعوت پر لبیک کہوں شہر اور گاؤں میں اے معبود مجھے حضرت کا رخ زیبا  آپ کی درخشاں پیشانی دکھا ان کے دیدار کو میری آنکھوں کا سرمہ بنا ان کی کشائش میں جلدی فرما ان کے ظہور کو آسان بنا ان کا راستہ وسیع کر دے اور مجھ کو ان کی راہ پر چلا ان کا حکم جاری فرما ان کی قوت کو بڑھا اور اے معبود ان کے ذریعے اپنے شہر آباد کر اوراپنے بندوں کو عزت کی زندگی دے کیونکہ تو نے فرمایا اور تیرا قول حق ہے کہ ظاہر ہوا فساد خشکی اور سمندر میں یہ نتیجہ ہے  لوگوں کے غلط اعمال و افعال کا پس اے معبود! ظہور کر ہمارے لیے اپنے ولی اور اپنے نبی کی دختر (س) کے فرزند کاجن کا نام تیرے رسول ﷺ کے نام پر ہے یہاں تک کہ وہ باطل کا نام و نشان مٹا ڈالیں حق کو حق کہیں اور اسے قائم کریں اے معبود قرار دے انکو اپنے مظلوم بندوں کیلئے جائے پناہ اور ان کے مددگار جن کا تیرے سوا کوئی مدد گار نہیں بنا ان کو اپنی کتاب کے ان احکام کے زندہ کرنے والے جو بھلا دیئے گئے ان کو اپنے دین کے خاص احکام اور اپنے نبی کے طریقوں کو راسخ کرنے والے بنا ان پر اور انکی آل پر خدا کی رحمت ہو اور اے معبود انہیں ان لوگوں میں رکھ جنکو تو نےظالموں کے حملے  سے بچایا اے معبود خوشنود کر اپنے نبی محمد ﷺ کو ان کے دیدار سے اور جنہوں نے ان کی دعوت میں انکا ساتھ دیا اور ان کے بعد ہماری حالت زار پر رحم  فرما اے معبود ان کے ظہور سے امت کی اس مشکل اور مصیبت کو دور کر دے اور ہمارے لیے جلد انکا ظہور فرما کہ لوگ انکو دور اور ہم انہیں نزدیک سمجھتے ہیں تیری رحمت کاواسطہ اے سب سے زیادہ رحم کرنے والے جلد آئیے جلد آئیے  اے میرے آقا اے زمانہ حاضر کے امام`,

reference:`<b> 📖 کتاب: مصباح المتهجد
✍️ مصنف: الشيخ أبو جعفر الطوسي

📚 جلد: 2
📄 صفحہ: 581

باب: أعمال ما بعد صلاة الفجر

امام جعفر الصادق عليه السلام نے فرمایا: جو شخص چالیس صبح مسلسل یہ دعا پڑھے، وہ حضرت القائم عليه السلام کے انصار میں شمار ہوگا۔ اگر ان کے ظہور سے پہلے وفات پا جائے تو اللہ تعالیٰ اسے قبر سے اٹھائے گا تاکہ وہ امام کی نصرت کرے، اور اس کے ہر لفظ کے بدلے ایک ہزار نیکیاں لکھی جائیں گی اور ایک ہزار گناہ مٹا دیے جائیں گے۔  `
}






,
{
id:3,

title:"دعائے کمیل",

english:"Dua-e-Kumayl",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`  
اللهُمَّ إنّي أسألُكَ بِرحَمتِكَ الَّتي وَسِعَت كُلَّ شيءٍ، وَبِقوَّتِكَ الَّتي قَهرتَ بِها كُلَّ شيءٍ، وَخضَعَ لَها كُلُّ شيءٍ، وَذَلَّ لَها كُلُّ شيءٍ، وَبِجَبَروتِكَ الَّتي غَلَبتَ بِها كُلَّ شيءٍ، وَبعَزَّتِكَ الَّتي لا يَقومُ لَها شيءٌ، وَبِعَظَمَتِكَ الَّتي مَلأت كُلَّ شيءٍ، وَبِسُلطانِكَ الَّذي عَلا كُلَّ شيءٍ، وَبِوَجهِكَ الباقي بَعدَ فَناءِ كُلِّ شيءٍ، وَبِأسمائِكَ الَّتي ملأت أركانَ كُلِّ شيءٍ، وَبِعِلمِكَ الَّذي أحاطَ بِكُلِّ شيءٍ، وَبِنورِ وَجهِكَ الَّذي أضاءَ لَهُ كُلُّ شيءٍ، يا نوُرُ يا قُدّوسُ، يا أوَّلَ الأوَّلينَ، وَيا آخِرَ الآخِرينَ. اللهُمَّ اغفِر ليَ الذُّنوبَ الَّتي تَهتِكُ العِصَمَ ، اللهُمَّ اغفِر ليَ الذُّنوبَ الَّتي تُنزِلُ النِّقَمَ. اللهُمَّ اغفِر ليَ الذُّنوبَ الَّتي تُغَيِّرُ النِّعَمَ، اللهُمَّ اغفِر ليَ الذُّنوبَ الَّتي تَحبِسُ الدُّعاءَ. اللهُمَّ اغفِر ليَ الّذنوبَ الّتي تُنزِلُ البَلاء. اللهُمَّ اغفِر لي كُلَّ ذَنبٍ أذنَبتُهُ، وَكُلَّ خَطيئَةٍ أخطَأتُها. اللهُمَّ إنّي أتَقَرَّبُ إلَيكَ بِذِكرِكَ وَأستَشفِعُ بِكَ إلى نَفسِكَ، وَأسألُكَ بِجوُدِكَ أن تُدنِيَني مِن قُربِكَ، وَأن تُوزِعَني شُكرَكَ، وأن تُلهِمَني ذِكرَكَ.
اللهُمَّ إنّي أسألُكَ سُؤالَ خاضِعٍ مُتَذَلِّلٍ خاشِعٍ، أن تُسامِحَني وَتَرحَمَني، وَتَجعَلَني بِقِسَمِكَ راضياً قانِعاً، وَفي جَميعِ الأحوالِ مُتَواضِعاً. اللهُمَّ وَأسألُكَ سُؤالَ مَن اشتَدَّت فاقَتُهُ، وَأنزَلَ بِكَ عِندَ الشَّدائِدِ حاجَتَهُ، وَعَظُمَ فيما عِندَكَ رَغبَتُهُ. اللهُمَّ عَظُمَ سُلطانُكَ وَعَلا مَكانُكَ، وَخَفيَ مَكرُكَ، وَظَهَرَ أمرُكَ، وَغَلَبَ قَهرُكَ، وَجَرَت قُدرَتُكَ، وَلايُمكِنُ الفِرارُ مِن حُكومَتِكَ. اللهُمَّ لا أجِدُ لِذُنوبي غافِراً وَلا لِقَبائِحي ساتِراً، وَلا لِشيءٍ مِن عَمَليَ القَبيحِ بِالحَسَنِ مُبَدِّلاً غَيرَكَ، لا إلهَ إلاّ أنتَ، سُبحانَكَ وَبِحَمدِكَ ظَلَمتُ نَفسي، وَتَجَرَّأتُ بِجَهلي، وَسَكَنتُ إلى قَديمِ ذِكرِكَ لي، وَمَنِّكَ عَلَيَّ. اللهُمَّ مَولايَ كَم مِن قَبيحٍ سَتَرتَهُ، وَكَم مِن فادِحٍ مِنَ البَلاءِ أقَلتَهُ ، وَكَم مِن عِثارٍ وَقَيتَهُ، وَكَم مِن مَكروُهٍ دَفَعتَهُ، وَكَم مِن ثَناءٍ جَميلٍ لَستُ أهلاً لَهُ نَشَرتَهُ.
اللهُمَّ عَظُمَ بَلائي، وَأفرَطَ بي سوءُ حالي، وَقَصُرَت بي أعمالي، وَقَعَدَت بي أغلالي وَحَبَسَني عَن نَفعي بُعدُ أمَلي ، وَخَدَعَتني الدُّنيا بِغُرورِها، وَنَفسي بِجِنايَتِها ، وَمِطالي يا سَيِّدي فَأسألُكَ بِعِزَّتِكَ أن لايَحجُبَ عَنكَ دُعائي سوءُ عَمَلي وَفِعالي، وَلاتَفضَحنِي بِخَفيِّ ما اطَّلَعتَ عَلَيهِ مِن سِرّي، وَلاتُعاجِلني بِالعُقوبَةِ عَلى ما عَمِلتُهُ في خَلَواتي مِن سوءِ فِعلي وَإساءَتي، وَدَوامِ تَفريطي وَجَهالَتي، وَكَثرَةِ شَهَواتي وَغَفلَتي، وَكُنِ اللهُمَّ بِعِزَّتِكَ لي في كُلِّ الأحوالِ رَؤوفاً، وَعَليَّ في جَميعِ الامورِ عَطوفاً. إلهي وَرَبّي مَن لي غَيرُكَ أسألَهُ كَشفَ ضُرّي وَالنَّظَرَ في أمري. إلهي وَمَولايَ أجرَيتَ عَلَيَّ حُكماً اتَّبَعتُ فيهِ هَوى نَفسي وَلَم أحتَرِس فيهِ مِن تَزيينِ عَدوّي، فَغَرَّني بِما أهوى وَأسعَدَهُ عَلى ذلِكَ القَضاءُ فَتَجاوَزتُ بِما جَرى عَلَيَّ مِن ذلِكَ بَعضَ حُدودِكَ، وَخالَفتُ بَعضَ أوامِرِكَ، فَلَكَ الحَمدُ عَلَيَّ في جَميعِ ذلِكَ وَلاحُجَّةَ لي فيما جَرى عَلَيَّ فيهِ قَضاؤُكَ، وَألزَمَني حُكمُكَ وَبَلاؤُكَ، وَقَد أتَيتُكَ يا إلهي بَعدَ تَقصيري وَإسرافي عَلى نَفسي مُعتَذِراً نادِماً مُنكَسِراً مُستَقيلاً مُستَغفِراً مُنيباً مُقِرّاً مُذعِنا مُعتَرِفاً، لا أجِدُ مَفَرّاً مِمّا كانَ مِنّي وَلا مَفزَعاً أتَوَجَّهُ إلَيهِ في أمري، غَيرَ قَبوُلِكَ عُذري وَإدخالِكَ إيايَ في سَعَةِ رَحمَتِكَ.
اللهُمَّ فَاقبَل عُذري، وَارحَم شِدَّةَ ضُرّي وَفُكَّني مِن شَدِّ وَثاقي، يا رَبِّ ارحَم ضَعفَ بَدَني، وَرِقَّةَ جِلدي وَدِقَّةَ عَظمي، يا مَن بَدَأ خَلقي وَذِكري وَتَربيَتي وَبِرّي وَتَغذيَتي، هَبني لابتِداءِ كَرَمِكَ وَسالِفِ بِرِّكَ بي، يا إلهي وَسَيِّدي وَرَبّي، أتُراكَ مُعَذِّبي بِنارِكَ بَعدَ تَوحيدِكَ وَبَعدَما انطَوى عَلَيهِ قَلبي مِن مَعرِفَتِكَ، وَلَهِجَ بِهِ لِساني مِن ذِكرِكَ، وَاعتَقَدَهُ ضَميري مِن حُبِّكَ وَبَعدَ صِدقِ اعتِرافي وَدُعائي خاضِعاً لِرُبوبيَّتِكَ، هَيهاتَ أنتَ أكرَمُ مِن أن تُضَيِّعَ مَن رَبَّيتَهُ، أو تُبعِدَ مَن أدنَيتَهُ، أو تُشَرِّدَ مَن آوَيتَهُ، أو تسلّم إلى البَلاءِ مَن كَفَيتَهُ وَرَحِمتَهُ، وَلَيتَ شِعري يا سَيِّدي وَإلهي وَمَولايَ أتُسَلِّطُ النّارَ عَلى وُجوهٍ خَرَّت لِعَظَمَتِكَ ساجِدَةً، وَعَلى ألسُنٍ نَطَقَت بِتَوحيدِكَ صادِقَةً وَبِشُكرِكَ مادِحَةً، وَعَلى قُلوبٍ اعتَرَفَت بِإلهيَّتِكَ مُحَقِّقَةً، وَعَلَى ضَمائِرَ حَوَت مِنَ العِلمِ بِكَ حَتّى صارَت خاشِعَةً، وَعَلى جَوارِحَ سَعَت إلى أوطانِ تَعَبُّدِكَ طائِعَةً، وَأشارَت بِاستغفاركَ مُذعِنَةً ما هكَذا الظَنُّ بِكَ وَلا اُخبِرنا بِفَضلِكَ عَنكَ يا كَريمُ، يا رَبِّ وَأنتَ تَعلَمُ ضَعفي عَن قَليلٍ مِن بَلاءِ الدُّنيا وَعُقوباتِها، وَمايَجري فيها مِنَ المَكارِهِ عَلى أهلِها، عَلى أنَّ ذلِكَ بَلاءٌ وَمَكروهٌ قَليلٌ مَكثُهُ، يَسيرٌ بَقاؤهُ قَصيٌر مُدَّتُهُ، فَكَيفَ احتِمالي لِبَلاءِ الآخِرَةِ وَجَليلِ وُقوعِ المَكارِهِ فيها، وَهُوَ بَلاءٌ تَطولُ مُدَّتُهُ وَيَدومُ مَقامُهُ وَلايُخَفَّفُ عَن أهلِهِ لأنَّهُ لايَكونُ إلاّ عَن غَضَبِكَ وَانتِقامِكَ وَسَخَطِكَ وَهذا ما لاتَقومُ لَهُ السَّماواتُ وَالأرضُ، يا سَيِّدي فَكَيفَ بي وَأنا عَبدُكَ الضَّعيفُ الذَّليلُ الحَقيرُ المِسكينُ المُستَكينُ يا إلهي وَرَبّي وَسَيِّدي وَمَولايَ، لأيِّ الاُمورِ إلَيكَ أشكو، وَلِما مِنها أضِجُّ وَأبكي، لأليمِ العَذابِ وَشِدَّتِهِ، أم لِطولِ البَلاءِ وَمُدَّتِهِ فَلَئِن صَيَّرتَني لِلعُقوباتِ مَعَ أعدائِكَ، وَجَمَعتَ بَيني وَبَينَ أهلِ بَلائِكَ، وَفَرَّقتَ بَيني وَبَينَ أحِبّائِكَ وَأوليائِكَ ؛ فَهَبني يا إلهي وَسَيِّدي وَمَولايَ وَرَبّي، صَبَرتُ عَلى عَذابِكَ فَكَيفَ أصبِرُ عَلى فِراقِكَ وَهَبني صَبَرتُ عَلى حَرِّ نارِكَ فَكَيفَ أصبِرُ عَنِ النَّظَرِ إلى كَرامَتِكَ أم كَيفَ أسكُنُ في النّارِ وَرَجائي عَفوُكَ فَبِعِزَّتِكَ يا سَيِّدي وَمَولايَ اُقسِمُ صادِقاً، لَئِن تَرَكتَني ناطِقاً لأضِجَّنَّ إلَيكَ بَينَ أهلِها ضَجيجَ الآمِلينَ ، وَلأصرُخَنَّ إلَيكَ صُراخَ المُستَصرِخينَ، وَلأبكيَنَّ عَلَيكَ بُكاءَ الفاقِدينَ، وَلأُناديَنَّكَ أينَ كُنتَ يا وَليَّ المُؤمِنينَ، يا غايَةَ آمالِ العارِفينَ، يا غيا ثَ المُستَغيثينَ ، يا حَبيبَ قُلوُبِ الصّادِقينَ، وَيا إلهَ العالَمينَ، أفَتُراكَ، سُبحانَكَ يا إلهي وَبِحَمدِكَ تَسمَعُ فيها صَوتَ عَبدٍ مُسلِمٍ سُجِنَ فيها بِمُخالَفَتِهِ، وَذاقَ طَعمَ عَذابِها بِمَعصيَتِهِ، وَحُبِسَ بَينَ أطباقِها بِجُرمِهِ وَجَريرَتِهِ، وَهُوَ يَضِجُّ إلَيكَ ضَجيجَ مُؤَمِّلٍ لِرَحمَتِكَ، وَيُناديكَ بِلِسانِ أهلِ تَوحيدِكَ، وَيَتَوَسَّلُ إلَيكَ بِرُبوبيَّتِكَ، يا مَولايَ فَكَيفَ يَبقى في العَذابِ وَهُوَ يَرجوُ ماسَلفَ مِن حِلمِكَ أم كَيفَ تُؤلِمُهُ النَّارُ وَهُوَ يا مَلُ فَضلَكَ وَرَحمَتَكَ أم كَيفَ يُحرِقُهُ لَهيبُها وَأنتَ تَسمَعُ صَوتَهُ وَتَرى مَكانَهُ أم كَيفَ يَشتَمِلُ عَلَيهِ زَفيرُها وَأنتَ تَعلَمُ ضَعفَهُ أم كَيفَ يَتَقَلقَلُ بَينَ أطباقِها وَأنتَ تَعلَمُ صِدقَهُ أم كَيفَ تَزجُرُهُ زَبانيَتُها وَهُوَ يُناديكَ يا رَبَّه أم كَيفَ يَرجو فَضلَكَ في عِتقِهِ مِنها فَتَترُكُهُ فيها هَيهاتَ ما ذَلِكَ الظَنُّ بِكَ وَلا المُعروفُ مِن فَضلِكَ، وَلا مُشبِهٌ لِما عامَلتَ بِهِ الموَحِّدينَ مِن بِرِّكَ وَإحسانِكَ فَبِاليَقينِ أقَطَعُ لَولا ما حَكَمتَ بِهِ مِن تَعذيبِ جاحِديكَ، وَقَضَيتَ بِهِ مِن إخلادِ مُعانِديكَ، لَجَعلتَ النَّارَ كُلَّها بَرداً وَسَلاماً، وَما كَانَ لأحَدٍ فيها مَقَرّاً وَلا مُقاماً ، لكِنَّكَ تَقَدَّسَت أسماؤُكَ أقسَمتَ أن تَملَأها مِنَ الكافِرينَ مِنَ الجِنَّةِ وَالنَّاسِ أجمَعينَ، وَأن تُخَلِّدَ فيها المُعانِدينَ، وَأنتَ جَلَّ ثَناؤُكَ قُلتَ مُبتَدِئاً، وَتَطَوَّلتَ بِالإنعامِ مُتَكَرِّماً أفَمَن كانَ مُؤمِناً كَمَن كانَ فاسِقاً لا يَستَوونَ.
إلهي وَسَيِّدي، فَأسألُكَ بِالقُدرَةِ الَّتي قَدَّرتَها، وَبِالقَضيَّةِ الَّتي حَتَمتَها وَحَكَمتَها، وَغَلَبتَ مَن عَلَيهِ أجرَيتَها، أن تَهَبَ لي في هذِهِ اللّيلَةِ وَفي هذِهِ السَّاعَةِ، كُلَّ جُرمٍ أجرَمتُهُ، وَكُلَّ ذَنبٍ أذنَبتُهُ، وَكُلَّ قَبيحٍ أسرَرتُهُ، وَكُلَّ جَهلٍ عَمِلتُهُ، كَتَمتُهُ أو أعَلَنتُهُ، أخفَيتُهُ أو أظهَرتُهُ، وَكُلَّ سَيِّئَةٍ أمَرتَ بِإثباتِها الكِرامَ الكاتِبينَ، الَّذينَ وَكَّلتَهُم بِحِفظِ ما يَكونُ مِنّي، وَجَعَلتَهُم شُهوداً عَلَيّ مَعَ جَوارِحي، وَكُنتَ أنتَ الرَّقيبَ عَلَيَّ مِن وَرائِهِم، وَالشَّاهِدَ لِما خَفِيَ عَنهُم وَبِرَحمَتِكَ أخفَيتَهُ، وَبِفَضلِكَ سَتَرتَهُ، وَأن توَفِّرَ حَظّي مِن كُلِّ خَيرٍ أنزَلتَهُ ، أو إحسانٍ فَضَّلتَهُ ، أو بِرٍّ نَشَرتَهُ ، أو رِزقٍ بَسَطتَهُ ، أو ذَنبٍ تَغفِرُهُ، أو خَطأٍ تَستُرُهُ، يا رَبِّ يا رَبِّ يا رَبِّ، يا إلهي وَسَيِّدي وَمَولايَ وَمالِكَ رِقّي، يا مَن بِيَدِهِ ناصِيَتي، يا عَليماً بِضُرّي وَمَسكَنَتي، يا خَبيراً بَفَقري وَفاقَتي، يا رَبِّ يا رَبِّ يا رَبِّ، أسألُكَ بِحَقِكَ وَقُدسِكَ وَأعظَمِ صِفاتِكَ وَأسمائِكَ، أن تَجعَلَ أوقاتي مِنَ اللّيلِ وَالنَّهارِ بَذِكرِكَ مَعمورَةً، وَبِخِدمَتِكَ مَوصولَةً، وَأعمالي عِندَكَ مَقبولَةً، حَتَّى تَكونَ أعمالي وأورادي كُلُّها وِرداً وَاحِداً، وَحالي في خِدمَتِكَ سَرمَداً.
يا سَيِّدي يا مَن عَلَيهِ مُعَوَّلي، يا مَن إلَيهِ شَكَوتُ أحوالي، يا رَبِّ يا رَبِّ يا رَبِّ، قَوِّ عَلى خِدمَتِكَ جَوارِحي وَاشدُد عَلى العَزيمَةِ جَوانِحي، وَهَب ليَ الجِدَّ في خَشيَتِكَ، وَالدَّوامَ في الاتِّصالِ بِخِدمَتِكَ حَتَّى أسرَحَ إلَيكَ في مَيا دينِ السابِقينَ، واُسرِعَ إلَيكَ في البارِزينَ ، وَأشتاقَ إلى قُربِكَ في المُشتاقينَ، وَأدنوَ مِنكَ دُنوَّ المُخلِصينَ، وَأخافَكَ مَخافَةَ الموقِنينَ، وَأجتَمِعَ في جِوارِكَ مَعَ المُؤمِنينَ.
اللهُمَّ وَمَن أرادَني بِسوءٍ فَأرِدهُ، وَمَن كادَني فَكِدهُ، وَاجعَلني مِن أحسَنِ عَبيدِكَ نَصيباً عِندَكَ، وَأقرَبِهِم مَنزِلَةً مِنكَ، وَأخَصِّهِم زُلفَةً لَدَيكَ فِإنَّهُ لا يُنالُ ذلِكَ إلاّ بِفَضلِكَ، وَجُد لي بِجودِكَ، وَاعطِف عَلَيَّ بَمَجدِكَ وَاحفَظني بِرَحمَتِكَ، وَاجعَل لِساني بِذِكرِكَ لَهِجاً، وَقَلبي بِحُبِّكَ مُتَيَّماً ، وَمُنَّ عَلَيَّ بِحُسنِ إجابَتِكَ، وَأقِلني عَثرَتي، وَاغفِر زَلَّتي، فَإنَّكَ قَضيتَ عَلى عِبادِكَ بِعِبادَتِكَ، وَأمَرتَهُم بِدُعائِكَ، وَضَمِنتَ لَهُمُ الإجابَةَ، فَإلَيكَ يا رَبِّ نَصَبتُ وَجهي، وَإلَيكَ يا رَبِّ مَدَدتُ يَدي، فَبِعِزَّتِكَ استَجِب لي دُعائي، وَبَلِّغني مُنايَ، وَلا تَقطَع مِن فَضلِكَ رَجائي، وَاكفِني شَرَّ الجِنِّ وَالإنسِ مِن أعدائي. يا سَريعَ الرِّضا اغفِر لِمَن لا يَملِكُ إلاّ الدُّعاءَ، فَإنَّكَ فَعَّالٌ لِما تَشاءُ، يا مَن اسمُهُ دَواءٌ، وَذِكرُهُ شِفاءٌ، وَطاعَتُهُ غِنىً، ارحَم مَن رَأسُ مالِهِ الرَّجاءُ وَسِلاحُهُ البُكاءُ، يا سَابِغَ النِّعَمِ، يا دافِعَ النِّقَمِ، يا نورَ المُستَوحِشينَ في الظُّلَمِ، يا عالِماً لا يُعَلَّمُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَافعَل بي ما أنتَ أهلُهُ، وَصَلَّى اللهُ عَلى رَسولِهِ وَالأئِمَّةِ المَيا مينِ مِن آلِهِ وَسَلَّمَ تَسليماً.`,

translation:`    
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
اے معبود میں تجھ سے سوال کرتا ہوں تیری رحمت کے ذریعے جوہر شی پر محیط ہے تیری قوت کے ذریعے جس سے تو نے ہر شی کو زیر نگیں کیا اور اس کے سامنے ہر شی جھکی ہوئی اور ہر شی زیر ہے اور تیرے جبروت کے ذریعے جس سے توہر شی پر غالب ہے تیری عزت کے ذریعے جسکے آگے کوئی چیز ٹھہرتی نہیں تیری عظمت کے ذریعے جس نے ہر چیز کو پر کر دیا تیری سلطنت کے ذریعے جو ہر چیز سے بلند ہے تیری ذات کے واسطے سے جوہر چیز کی فنا کے بعد باقی رہے گی اورسوال کرتا ہوںتیرے ناموں کے ذریعے جنہوںنے ہر چیز کے اجزائ کو پر کر رکھا ہے تیرے علم کے ذریعے جس نے ہر چیز کو گھیر رکھا ہے اور تیری ذات کے نور کے ذریعے جس سے ہر چیز روشن ہوئی ہے یانور یاقدوس اے اولین میں سب سے اول اور اے آخرین میں سب سے آخر اے معبود میرے ان گناہوں کو معاف کر دے جو پردہ فاش کرتے ہیں خدایا! میرے وہ گناہ معاف کر دے جن سے عذاب نازل ہوتا ہے خدایا میرے وہ گناہ بخش دے جن سے نعمتیں زائل ہوتی ہیں اے معبود! میرے وہ گناہ معاف فرما جو دعا کو روک لیتے ہیں اے اللہ میرے وہ گناہ بخش دے جن سے بلائیں نازل ہوتی ہیں۔  اے خدا میرا ہر وہ گناہ معاف فرما جو میں نے کیا ہے اور ہر لغزش سے درگزر کر جو مجھ سے ہو ئی ہے اے اللہ میں تیرے ذکر کے ذریعے تیرا تقرب چاہتا ہوں اور تیری ذات کو تیرے حضور اپنا سفارشی بناتا ہوں تیرے جود کے واسطے سے سوال کرتا ہوں کہ مجھے اپناقرب عطا فرما اور توفیق دے کہ تیرا شکر ادا کروں  اور میری زبان پر اپنا ذکر جاری فرما اے اللہ میں سوال کرتا ہوں جھکے ہوئے گرے ہوئے ڈرے ہوئے کیطرح کہ مجھ سے چشم پوشی فرما مجھ پر رحمت کر اور مجھے اپنی تقدیر پر راضی و قانع اور ہر قسم کے حالات میں نرم خو رہنے والا بنا دے ۔ یااللہ میں تجھ سے سوال کرتا ہوں اس شخص کیطرح جو سخت تنگی میں ہو سختیوں میں پڑا ہواپنی حاجت لے کر تیرے پاس آیاہوں اور جو کچھ تیرے  پاس ہے اس میں زیادہ رغبت رکھتا ہوں اے اللہ تیری عظیم سلطلنت اور تیرا مقام بلند ہے تیری تدبیر پوشیدہ اور تیرا امر ظاہر ہے تیرا قہر غالب تیری قدرت کارگر ہے اور تیری حکومت سے فرار ممکن نہیں۔ خداوندا میں تیرے سوا کسی کو نہیں پاتا جو میرے گناہ  بخشنے والا میری برائیوں کو چھپانے والا اور میرے برے عمل کو نیکی میں بدل دینے والا ہو تیرے سوا کوئی معبود نہیں تو پاک ہے اور حمد تیرے ہی لیے ہے میںنے اپنے نفس پر ظلم کیا اپنی جہالت کی وجہ سے جرأت کی اور میں نے تیری قدیم یاد آوری  اور اپنے لیے تیری بخشش پر بھروسہ کیا ہے اے اللہ : میرے مولا کتنے ہی گناہوں کی تو نے پردہ پوشی کی اور کتنی ہی سخت بلائوں سے مجھے بچالیا کتنی ہی لغزشیں معاف فرمائیں اور کتنی ہی برائیاں مجھ سے دور کیں تو نے میری کتنی ہی تعریفیں عام کیں جن کا میں ہر گز اہل نہ تھا۔  اے معبود! میری مصیبت عظیم ہے بدحالی کچھ زیادہ ہی بڑھ چکی ہے میرے اعمال بہت کم ہیں گناہوں کی زنجیر نے مجھے جکڑ لیا ہے لمبی آرزوئوں نے مجھے اپنا قیدی بنا رکھا ہے دنیا نے دھوکہ بازی سے اور نفس نے جرائم اور حیلہ سازی سے مجھ کو فریب دیا ہے اے میرے آقا میں تیری عزت کا واسطہ دے کر سوال کرتا ہوں کہ میری بدعملی و بدکرداری میری دعا کو تجھ سے نہ روکے اور تو مجھے میرے پوشیدہ کاموں سے رسوا نہ کرے جن میں تو میرے راز کو جانتاہے اور مجھے اس پر سزا دینے میں جلدی نہ کر جو میں نے خلوت میں غلط کام کیا برائی کی ہمیشہ کوتاہی کی اس میں میری نادانی، خواہشوں کی کثرت اور غفلت بھی ہے۔  اور اے میرے اللہ تجھے اپنی عزت کا واسطہ میرے لیے ہر حال میں مہربان رہ اور تمام امور میں مجھ پر عنایت فرما میرے معبود میرے رب تیرے سوا میرا کون ہےجس سے سوال کروں کہ میری تکلیف دور کر دے اور میرے معاملے پر نظر رکھ۔  میرے معبود اور میرے مولا تو نے میرے لیے حکم صادر فرمایالیکن میں نے اس میں خواہش کا کہا مانا اور میں دشمن کی فریب کاری سے بچ نہ سکا اس نے میری خواہشوں میں دھوکہ دیا اور وقت نے اسکا ساتھ دیا پس تو نے جو حکم صادر کیا میں نے اس میں تیری بعض حدود کو توڑا اور تیرے بعض احکام کی  مخالفت کی پس اس معاملہ میں مجھ پر لازم ہے تیری حمد بجالانا۔  اور میرے پاس کوئی حجت نہیں اس میں جو  فیصلہ تو نے میرے لیے کیا ہے اور میرے لیے تیرا حکم اور تیری آزمائش لازم ہے اور اے اللہ میں تیرے حضور آیا ہوں جب کہ میں نے کو تاہی کی اور اپنے نفس پرزیادتی کی ہے میں عذر خواہ و پشیماں،ہارا ہوا، معافی کا طالب، بخشش کا سوالی ،تائب گناہوں کا اقراری، سرنگوں اور اقبال جرم کرتا ہوں جو کچھ مجھ سے ہوا نہ اس سے فرار کی راہ ہے نہ کوئی جا ئے پناہ کہ اپنے معاملے میں اسکی طرف توجہ کروںسوائے اسکے کہ تو میرا عذر قبول کر اور مجھے اپنی وسیع تر رحمت میں داخل کرلے اے معبود! بس میرا عذر قبول فرما میری سخت تکلیف پر رحم کر اور بھاری مشکل سے رہائی دے۔  اے پروردگار میرے کمزور بدن، نازک جلد اور باریک ہڈیوں پر رحم فرما اے وہ ذات جس نے میری خلقت ذکر، پرورش، نیکی اور غذا کا آغاز کیا اپنے پہلے کرم اور گزشتہ نیکی کے تحت مجھے معاف فرما اے میرے معبودمیرے آقا اور میرے رب کیا میں یہ سمجھوں کہ تو مجھے اپنی آگ کا عذاب دے گا جبکہ تیری توحید کا معترف ہوں اسکے ساتھ میرا دل تیری معرفت سے لبریز ہے اور میری زبان تیرے ذکر میں لگی ہوئی ہےمیرا ضمیر تیری محبت سے جڑا ہوا ہے اور اپنے گناہوں کے سچے اعتراف اور تیری ربوبیت کے آگے میری عاجزانہ پکار کے بعد بھی تو مجھے عذاب دے گا۔  ہرگز نہیں! تو بلند ہے اس سے کہ جسے پالا ہو اسے ضائع کرے یا جسے قریب کیا ہو اسے دور کرے یا جسے پناہ دی ہو اسے چھوڑ دے یا جسکی سرپرستی کی ہو اور اس پر مہربانی کی ہو اسے مصیبت کے حوالے کر دے اے کاش میں جانتا  اے میرے آقا میرے معبود!اور میرے مولا کہ کیا تو ان چہروں کو آگ میں ڈالے گا جو تیری عظمت کے سامنے سجدے میں پڑے ہیں اور ان زبانوں کو جو تیری توحید کے بیان میں سچی ہیں اور شکر کے ساتھ تیری تعریف کرتی ہیں اور ان دلوں کو جو تحقیق کیساتھ تجھے معبود مانتے ہیں۔  اور انکے ضمیروں کو جو تیری معرفت سے پر ہو کر تجھ سے خائف ہیں تو انہیں آگ میں ڈالے گا؟ اور ان اعضا کو جو فرمانبرداری سے تیری عبا دت گاہوں کی طرف دوڑتے ہیں اور یقین کے ساتھ تیری مغفرت کے طالب ہیں ﴿تو انہیں آگ میں ڈالے﴾ تیری ذات سے ایسا گمان نہیں، نہ یہ تیرے فضل کے مناسب ہے اے کریم اے پروردگار! دنیا کی مختصر تکلیفوں اور مصیبتوں کے مقابل تو میری ناتوانی کو جانتا ہے اور اہل دنیا پر جو تنگیاں آتی ہیں ﴿میں انہیں برداشت نہیں کرسکتا﴾ اگرچہ اس تنگی و سختی کا ٹھہراؤ اور بقا کا وقت تھوڑا اور مدت کوتاہ ہے۔  تو پھر  کیونکر میں آخرت کی مشکلوں کو جھیل سکوں گا جو بڑی سخت ہیں اور وہ ایسی تکلیفیں ہیں جنکی  مدت طولانی ،اقامت دائمی ہے اور ان میں سے کسی میں کمی نہیں ہو گی اس لیے کہ وہ تیرے غضب تیرے انتقام  اور تیری ناراضگی سے آتی ہیں اور یہ وہ سختیاں ہیں جنکے سامنے زمین وآسمان بھی کھڑے نہیں رہ سکتے تو اے آقا مجھ پر کیا گزرے گی جبکہ میں تیرا کمزور پست، بے حیثیت، بے مایہ اور بے بس بندہ ہوں اے میرے آقا اور میرے مولا! میں  کن کن باتوں کی تجھ سے شکایت کروں اور کس کس کے لیے نالہ و شیون کروں؟ دردناک عذاب اور اس کی سختی کے لیے یا طولانی مصیبت اور اس کی مدت کی زیادتی کیلئے پس اگر تو نے مجھے عذاب و عقاب میں اپنے دشمنوں کے ساتھ رکھااور مجھے اور اپنے عذابیوں کو اکٹھا کر دیا اور میرے اور اپنے دوستوں اور محبوں میں دوری ڈال دی تو اے میرے معبود میرے آقا میرے مولا اور میرے رب تو ہی بتا کہ میں تیرے عذاب پر صبر کر ہی لوں تو تجھ سے دوری پر کیسے  صبر کروں گا؟ اور مجھے بتاکہ میں نے تیری آگ کی تپش پر صبر کر ہی لیا تو تیرے کرم سے کسطرح چشم پوشی کرسکوں گا یا کیسے آگ میں  پڑا رہوں گا جب کہ میں تیرے عفو و بخشش کا امیدوار ہوں پس قسم ہے تیری عزت کی اے میرے آقا اور مولا سچی قسم کہ اگر تو نے میری گویائی باقی رہنے دی تو میں اہل نار کے درمیان تیرے حضور فریاد کروں گا آرزو مندوں کی طرح اور تیرے سامنے نالہ کروں گا جیسے  مددگار کے متلاشی کرتے ہیں تیرے فراق میں یوں گریہ کروں گا جیسے ناامید ہونے والے گریہ کرتے ہیںاور تجھے پکاروں گا کہاں  ہے تواے مومنوں کے مددگار اے عارفوں کی امیدوں کے مرکز اے بیچاروں کی داد رسی کرنے والے اے سچے لوگوں کے دوست  اور اے عالمین کے معبود کیا میں تجھے دیکھتا ہوں تو پاک ہے اس سے اے میرے اللہ اپنی حمد کے ساتھ کہ تو وہاں سے بندہ مسلم کی  آواز سن رہا ہے جو بوجہ نافرمانی دوزخ میں ہے اپنی برائی کے باعث عذاب کا ذائقہ چکھ رہا ہے اور اپنے جرم گناہ پر جہنم کے طبقوں کے بیچوں بیچ بند ہے وہ تیرے سامنے گریہ کر رہا ہے تیری رحمت کے امیدوار کی طرح اور اہل توحید کی زبان میں  تجھے پکار رہا ہے اور تیرے حضور تیری ربوبیت کو وسیلہ بنا رہا ہے اے میرے مولا! پس کس طرح وہ عذاب میں رہے گا جب کہ وہ تیرے گزشتہ حلم کا امیدوار ہے یا پھر آگ کیونکر اسے تکلیف دے گی جبکہ وہ تیرے فضل اور رحمت کی امید رکھتا ہے یا آگ کے شعلے کیسے اس کو جلائیں گے جبکہ تو اسکی آواز سن رہا ہے اور اس کے مقام کو دیکھ رہا ہے یا کیسے آگ کے شرارے اسے گھیریں گے جبکہ تو اسکی ناتوانی کو جانتا ہے یا کیسے وہ جہنم کے طبقوں میں پریشان رہے گا جبکہ تو اس کی سچائی سے واقف ہے یا کیسے جہنم کے فرشتے اسے جھڑکیں گے جبکہ وہ تجھے پکار رہا ہے اے میرے رب یا کیسے ممکن ہے کہ وہ خلاصی میں تیرے فضل کا امیدوار ہو اور تو اسے جہنم میں رہنے دے ہرگز نہیں! تیرے بارے میں یہ گمان نہیں ہو سکتا نہ تیرے فضل کا ایسا تعارف ہے نہ یہ توحید  پرستوں پر تیرے احسان و کرم سے مشابہ ہے۔  پس میں یقین رکھتا ہوں کہ اگر تو نے اپنے دشمنوں کو آگ کا عذاب دینے کا حکم نہ دیا ہوتا اور اپنے مخالفوں کوہمیشہ اس میں رکھنے کا فیصلہ نہ کیا ہوتا تو ضرور تو آگ کو ٹھنڈی اور آرام بخش بنا دیتا  اور کسی کو بھی آگ میں جگہ اور ٹھکانہ نہ دیا جاتا لیکن تو نے اپنے پاکیزہ ناموں کی قسم کھائی  کہ جہنم کو تمام کافروں سے بھر دے گا جنّوں اور انسانوں میں سے اور یہ مخالفین ہمیشہ اس میں رہیں گے اور تو بڑی تعریف والا ہے تو نے فضل و کرم کرتے ہوئے بلا سابقہ یہ فرمایا کہ کیا وہ شخص جو مومن ہے  وہ فاسق جیسا ہو سکتا ہے؟ یہ دونوں برابر نہیں میرے معبود میرے آقا! میں تیری قدرت جسے تو نے توانا کیا اور تیرا فرمان جسے تو نے  یقینی و محکم بنایا اور تو غالب ہے اس پر جس پر اسے جاری کرے اسکے واسطے سے سوال کرتا ہوںبخش دے اس شب میں اور اس  ساعت میں میرے تمام وہ جرم جو میں نے کیے تمام وہ گناہ جو مجھ سے سرزد ہوئے وہ سب برائیاں جو میں نے چھپائی ہیں جو نادانیاں میں نے جہل کی وجہ سے کیں ہیں علی الاعلان یا پوشیدہ، رکھی ہوں یا ظاہر کیں ہیں اور میری بدیاں جن کے لکھنے کا تو نے معزز کاتبین کو حکم دیا ہے جنہیں تو نے مقرر کیا ہے کہ جو کچھ میں کروں اسے محفوظ کریں اور ان کو میرے اعضائ کے ساتھ مجھ پر گواہ بنایا  اور انکے علاوہ خود تو بھی مجھ پر ناظر اور اس بات کا گواہ ہے جو ان سے پوشیدہ ہے حالانکہ تو نے اپنی رحمت سے اسے چھپایا اور اپنے فضل سے اس پر پردہ ڈالاوہ معاف فرما اور میرے لیے وافر حصہ قرار دے ہر اس خیر میں جسے تو نے نازل کیا یا ہر اس احسان میں جو  تو نے کیا یا ہر نیکی میں جسے تو نے پھیلایا رزق میں جسے تو نے وسیع کیا یا گناہ میں جسے تو معاف نے کیا یا غلطی میں جسے تو نے چھپایا  یارب یا رب یا رب۔ اے میرے معبود میرے آقا اورمیرے مولا اور میری جان کے مالک اے وہ جسکے ہاتھ میں میری لگام ہے  اے میری تنگی و بے چارگی سے واقف اے میری ناداری و تنگدستی سے باخبر یارب یارب یارب میں تجھ سے تیرے حق ہونے، تیری  پاکیزگی، تیری عظیم صفات اور اسمائ کا واسطہ دے کر سوال کرتا ہوں کہ میرے رات دن کے اوقات اپنے ذکر سے آباد کر اور مسلسل اپنی  حضوری میں رکھ اور میرے اعمال کو اپنی جناب میں قبولیت عطا فرما حتی کہ میرے تمام اعمال اور اذکار تیرے حضور  ورد قرار پائیں اور میرا یہ حال تیری بارگاہ میں ہمیشہ قائم رہے اے میرے آقا اے وہ جس پر میرا تکیہ ہے اے جس سے  میں اپنے حالات کی تنگی بیان کرتا ہوں یارب یارب یارب میرے ظاہری اعضائ کو اپنی حضوری میں قوی اور میرے باطنی ارادوں کو  محکم و مضبوط بنا دے اور مجھے توفیق دے کہ تجھ سے ڈرنے کی کوشش کروں اور تیری حضوری میں ہمیشگی پیدا کروں تاکہ تیری بارگاہ میں  سابقین کی راہوں پر چل پڑ و ں اور تیری طر ف جا نے والوں سے آگے نکل جا ئوں تیرے قرب کا شوق رکھنے والوں میں زیادہ شوق والا بن جائوں تیرے خالص بندوں کی طرح تیرے قریب ہو جائوں اہل یقین کی مانند تجھ سے ڈروں  اور تیرے آستانہ پر مومنوں کے ساتھ حاضر رہوں اے معبود جو میرے لئے برائی کا ارادہ کرے تو اسکے لئے ایسا ہی کر جو میرے  ساتھ مکر کر ے تو اسکے ساتھ بھی ایسا ہی کر مجھے اپنے بند و ںمیں قر ار دے جو نصیب میں بہتر ہیں جومنزلت میں تیرے قریب ہیں  جو تیرے حضور تقرب میں مخصوص ہیں کیونکہ تیرے فضل کے بغیر یہ درجات نہیں مل سکتے بواسطہ اپنے کرم کے مجھ پر کرم کر بذریعہ اپنی بزرگی کے مجھ پر توجہ فرما۔ بوجہ اپنی رحمت کے میری حفاظت کر میری زبان کو اپنے ذکر میں گویا فرما اور میرے دل کو اپنا اسیر محبت بنا دے میری دعا بخوبی قبول فرما مجھ پر احسان فرما میرا گناہ معاف کر دے اور میری خطا بخش دے کیونکہ تو نے بندوں پر  عبادت فرض کی ہے اور انہیں دعا مانگنے کا حکم دیا اور قبولیت کی ضمانت دی پس اے پروردگار میں اپنا رخ تیری طرف  کر رہا ہوں اور تیرے آگے ہاتھ پھیلا رہا ہوں تو اپنی عزت کے طفیل میری د عا قبول فرما میری تمنائیں برلا اور اپنے فضل سے لگی  میری امید نہ توڑ میرے دشمن جو جنّوں اور انسانوں سے ہیں ان کے شر سے میری کفایت کر۔ اے جلد را ضی ہونے والے مجھے بخش دے جو دعا کے سوا کچھ نہیں ر کھتا بے شک تو جو چا ہے کرنے والا ہے اے وہ جس کا نام دوا جس کا ذکر شفا اور اطاعت تونگری ہے رحم فرما اس پرجس کا سرمایہ محض امید ہے اور جس کا ہتھیار گریہ ہے  اے نعمتیں پوری کرنے والے اے سختیاں دور کرنے والے اے تاریکیوں میں ڈرنے والوں کیلئے نور اے وہ عالم جسے پڑھایا نہیں گیا  محمد(ص) آل(ع) محمد(ص) پر رحمت فرما مجھ سے وہ سلوک کر جس کا تو اہل ہے خدا اپنے رسول(ص) پر اور بابرکت آئمہ پرسلام بھیجتا ہے بہت زیادہ سلام وتحیات جو انکی آل(ع) میں سے ہیں۔  `,

reference:`<b> 📖 کتاب: مصباح المتهجد
✍️ مصنف: الشيخ أبو جعفر الطوسي

📚 جلد: 2
📄 صفحہ: 844–847
(بعض مطبوعات میں صفحہ مختلف ہو سکتا ہے)

📑 باب: أعمال ليلة النصف من شعبان
<br>
روایت ہے کہ کمیل بن زیاد نخعیؓ نے عرض کیا کہ امیر المؤمنین علی بن ابی طالب علیہ السلام نے مجھے یہ دعا تعلیم فرمائی اور فرمایا: یہ حضرت خضر علیہ السلام کی دعا ہے۔ جو شخص اسے شبِ نیمۂ شعبان میں پڑھے یا ہر جمعہ کی رات اس کی مداومت کرے، اللہ تعالیٰ اس کی دعا قبول فرماتا ہے، اسے دشمنوں کے شر سے محفوظ رکھتا ہے، اس کے رزق میں وسعت دیتا ہے، اس کے گناہ معاف فرماتا ہے اور اس پر رحمت نازل فرماتا ہے۔
<br>
مزید مصادر:
📚 إقبال الأعمال — السيد ابن طاووس
📚 بحار الأنوار — العلامة المجلسي (ج 91)
📚 مفاتيح الجنان — الشيخ عباس القمي  `
}






,
{
id:4,

title:"دعائے ندبہ",

english:"Dua-e-Nudba",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`
اَلْحَمْدُ للهِ رَبِّ الْعالَمينَ وَصَلَّى اللهُ عَلى سَيِّدِنا مُحَمَّدٍ نَبِيِّهِ وَآلِهِ وَسَلَّمَ تَسْليماً، اَللّـهُمَّ لَكَ الْحَمْدُ عَلى ما جَرى بِهِ قَضاؤكَ في اَوْلِيائِكَ الَّذينَ اسْتَخْلَصْتَهُمْ لِنَفْسِكَ وَدينِكَ، اِذِ اخْتَرْتَ لَهُمْ جَزيلَ ما عِنْدَكَ مِنَ النَّعيمِ الْمُقيمِ الَّذي لا زَوالَ لَهُ وَلاَ اضْمِحْلالَ، بَعْدَ اَنْ شَرَطْتَ عَلَيْهِمُ الزُّهْدَ في دَرَجاتِ هذِهِ الدُّنْيَا الدَّنِيَّةِ وَزُخْرُفِها وَزِبْرِجِها، فَشَرَطُوا لَكَ ذلِكَ وَعَلِمْتَ مِنْهُمُ الْوَفاءَ بِهِ فَقَبِلْتَهُمْ وَقَرَّبْتَهُمْ، وَقَدَّمْتَ لَهُمُ الذِّكْرَ الْعَلِيَّ وَالثَّناءَ الْجَلِىَّ، وَاَهْبَطْتَ عَلَيْهِمْ مَلائِكَتَكَ وَكَرَّمْتَهُمْ بِوَحْيِكَ، وَرَفَدْتَهُمْ بِعِلْمِكَ، وَجَعَلْتَهُمُ الذَّريعَةَ اِلَيْكَ وَالْوَسيلَةَ اِلى رِضْوانِكَ، فَبَعْضٌ اَسْكَنْتَهُ جَنَّتَكَ اِلى اَنْ اَخْرَجْتَهُ مِنْها، وَبَعْضٌ حَمَلْتَهُ في فُلْكِكَ وَنَجَّيْتَهُ وَمَنْ آمَنَ مَعَهُ مِنَ الْهَلَكَةِ بِرَحْمَتِكَ، وَبَعْضٌ اتَّخَذْتَهُ لِنَفْسِكَ خَليلاً وَسَأَلَكَ لِسانَ صِدْق فِي الاْخِرينَ فَاَجَبْتَهُ وَجَعَلْتَ ذلِكَ عَلِيّاً، وَبَعْضٌ كَلَّمْتَهُ مِنْ شَجَـرَةٍ تَكْليماً وَجَعَلْتَ لَهُ مِنْ اَخيهِ رِدْءاً وَوَزيراً، وَبَعْضٌ اَوْلَدْتَهُ مِنْ غَيْرِ اَب وَآتَيْتَهُ الْبَيِّناتِ وَاَيَّدْتَهُ بِرُوحِ الْقُدُسِ، وَكُلٌّ شَرَعْتَ لَهُ شَريعَةً، وَنَهَجْتَ لَهُ مِنْهاجاً، وَتَخَيَّرْتَ لَهُ اَوْصِياءَ، مُسْتَحْفِظاً بَعْدَ مُسْتَحْفِظ مِنْ مُدَّةٍ اِلى مُدَّةٍ، اِقامَةً لِدينِكَ، وَحُجَّةً عَلى عِبادِكَ، وَلِئَلّا يَزُولَ الْحَقُّ عَنْ مَقَرِّهِ وَيَغْلِبَ الْباطِلُ عَلى اَهْلِهِ، وَلا يَقُولَ اَحَدٌ لَوْلا اَرْسَلْتَ اِلَيْنا رَسُولاً مُنْذِراً وَاَقَمْتَ لَنا عَلَماً هادِياً فَنَتَّبِـعَ آياتِكَ مِنْ قَبْلِ اَنْ نَذِلَّ وَنَخْزى، اِلى اَنِ انْتَهَيْتَ بِالاَْمْرِ اِلى حَبيبِكَ وَنَجيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، فَكانَ كَمَا انْتَجَبْتَهُ سَيِّدَ مَنْ خَلَقْتَهُ، وَصَفْوَةَ مَنِ اصْطَفَيْتَهُ، وَاَفْضَلَ مَنِ اجْتَبَيْتَهُ، وَاَكْرَمَ مَنِ اعْتَمَدْتَهُ، قَدَّمْتَهُ عَلى اَنْبِيائِكَ، وَبَعَثْتَهُ اِلَى الثَّقَلَيْنِ مِنْ عِبادِكَ، وَاَوْطَأتَهُ مَشارِقَكَ وَمَغارِبَكَ، وَسَخَّرْتَ لَهُ الْبُراقَ، وَعَرَجْتَ (به) بِرُوْحِهِ اِلى سَمائِكَ، وَاَوْدَعْتَهُ عِلْمَ ما كانَ وَما يَكُونُ اِلَى انْقِضاءِ خَلْقِكَ، ثُمَّ نَصَرْتَهُ بِالرُّعْبِ، وَحَفَفْتَهُ بِجَبْرَئيلَ وَميكائيلَ وَالْمُسَوِّمينَ مِنْ مَلائِكَتِكَ وَوَعَدْتَهُ اَنْ تُظْهِرَ دينَهُ عَلَى الدّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ، وَذلِكَ بَعْدَ اَنْ بَوَّأتَهُ مَبَوَّأَ صِدْقٍ مِنْ اَهْلِهِ، وَجَعَلْتَ لَهُ وَلَهُمْ اَوَّلَ بَيْتٍ وُضِعَ لِلنّاسِ لَلَّذي بِبَكَّةَ مُبارَكاً وَهُدىً لِلْعالَمينَ، فيهِ آياتٌ بَيِّناتٌ مَقامُ اِبْراهيمَ وَمَنْ دَخَلَهُ كانَ آمِناً، وَقُلْتَ (اِنَّما يُريدُ اللهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ اَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهيراً) ثُمَّ جَعَلْتَ اَجْرَ مُحَمَّدٍ صَلَواتُكَ عَلَيْهِ وَآلِهِ مَوَدَّتَهُمْ في كِتابِكَ فَقُلْتَ: (قُلْ لا اَسْاَلُكُمْ عَلَيْهِ اَجْراً اِلاَّ الْمَوَدَّةَ فِى الْقُرْبى) وَقُلْتَ (ما سَألْتُكُمْ مِنْ اَجْر فَهُوَلَكُمْ) وَقُلْتَ: (ما اَسْاَلُكُمْ عَلَيْهِ مِنْ اَجْر الاّ مَنْ شاءَ اَنْ يَتَّخِذَ اِلى رَبِّهِ سَبيلاً)، فَكانُوا هُمُ السَّبيلَ اِلَيْكَ وَالْمَسْلَكَ اِلى رِضْوانِكَ، فَلَمَّا انْقَضَتْ اَيّامُهُ اَقامَ وَلِيَّهُ عَلِيَّ بْنَ اَبي طالِب صَلَواتُكَ عَلَيْهِما وَآلِهِما هادِياً، اِذْ كانَ هُوَ الْمُنْذِرَ وَلِكُلِّ قَوْم هاد، فَقالَ وَالْمَلأُ اَمامَهُ: مَنْ كُنْتُ مَوْلاهُ فَعَلِيٌّ مَوْلاهُ اَللّـهُمَّ والِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَانْصُرْ مَنْ نَصَرَهُ وَاخْذُلْ مَنْ خَذَلَهُ، وَقالَ: مَنْ كُنْتُ اَنَا نَبِيَّهُ فَعَلِيٌّ اَميرُهُ، وَقالَ اَنَا وَعَلِيٌّ مِنْ شَجَرَة واحِدَة وَسائِرُالنَّاسِ مِنْ شَجَر شَتّى، وَاَحَلَّهُ مَحَلَّ هارُونَ مِنْ مُوسى، فَقال لَهُ اَنْتَ مِنّي بِمَنْزِلَةِ هارُونَ مِنْ مُوسى الّا اَنَّهُ لا نَبِيَّ بَعْدي، وَزَوَّجَهُ ابْنَتَهُ سَيِّدَةَ نِساءِ الْعالَمينَ، وَاَحَلَّ لَهُ مِنْ مَسْجِدِهِ ما حَلَّ لَهُ، وَسَدَّ الاَْبْوابَ اِلاّ بابَهُ، ثُمَّ اَوْدَعَهُ عِلْمَهُ وَحِكْمَتَهُ فَقالَ: اَنـَا مَدينَةُ الْعِلْمِ وَعَلِىٌّ بابُها، فَمَنْ اَرادَ الْمَدينَةَ وَالْحِكْمَةَ فَلْيَاْتِها مِنْ بابِها، ثُمَّ قالَ: اَنْتَ اَخي وَوَصِيّي وَوارِثي، لَحْمُكَ مِنْ لَحْمي وَدَمُكَ مِنْ دَمي وَسِلْمُكَ سِلْمي وَحَرْبُكَ حَرْبي وَالإيمانُ مُخالِطٌ لَحْمَكَ وَدَمَكَ كَما خالَطَ لَحْمي وَدَمي، وَاَنْتَ غَداً عَلَى الْحَوْضِ خَليفَتي وَاَنْتَ تَقْضي دَيْني وَتُنْجِزُ عِداتي وَشيعَتُكَ عَلى مَنابِرَ مِنْ نُور مُبْيَضَّةً وُجُوهُهُمْ حَوْلي فِي الْجَنَّةِ وَهُمْ جيراني، وَلَوْلا اَنْتَ يا عَلِيُّ لَمْ يُعْرَفِ الْمُؤْمِنُونَ بَعْدي، وَكانَ بَعْدَهُ هُدىً مِنَ الضَّلالِ وَنُوراً مِنَ الْعَمى، وَحَبْلَ اللهِ الْمَتينَ وَصِراطَهُ الْمُسْتَقيمَ، لا يُسْبَقُ بِقَرابَةٍ في رَحِمٍ وَلا بِسابِقَةٍ في دينٍ، وَلا يُلْحَقُ في مَنْقَبَةٍ مِنْ مَناقِبِهِ، يَحْذُو حَذْوَ الرَّسُولِ صَلَّى اللهُ عَلَيْهِما وَآلِهِما، وَيُقاتِلُ عَلَى التَّأويلِ وَلا تَأخُذُهُ فِي اللهِ لَوْمَةُ لائِمٍ، قَدْ وَتَرَ فيهِ صَناديدَ الْعَرَبِ وَقَتَلَ اَبْطالَهُمْ وَناوَشَ (ناهش) ذُؤْبانَهُمْ، فَاَوْدَعَ قُلُوبَهُمْ اَحْقاداً بَدْرِيَّةً وَخَيْبَرِيَّةً وَحُنَيْنِيَّةً وَغَيْرَهُنَّ، فَاَضَبَّتْ عَلى عَداوَتِهِ وَاَكَبَّتْ عَلى مُنابَذَتِهِ، حَتّى قَتَلَ النّاكِثينَ وَالْقاسِطينَ وَالْمارِقينَ، وَلَمّا قَضى نَحْبَهُ وَقَتَلَهُ اَشْقَى الاْخِرينَ يَتْبَعُ اَشْقَى الاَْوَّلينَ، لَمْ يُمْتَثَلْ اَمْرُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي الْهادينَ بَعْدَ الْهادينَ، وَالاُْمَّةُ مُصِرَّةٌ عَلى مَقْتِهِ مُجْتَمِعَةٌ عَلى قَطيعَةِ رَحِمِهِ وَاِقْصاءِ وُلْدِهِ اِلّا الْقَليلَ مِمَّنْ وَفى لِرِعايَةِ الْحَقِّ فيهِمْ، فَقُتِلَ مَنْ قُتِلَ، وَسُبِيَ مَنْ سُبِيَ وَاُقْصِيَ مَنْ اُقْصِيَ وَجَرَى الْقَضاءُ لَهُمْ بِما يُرْجى لَهُ حُسْنُ الْمَثُوبَةِ، اِذْ كانَتِ الاَْرْضُ للهِ يُورِثُها مَنْ يَشاءُ مِنْ عِبادِهِ وَالْعاقِبَةُ لِلْمُتَّقينَ، وَسُبْحانَ رَبِّنا اِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولاً، وَلَنْ يُخْلِفَ اللهُ وَعْدَهُ وَهُوَ الْعَزيزُ الْحَكيمُ، فَعَلَى الاَْطائِبِ مِنْ اَهْلِ بَيْتِ مُحَمَّدٍ وَعَلِيٍّ صَلَّى اللهُ عَلَيْهِما وَآلِهِما فَلْيَبْكِ الْباكُونَ، وَاِيّاهُمْ فَلْيَنْدُبِ النّادِبُونَ، وَلِمِثْلِهِمْ فَلْتَذْرِفِ (فَلْتًدرِ) الدُّمُوعُ، وَلْيَصْرُخِ الصّارِخُونَ، وَيَضِجَّ الضّاجُّونَ، وَيَعِـجَّ الْعاجُّوَن، اَيْنَ الْحَسَنُ اَيْنَ الْحُسَيْنُ اَيْنَ اَبْناءُ الْحُسَيْنِ، صالِحٌ بَعْدَ صالِـحٍ، وَصادِقٌ بَعْدَ صادِقٍ، اَيْنَ السَّبيلُ بَعْدَ السَّبيلِ، اَيْنَ الْخِيَرَةُ بَعْدَ الْخِيَرَةِ، اَيْنَ الشُّمُوسُ الطّالِعَةُ، اَيْنَ الاَْقْمارُ الْمُنيرَةُ، اَيْنَ الاَْنْجُمُ الزّاهِرَةُ، اَيْنَ اَعْلامُ الدّينِ وَقَواعِدُ الْعِلْمِ، اَيْنَ بَقِيَّةُ اللهِ الَّتي لا تَخْلُو مِنَ الْعِتْرَةِ الْهادِيـَةِ، اَيـْنَ الـْمُعَدُّ لِـقَطْعِ دابِرِ الظَّلَمَةِ، اَيْنَ الْمُنْتَظَرُ لاِِقامَةِ الاَْمْتِ وَاْلعِوَجِ، اَيْنَ الْمُرْتَجى لاِزالَةِ الْجَوْرِ وَالْعُدْوانِ، اَيْنَ الْمُدَّخَرُ لِتَجْديدِ الْفَرآئِضِ و َالسُّنَنِ، اَيْنَ الْمُتَخَيَّرُ لاِِعادَةِ الْمِلَّةِ وَالشَّريعَةِ، اَيْنَ الْمُؤَمَّلُ لاِِحْياءِ الْكِتابِ وَحُدُودِهِ، اَيْنَ مُحْيي مَعالِمِ الدّينِ وَاَهْلِهِ، اَيْنَ قاصِمُ شَوْكَةِ الْمُعْتَدينَ، اَيْنَ هادِمُ اَبْنِيَةِ الشِّرْكِ وَالنِّفاقِ، اَيْنَ مُبيدُ اَهْلِ الْفُسُوقِ وَالْعِصْيانِ وَالطُّغْيانِ، اَيْنَ حاصِدُ فُرُوعِ الْغَيِّ وَالشِّقاقِ (النِفاقِ)، اَيْنَ طامِسُ آثارِ الزَّيْغِ وَالاَْهْواء،ِ اَيْنَ قاطِعُ حَبائِلِ الْكِذْبِ (الكَذِبِ) وَالاِْفْتِراءِ، اَيْنَ مُبيدُ الْعُتاةِ وَالْمَرَدَةِ، اَيْنَ مُسْتَأصِلُ اَهْلِ الْعِنادِ وَالتَّضْليلِ وَالاِْلْحادِ، اَيْنَ مُـعِزُّ الاَْوْلِياءِ وَمُذِلُّ الاَْعْداءِ، اَيْنَ جامِعُ الْكَلِمَةِ (الكَلِمِ)عَلَى التَّقْوى، اَيْنَ بابُ اللهِ الَّذى مِنْهُ يُؤْتى، اَيْنَ وَجْهُ اللهِ الَّذى اِلَيْهِ يَتَوَجَّهُ الاَْوْلِياءُ، اَيْنَ السَّبَبُ الْمُتَّصِلُ بَيْنَ الاَْرْضِ وَالسَّماءِ، اَيْنَ صاحِبُ يَوْمِ الْفَتْحِ وَناشِرُ رايَةِ الْهُدى، اَيْنَ مُؤَلِّفُ شَمْلِ الصَّلاحِ وَالرِّضا، اَيْنَ الطّالِبُ بِذُحُولِ الاَْنْبِياءِ وَاَبْناءِ الاَْنْبِياءِ، اَيْنَ الطّالِبُ (المُطالِبُ) بِدَمِ الْمَقْتُولِ بِكَرْبَلاءَ، اَيْنَ الْمَنْصُورُ عَلى مَنِ اعْتَدى عَلَيْهِ وَافْتَرى، اَيْنَ الْمُضْطَرُّ الَّذي يُجابُ اِذا دَعا اَيْنَ صَدْرُ الْخَلائِقِ ذُوالْبِرِّ وَالتَّقْوى، اَيْنَ ابْنُ النَّبِىِّ الْمُصْطَفى، وَابْنُ عَلِيٍّ الْمُرْتَضى، وَابْنُ خَديجَةَ الْغَرّآءِ، وَابْنُ فاطِمَةَ الْكُبْرى، بِاَبي اَنْتَ وَاُمّي وَنَفْسي لَكَ الْوِقاءُ وَالْحِمى، يَا بْنَ السّادَةِ الْمُقَرَّبينَ، يَا بْنَ النُّجَباءِ الاَْكْرَمينَ، يَا بْنَ الْهُداةِ الْمَهْدِيّينَ (المُهْتَدينَ)، يَا بْنَ الْخِيَرَةِ الْمُهَذَّبينَ، يَا بْنَ الْغَطارِفَةِ الاَْنْجَبينَ، يَا بْنَ الاَْطائِبِ الْمُطَهَّرينَ (المُتَطَهْريِِنَ)، يَا بْنَ الْخَضارِمَةِ الْمُنْتَجَبينَ، يَا بْنَ الْقَماقِمَةِ الاَْكْرَمينَ (الأكْبَرينَ)، يَا بْنَ الْبُدُورِ الْمُنيرَةِ، يَا بْنَ السُّرُجِ الْمُضيئَةِ، يَا بْنَ الشُّهُبِ الثّاقِبَةِ، يَا بْنَ الاَْنْجُمِ الزّاهِرَةِ، يَا بْنَ السُّبُلِ الْواضِحَةِ، يَا بْنَ الاَْعْلامِ الّلائِحَةِ، يَا بْنَ الْعُلُومِ الْكامِلَةِ، يَا بْنَ السُّنَنِ الْمَشْهُورَةِ، يَا بْنَ الْمَعالِمِ الْمَأثُورَةِ، يَا بْنَ الْمُعْجِزاتِ الْمَوْجُودَةِ، يَا بْنَ الدَّلائِلِ الْمَشْهُودَةِ (المَشْهُورَةِ)، يَا بْنَ الصـِّراطِ الْمُسْتَقيمِ، يَا بْنَ النَّبَأِ الْعَظيمِ، يَا بْنَ مَنْ هُوَ في اُمِّ الْكِتابِ لَدَى اللهِ عَلِيٌّ حَكيمٌ، يَا بْنَ الآياتِ وَالْبَيِّناتِ، يَا بْنَ الدَّلائِلِ الظّاهِراتِ، يَا بْنَ الْبَراهينِ الْواضِحاتِ الْباهِراتِ، يَا بْنَ الْحُجَجِ الْبالِغاتِ، يَا بْنَ النِّعَمِ السّابِغاتِ، يَا بْنَ طه وَالْـمُحْكَماتِ، يَا بْنَ يس وَالذّارِياتِ، يَا بْنَ الطُّورِ وَالْعادِياتِ، يَا بْنَ مَنْ دَنا فَتَدَلّى فَكانَ قابَ قَوْسَيْنِ اَوْ اَدْنى دُنُوّاً وَاقْتِراباً مِنَ الْعَلِيِّ الاَْعْلى، لَيْتَ شِعْري اَيْنَ اسْتَقَرَّتْ بِكَ النَّوى، بَلْ اَيُّ اَرْض تُقِلُّكَ اَوْ ثَرى، اَبِرَضْوى اَوْ غَيْرِها اَمْ ذي طُوى، عَزيزٌ عَلَيَّ اَنْ اَرَى الْخَلْقَ وَلا تُرى وَلا اَسْمَعُ لَكَ حَسيساً وَلا نَجْوى، عَزيزٌ عَلَيَّ اَنْ (لا تُحِيطَ بِِيَ دُونكَ) تُحيطَ بِكَ دُونِيَ الْبَلْوى وَلا يَنالُكَ مِنّي ضَجيجٌ وَلا شَكْوى، بِنَفْسي اَنْتَ مِنْ مُغَيَّبٍ لَمْ يَخْلُ مِنّا، بِنَفْسي اَنْتَ مِنْ نازِحٍ ما نَزَحَ (يَنْزِحُ) عَنّا، بِنَفْسي اَنْتَ اُمْنِيَّةُ شائِقٍ يَتَمَنّى، مِنْ مُؤْمِن وَمُؤْمِنَةٍ ذَكَرا فَحَنّا، بِنَفْسي اَنْتَ مِنْ عَقيدِ عِزٍّ لايُسامى، بِنَفْسي اَنْتَ مِنْ اَثيلِ مَجْدٍ لا يُجارى، بِنَفْسي اَنْتَ مِنْ تِلادِ نِعَمٍ لا تُضاهى، بِنَفْسي اَنْتَ مِنْ نَصيفِ شَرَف لا يُساوى، اِلى مَتى اَحارُ فيكَ يا مَوْلايَ وَاِلى مَتي، وَاَىَّ خِطابٍ اَصِفُ فيكَ وَاَيَّ نَجْوى، عَزيزٌ عَلَيَّ اَنْ اُجابَ دُونَكَ وَاُناغى، عَزيزٌ عَلَيَّ اَنْ اَبْكِيَكَ وَيَخْذُلَكَ الْوَرى، عَزيزٌ عَلَيَّ اَنْ يَجْرِيَ عَلَيْكَ دُونَهُمْ ما جَرى، هَلْ مِنْ مُعينٍ فَاُطيلَ مَعَهُ الْعَويلَ وَالْبُكاءَ، هَلْ مِنْ جَزُوعٍ فَاُساعِدَ جَزَعَهُ اِذا خَلا، هَلْ قَذِيَتْ عَيْنٌ فَساعَدَتْها عَيْني عَلَى الْقَذى، هَلْ اِلَيْكَ يَا بْنَ اَحْمَدَ سَبيلٌ فَتُلْقى، هَلْ يَتَّصِلُ يَوْمُنا مِنْكَ بِعِدَةٍ فَنَحْظى، مَتى نَرِدُ مَناهِلَكَ الرَّوِيَّةَ فَنَرْوى، مَتى نَنْتَقِعُ مِنْ عَذْبِ مائِكَ فَقَدْ طالَ الصَّدى، مَتى نُغاديكَ وَنُراوِحُكَ فَنُقِرَّ عَيْناً (فَتَقُرُ عًُيًُوننا)، مَتى تَرانا وَنَراكَ وَقَدْ نَشَرْتَ لِواءَ النَّصْرِ تُرى، اَتَرانا نَحُفُّ بِكَ وَاَنْتَ تَاُمُّ الْمَلاََ وَقَدْ مَلأْتَ الاَْرْضَ عَدْلاً وَاَذَقْتَ اَعْداءَكَ هَواناً وَعِقاباً، وَاَبَرْتَ الْعُتاةَ وَجَحَدَةَ الْحَقِّ، وَقَطَعْتَ دابِرَ الْمُتَكَبِّرينَ، وَاجْتَثَثْتَ اُصُولَ الظّالِمينَ، وَنَحْنُ نَقُولُ الْحَمْدُ للهِ رَبِّ الْعالَمينَ، اَللّـهُمَّ اَنْتَ كَشّافُ ْالكُرَبِ وَالْبَلْوى، وَاِلَيْكَ اَسْتَعْدى فَعِنْدَكَ الْعَدْوى، وَاَنْتَ رَبُّ الاْخِرَةِ وَالدُّنْيا (الاُول)، فَاَغِثْ يا غِياثَ الْمُسْتَغيثينَ عُبَيْدَكَ الْمُبْتَلى، وَاَرِهِ سَيِّدَهُ يا شَديدَ الْقُوى، وَاَزِلْ عَنْهُ بِهِ الاَْسى وَالْجَوى، وَبَرِّدْ غَليلَهُ يا مَنْ عَلَى الْعَرْشِ اسْتَوى، وَمَنْ اِلَيْهِ الرُّجْعى وَالْمُنْتَهى، اَللّـهُمَّ وَنَحْنُ عَبيدُكَ التّائِقُونَ (الشائقون) اِلى وَلِيِّكَ الْمُذَكِّرِ بِكَ وَبِنَبِيِّكَ، خَلَقْتَهُ لَنا عِصْمَةً وَمَلاذاً، وَاَقَمْتَهُ لَنا قِواماً وَمَعاذاً، وَجَعَلْتَهُ لِلْمُؤْمِنينَ مِنّا اِماماً، فَبَلِّغْهُ مِنّا تَحِيَّةً وَسَلاماً، وَزِدْنا بِذلِكَ يارَبِّ اِكْراماً، وَاجْعَلْ مُسْتَقَرَّهُ لَنا مُسْتَقَرّاً وَمُقاماً، وَاَتْمِمْ نِعْمَتَكَ بِتَقْديمِكَ اِيّاهُ اَمامَنا حَتّى تُورِدَنا جِنانَكَ (جَنّاتِكَ) وَمُرافَقَةَ الشُّهَداءِ مِنْ خُلَصائِكَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَصَلِّ عَلى مُحَمَّدٍ جَدِّهِ وَرَسُولِكَ السَّيِّدِ الاَكْبَرِ، وَعَلى اَبيهِ السَّيِّدِ الاَصْغَرِ، وَجَدَّتِهِ الصِّدّيقَةِ الْكُبْرى فاطِمَةَ بِنْتِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَعَلى مَنِ اصْطَفَيْتَ مِنْ آبائِهِ الْبَرَرَةِ، وَعَلَيْهِ اَفْضَلَ وَاَكْمَلَ وَاَتَمَّ وَاَدْوَمَ وَاَكْثَرَ وَاَوْفَرَ ما صَلَّيْتَ عَلى اَحَدٍ مِنْ اَصْفِيائِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ، وَصَلِّ عَلَيْهِ صَلاةً لا غايَةَ لِعَدَدِها وَلا نِهايَةَ لِمَدَدِها وَلا نَفادَ لاَِمَدِها، اَللّـهُمَّ وَاَقِمْ بِهِ الْحَقَّ وَاَدْحِضْ بِهِ الْباطِلَ وَاَدِلْ بِهِ اَوْلِياءَكَ وَاَذْلِلْ بِهِ اَعْداءَكَ وَصِلِ اللّهُمَّ بَيْنَنا وَبَيْنَهُ وُصْلَةً تُؤَدّى اِلى مُرافَقَةِ سَلَفِهِ، وَاجْعَلْنا مِمَّنْ يَأخُذُ بِحُجْزَتِهِمْ، وَيَمْكُثُ في ظِلِّهِمْ، وَاَعِنّا عَلى تَأدِيَةِ حُقُوقِهِ اِلَيْهِ، وَالاْجْتِهادِ في طاعَتِهِ، وَاجْتِنابِ مَعْصِيَتِهِ، وَامْنُنْ عَلَيْنا بِرِضاهُ، وَهَبْ لَنا رَأَفَتَهُ وَرَحْمَتَهُ وَدُعاءَهُ وَخَيْرَهُ مانَنالُ بِهِ سَعَةً مِنْ رَحْمَتِكَ وَفَوْزاً عِنْدَكَ، وَاجْعَلْ صَلاتَنا بِهِ مَقبُولَةً، وَذُنُوبَنا بِهِ مَغْفُورَةً، وَدُعاءَنا بِهِ مُسْتَجاباً وَاجْعَلْ اَرْزاقَنا بِهِ مَبْسُوطَةً، وَهُمُومَنا بِهِ مَكْفِيَّةً، وَحَوآئِجَنا بِهِ مَقْضِيَّةً، وَاَقْبِلْ اِلَيْنا بِوَجْهِكَ الْكَريمِ وَاقْبَلْ تَقَرُّبَنا اِلَيْكَ، وَانْظُرْ اِلَيْنا نَظْرَةً رَحيمَةً نَسْتَكْمِلُ بِهَا الْكَرامَةَ عِنْدَكَ، ثُمَّ لا تَصْرِفْها عَنّا بِجُودِكَ، وَاسْقِنا مِنْ حَوْضِ جَدِّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ بِكَأسِهِ وَبِيَدِهِ رَيّاً رَوِيّاً هَنيئاً سائِغاً لا ظَمَاَ بَعْدَهُ يا اَرْحَمَ الرّاحِمينَ. `,

translation:`   
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
حمد ہے خدا کیلئے جو جہانوں کا پرودگار ہے اور خدا ہمارے سردار اور اپنے نبی محمد اور ان کی آل پر رحمت کرے اور بہت بہت سلام بھیجے
اے معبود حمد ہے تیرے لیے کہ جاری ہو گی تیری قضاء و قدر تیرے اولیاء کے بارے میں جن کو تو نے اپنے لیے اور اپنے دین کیلئے خاص کیا جب کہ انہیں اپنے ہاں سے وہ نعمتیں عطا کی ہیں جو باقی رہنے والی ہیں جو نہ ختم ہوتی ہیں نہ کمزور پڑتی ہیں اس کے بعد کہ تو نے ان پر اس دنیا کے بے حقیقت مناصب جھوٹی شان و شوکت اور زینت سے دور رہنا لازم کیا پس انہوں نے یہ شرط پوری کی اور ان کی  وفا کو تو جانتا ہے تو نے انہیں قبول کیا مقرب بنایا ان کے ذکر کو بلند فرمایا اور ان کی تعریفیں ظاہر کیں تو نے ان کی طرف اپنے فرشتے بھیجے ان کو وحی سے مشرف کیا ان کو اپنے علوم سے نوازا اور ان کو وہ ذریعہ قرار دیا جوتجھ تک پہنچائے اور وہ وسیلہ جو تیری خوشنودی تک لے جائے پس ان میں کسی کو جنت میں رکھا یہاں تک کہ اس سے باہر بھیجا کسی کو اپنی کشتی میں سوار کیا اور بچا لیا اور جو ان کے ساتھ تھے انہیں موت سے بچایا تو نے اپنی رحمت کے ساتھ اور کسی کو تو نے اپنا خلیل بنایا پھردوسرے سچی زبان والوں نے تجھ سے سوال کیا جسے تو نے پورا فرمایا اسے بلند وبالا قرار دیا کسی کے ساتھ تو نے درخت کے ذریعے کلام کیا اور اس کے بھائی کو اس کا مدد گار بنایا کسی کو تو نے نے بن باپ کے پیدا فرمایا اسے بہت سے معجزات  دئیے اور روح قدس سے اسے قوت دی تو نے ان میں سے ہر ایک کے لیے ایک شریعت اور راستہ مقرر کیا ان کے لیے اوصیاء چنے کہ تیرے دین کو قائم رکھنے کے لیے ایک کے بعد دوسرا نگہبان آیا جو تیرے بندوں پر حجت قرار پایا تاکہ حق اپنے مقام سے نہ ہٹے اور باطل کے حامی اہل حق پر غلبہ نہ پائیں اور کوئی یہ نہ کہے کہ کاش تو نے ہماری طرف ڈرانے والا رسول بھیجا ہوتا اور ہمارے لیے ہدایت کا جھنڈا بلند کیا ہوتا کہ تیری آیتوں کی پیروی کرتے اس سے پہلے کہ ذلیل و رسوا ہوں یہاں تک کہ تو نے امر ہدایت اپنے حبیب اور پاکیزہ اصل محمد ﷺ کے  سپرد کیا پس وہ ایسے سردار ہوئے جن کو تو نے مخلوق میں سے پسند کیا برگزیدوں میں سے برگزیدہ بنایا جن کو چنا ان میں سے افضل بنایا اپنے خواص میں سے بزرگ قرار دیا انہیں نبیوں کا پیشوا بنایا اور ان کو اپنے بندوں میں سے جن وانس کی طرف بھیجا ان کیلئے سارے مشرقوں مغربوں کو زیر کر دیا براق کو انکا مطیع بنایا اور انکو جسم و جان کیساتھ آسمان پربلایا اور تو نے انہیں سابقہ و آئندہ باتوں کا علم دیا یہاں تک کہ تیری مخلوق ختم ہو جائے پھر ان کو دبدبہ عطا کیا اور ان کے گرد جبرائیل و میکائیل اور نشان زدہ فرشتوں کوجمع فرمایا ان سے وعدہ کیا کہ آپکا دین تمام ادیان پر غالب آئے گا اگرچہ مشرک دل تنگ ہوں اور یہ اس وقت ہوا جب ہجرت کے بعد تو نے انکے خاندان کوسچائی کے مقام پر جگہ دی اور انکے اور انکے ساتھیوں کیلئے قبلہ بنایا پہلا گھر جو مکہ میں بنا یا گیا جو جہانوں کیلئے برکت و ہدایت کا مرکز ہے اس میں واضح نشانیاں اور مقام ابراہیم ہے جو اس گھر میں داخل ہوااسے امان مل گئی نیز تو نے فرمایا ضرور خدا نے ارادہ کر لیا ہے کہ تم سے برائی کو دور کر دے اے اہلبیت اور تمہیں پاک رکھے جسطرح پاک رکھنے کا حق ہے محمد پر اور انکی آل پر تیری رحمتیں ہوں تو نے اہل بیت کی محبت کو انکا اجررسالت قرار دیا قرآن میں پس تو نے فرمایا کہہ دیں کہ میں تم سے اجر رسالت نہیں مانگتا مگر یہ کہ میرے اقربا سے محبت کرو اور تو نے کہا جو اجر میں نے تم سے مانگا ہے وہ تمہارے فائدے میں ہے نیز تو نے فرمایا میں نے تم سے اجر رسالت نہیں مانگا سوائے اسکے کہ یہ راہ اسکے لیے جو خدا تک پہنچنا چاہے پس اہل بیت تیرا مقرر کردہ راستہ  اور تیری خوشنودی کے حصول کا ذریعہ ہیں ہاں جب محمد رسول اللہ کا وقت پورا ہو گیا تو ان کی جگہ علی بن ابی طالب نے لے لیان دونوں پر اور انکی آل پر تیری رحمتیں ہوں علی رہبر ہیں جب کہ محمد ڈرانے والے اور ہر قوم کیلئے رہبر ہے پس فرمایا آپ نے جماعت صحابہ سے کہ جسکا میں مولا ہوں پس علی بھی اسکے مولا ہیں  اے معبود محبت کراس سے جو اس سے محبت کرے دشمنی کر اس سے جو اس سے دشمنی کرے مدد کر اسکی جو اسکی مدد کرے خوار کر اسکو جو اسے چھوڑے نیز فرمایا کہ جسکا میں نبی ہوں علی اسکا امیر و حاکم ہے اور فرمایا میں اور علی ایک درخت سے ہیں اور دوسرے لوگ مختلف درختوں سے پیدا ہوئے ہیں اور علی کو اپنا جانشین بنایا جیسے ہارون موسیٰ کے جانشین ہوئے پس فرمایااے علی تم میری نسبت وہی مقام رکھتے ہو جو ہارون کو موسیٰ کی نسبت تھا مگر میرے بعد کوئی نبی نہیں آپ نے علی کا نکاح اپنی بیٹی  سردار زنان عالم سے کیا مسجد میں ان کیلئے وہ امر حلال رکھا جو آپ کیلئے تھا اور مسجد کیطرف سے سبھی دروازے بندکرائے سوائے علی کے دروازے کے پھر اپنا علم و حکمت ان کے سپرد کیا تو فرمایا میں علم کاشہر ہوں اور علی اس کا دروازہ ہیں لہذا جو علم و حکمت کا  طالب ہے وہ اس در علم پر آئے نیز یہ کہا کہ اے علی تم میرے بھائی جانشین اور وارث ہو تمہارا گوشت میرا گوشت تمہارا خون میرا خون تمہاری صلح میری صلح تمہاری جنگ میری جنگ ہے اور ایمان تمہاری رگوں میں شامل ہے جیسے وہ میرے رگوں میں شامل ہے قیامت میں تم حوض کوثر پر میرے خلیفہ ہوگے تمہی میرے قرضے چکاؤ گے اور میرے وعدے نبھاؤ گے تمہارے شیعہ جنت میں چمکتے چہروں کیساتھ نورانی تختوں پرمیرے آس پاس میرے قرب میں ہوں گے اور اے علی اگر تم نہ ہوتے تو میرے بعد مومنوں کی پہچان نہ ہو پاتی چنانچہ وہ آپ کے بعد گمراہی سے ہدایت میں لانے والے تاریکی سے روشنی میں لانے والے خدا کا مضبوط سلسلہ اور اسکا سیدھا راستہ ہیں نہ قرابت پیغمبر میں کوئی ان سے بڑھا ہوا تھا نہ دین میں کوئی ان سے آگے تھا ان کے علاوہ کوئی بھی اوصاف میں رسول کے مانند نہ تھاعلی و نبی اور انکی آل پر خدا کی رحمت ہو علی نے تاویل قرآن پر جنگ کی اور خدا کے معاملے میں کسی ملامت کرنے والے کی ملامت کی پرواہ نہ کی عرب سرداروں کو ہلاک کیا انکے بہادروں کو قتل کیا اور انکے پہلوانوں کو پچھاڑا پس عربوں کے دلوں میں کینہ بھر گیا کہ بدر‘ خیبر‘ حنین وغیرہ میں انکے لوگ قتل ہو گئے پس وہ علی کی دشمنی میں اکھٹے ہوئے اور انکی مخالفت پر آمادہ ہو گئے چنانچہ آپ نے بیعت توڑنے والوں تفرقہ ڈالنے والوں اور ہٹ دھرمی کرنے والوں کو قتل کیا جب آپکا وقت پورا ہوا تو بعد والوں میں سے بدبخت ترین نے آپ کو قتل کیا اس نے پہلے والے شقی ترین کی پیروی کی رسول اللہ ﷺ کا فرمان پورا نہ ہوا جبکہ ایک رہبرکے بعد دوسرا رہبر آتا رہا اور امت اس کی دشمنی پر شدت سے کمر بستہ ہو کر اس پر ظلم ڈھاتی رہی اور اس کی اولاد کو پریشان کرتی رہی مگر تھوڑے سے لوگ وفادار تھے اور انکا حق پہچانتے تھے پس ان میں سے کچھ قتل ہوگئے کچھ قید میں ڈالے گئے اور کچھ بے وطن ہوئے ان پر قضا وارد ہو گئی جس پروہ بہترین اجر کے امیدوار ہوئے کیونکہ زمین خدا کی ملکیت ہے وہ اپنے بندوں میں سے جسے چاہے اسکا وارث بناتا ہے اور انجام کار پرہیزگاروں کیلئے ہے اور پاک ہے ہمارا رب کہ ہمارے رب کا وعدہ پورا ہو کر رہتا ہے ہاں خدا اپنے وعدے کے خلاف نہیں کرتا وہ زبر دست ہے حکمت والا پس حضرت محمدو حضرت علی کہ ان دونوں پر خدا کی رحمت ہو ان کے خاندان پران پر رونے والوں کو رونا چاہیے چنانچہ ان پر اور ان جیسوں پر دھاڑیں مار کر رونا چاہیے پس ان کیلئے آنسو بہائے جائیں رونے والے چیخ چیخ کر روئیں نالہ و فریاد بلند کریں اور اونچی آوازوں میں رو کر کہیں کہاں ہیں حسن کہاں ہیں حسین کہاں گئے فرزندان حسین ایک نیک کردار کے بعد دوسرا نیک کردار ایک سچے کے بعد دوسرا سچا کہاں گئے جو ایک کے بعد ایک راہ حق کے رہبر تھے کہاں گئے جو اپنے وقت میں خدا کے برگزیدہ تھے کدھر گئے وہ چمکتے سورج کیا ہوئے وہ دمتے چاند کہاں گئے وہ جھلملاتے ستارے کدھر گئے وہ دین کے نشان اور علم کے ستون کہاں ہے خدا کا آخری نمائندہ جو رہبروں کے اس خاندان سے باہر نہیں کہاں ہے وہ جو ظالموں کی جڑیں کاٹنے کیلئے آمادہ ہے کہاں ہے وہ جو انتظار میں ہے کہ کج کو سیدھا اور نا درست کو درست کرے کہاں ہے وہ امیدگاہ جو ظلم وستم کو مٹانے والا ہے کہاں ہے وہ جو فرائض اور سنن کو زندہ کرنے والا امام کہاں ہے وہ جو ملت اور شریعت کو راست کرنے والا کہاں ہے وہ جس کے ذریعے قرآن اور اس کے احکام کے زندہ ہونے کی توقع ہے کہاں ہے وہ جو دین اور اہل دین کے طریقے روشن کرنے والا کہاں ہے وہ جو ظالموں کا زور توڑنے والا کہاں ہے وہ جو شرک و نفاق کی بنیادیں ڈھانے والا کہاں ہے وہ جو بدکاروں نافرمانوں اور سرکشوں کو تباہ کرنے والا کہاں ہے وہ جو گمراہی اور تفرقے کی شاخیں کاٹنے والا کہاں ہے وہ جو کج دلی و نفس پرستی کے  داغ مٹانے والا کہاں ہے وہ جو جھوٹ اور بہتانکی رگیں کاٹنے والا کہاں ہے وہ جو سرکشوں اور مغروروں کو تباہ کرنے والا کہاں ہے وہ جو دشمنوں گمراہ کرنے والوں اور بے دینوں کی جڑیں اکھاڑنے والا کہاں ہے وہ جو دوستوں کو باعزت اور دشمنوں کو ذلیل کرنے والا کہاں ہے وہ جو سب کو تقویٰ پر جمع کرنے والا کہاں ہے وہ جو خدا کا دروازہ جس سے وارد ہوں کہاں ہے وہ جو مظہر خدا کہ جس کی طرف حبدار متوجہ ہوں کہاں ہے وہ جو زمین و آسمان کے پیوست رہنے کا وسیلہ کہاں ہے وہ جو یوم فتح کا حکمران اور ہدایت کا پرچم لہرانے والا کہاں ہے جو وہ نیکی و خوشنودی کا لباس پہننے والا کہاں ہے وہ جو نبیوں کے خون اور نبیوں کی اولاد کے خون کا دعویدار کہاں ہے وہ جو کربلا کے مقتول حسین کے خون کا مدعی کہاں ہے وہ جو اس پر غالب ہے جس نے زیادتی کی اور جھوٹ باندھا وہ پریشان کہ جب دعا مانگے قبول ہوتی ہے کہاں ہے وہ جو مخلوق کا حاکم جو نیک و پرہیز گار ہے کہاں ہے وہ جو نبی مصطفی کا فرزند علی مرتضی کا فرزند خدیجہ پاک کا فرزند اور فاطمہ کبری کا فرزند مہدی قربان آپ پر میرے ماں باپ اور میری جان آپ کیلئے فدا ہے اے خدا کے مقرب سرداروں کے فرزند اے پاک نسل بزرگواروں کے فرزند اے ہدایت یافتہ رہبروں کے فرزنداے برگزیدہ اور خوش اطوار بزرگوں کے فرزند اے پاک نہاد سرداروں کے فرزند اے پاکبازوں پاک شدگان کے فرزند اے پاک نژاد و سادات کے فرزند اے وسیع القلب عزت داروں کے فرزند اے روشن چاندوں کے فرزند اے روشن چراغوں کے فرزند اے روشن سیاروں کے فرزند اے چمکتے ستاروں کے فرزند اے روشن راہوں کے فرزند اے بلند مرتبے والوں کے فرزنداے حاملین علوم کے فرزند اے واضح روشوں کے فرزند اے مذکورہ علامتوں کے فرزند اے معجز نماؤں کے فرزند اے ظاہر دلائل کے فرزند اے سیدھے راستے کے فرزند اے عظیم خبر کے فرزند اے اس ہستی کے فرزند جو خدا کے ہاں ام الکتاب میں علی اور حکیم ہے اے واضح روشن آیات کے فرزند اے ظاہر اور دلائل کے فرزند اے واضح و روشن تر دلائل کے فرزند اے کامل حجتوں کے فرزند اے بہترین نعمتوں کے فرزند اے طہٴ اور محکم آیتوں کے فرزند اے یا سین و ذاریات کے فرزند اے طور اور عادیات کے فرزند اے اس ہستی کے فرزند جو نزدیک ہوئے تو اس سے مل گئے پس کمان کے دونوں سروں جتنے یا اس سے بھی نزدیک ہوئے علی اعلیٰ کے قریب ہو گئے اے کاش میں جانتا کہ اس دوری نے آپ کو کہاں جا ٹھہرایااور کس زمین میں اور کس خاک نے آپکو اٹھا رکھا ہے آپ مقام رضویٰ میں ہیں یا کسی اور پہاڑ پر ہیں یا وادی طویٰ میں یہ مجھ پر گراں ہے کہ مخلوق کو دیکھوں اور آپکو نہ دیکھ پاؤں نہ آپکی آہٹ سنوں اور نہ سر گوشی، مجھے رنج ہے کہ آپ تنہا سختی میں پڑے ہیں میں آپکے ساتھ نہیں ہوں اور میری آہ و زاری آپ تک نہیں پہنچ پاتی میری جان آپ پر قربان کہ آپ غائب ہیں مگر ہم سے دور نہیں میں آپ پر قربان آپ وطن سے دور ہیں لیکن ہم سے دور نہیں میں آپ پرقربان آپ ہر محب کی آرزو ہر مومن و مومنہ کی تمنا ہیں جس کیلئے وہ نالہ کرتے ہیں میں قربان آپ وہ عزت دار ہیں جنکا کوئی ثانی نہیں میں قربان آپ وہ بلند مرتبہ ہیں جن کے برابر کوئی نہیں میں قربان آپ وہ قدیمی نعمت ہیں جس کی مثل نہیں میں قربان آپ جو شرف رکھتے ہیں وہ کسی  اور کو نہیں مل سکتا کب تک ہم آپ کے لیے بے چین رہیں گے اے میرے آقا اور کب تک اور کسطرح آپ سے خطاب کروں اور سرگوشی کروں یہ مجھ پر گراں ہے کہ سوائے آپکے کسی سے جواب پاؤں یا باتیں سنوں مجھ پر گراں ہے کہ میں آپ کیلئے روؤں اور لوگ آپکو چھوڑے رہیں مجھ پر گراں ہے کہ لوگوں کیطرف سے آپ پر گزرے جو گزرے تو کیا کوئی ساتھی ہے جسکے ساتھ مل کر آپ کے لیے گریہ وزاری کروں کیا کوئی بے تاب ہے کہ جب وہ تنہا ہو تو اس کے ہمراہ نالہ کروں آیا کوئی آنکھ ہے جسکے ساتھ مل کر میری آنکھ غم کے آنسو بہائے اے احمد مجتبی کے فرزند آپ کے پاس آنے کا کوئی راستہ ہے کیا ہمارا آجکا دن آپکے کل سے مل جائے گا کہ ہم خوش ہوں کب وہ وقت آئیگا کہ ہم آپکے چشمے سے سیراب ہونگے کب ہم آپکے چشمہ ٴشیریں سے پیاس بجھائیں گے اب تو پیاس طولانی ہو گئی کب ہماری صبح و شام آپکے ساتھ گزرے گی کہ ہماری آنکھیں ٹھنڈی ہونگی کب آپ ہمیں اورہم آپکو دیکھیں گے جبکہ آپکی فتح کا پرچم لہراتا ہو گا ہم آپکے ارد گرد جمع ہونگے اور آپ سبھی لوگوں کے امام ہونگے تب زمین آپکے ذریعے عدل و انصاف سے  پر ہو گی آپ اپنے دشمنوں کو سختی و ذلت سے ہمکنار کرینگے آپ سرکشوں اور حق کے منکروں کو نابود کرینگے مغروروں کا زور توڑ دینگے اور ظلم کرنے والوں کی جڑیں کاٹ دینگے اس وقت ہم کہیں گے حمد ہے خدا کیلئے جوجہانوں کا رب ہے اے معبود تو دکھوں اور مصیبتوں کو دور کرنے والا ہے میں تیرے حضور شکایت لایا ہوں کہ تو مداوا کرتا ہے اور تو ہی دنیا و آخرت کا پروردگار ہے پس میری فریاد سن اے فریادیوں کی فریاد سننے والے اپنے اس حقیر اور دکھی بندے کو اس آقا کا دیدار کرا دے اے زبردست قوت والے انکے واسطے سے اسکے رنج و غم کو دور فرما اور اسکی پیاس بجھا دے اے وہ ذات جو عرش پر حاوی ہے کہ جسکی طرف واپسی اور آخری ٹھکانا ہے اور اے معبود ہم ہیں تیرے حقیر بندے جو تیرے ولی عصر کے مشتاق ہیں جن کا ذکر تو نے اور تیرے نبی نے کیا تو نے انہیں ہماری جائے پناہ بنایا ہمارا سہارا قرار دیا انکو ہماری زندگی کا ذریعہ اور پناہ گاہ بنایا اور انکو ہم میں سے مومنوں کا امام قرار دیا پس انکو ہمارا درود و سلام پہنچا اور اے پروردگار انکے ذریعے ہماری عزت میں اضافہ فرما انکی قرار گاہ کو ہماری قرار گاہ اور ٹھکانہ بنا دے ہم پر انکی امامت کے ذریعے ہمارے لیے اپنی نعمت پوری فرما یہاں تک کہ وہ ہمیں تیری جنت میں ان شہیدوں کے پاس لے جائینگے جو مقرب خاص ہیں اے معبود! محمد و آل محمد پر رحمت نازل فرما اور امام مہدی کے نانا محمد پر رحمت فرما جو تیرے رسول اور عظیم سردار ہیں اور مہدی کے والد پر رحمت کر جو چھوٹے سردار ہیں ان کی دادی صدیقہٴ کبری فاطمہ بنت محمد ﷺ پر رحمت فرما ان سب پر رحمت فرما جن کو تو نے انکے نیک بزرگوں میں سے چنا اور القائم پر رحمت فرما بہترین کامل پوری ہمیشہ ہمیشہ بہت سی بہت زیادہ جو رحمت کی ہو تو نے اپنے برگزیدوں میں سے کسی پر اور مخلوق میں سے اپنے پسند کردہ پر اور اس پر درود بھیج وہ درود جس کا شمار نہ ہوسکے جس کی مدت ختم نہ ہو اور جو کبھی منقطع نہ ہو اے معبود!انکے ذریعے حق کو قائم فرما انکے ہاتھوں باطل کو مٹا دے انکے وجود سے اپنے دوستوں کو عزت دے انکے ذریعے اپنے دشمنوں کو ذلت دے اور اے معبود ہمیں اور انکو اکٹھے کر دے ایسا اکٹھا کہ جو ہم کو انکے پہلے بزرگوں تک پہنچائے اور ہمیں ان میں قرار دے جنہوں نے ان کا دامن پکڑا ہے ہمیں ان کے زیر سایہ رکھ ان کے حقوق ادا کرنے میں ہماری مدد فرما ان کی فرما نبرداری میں کوشاں بنا دے انکی نافرمانی سے بچائے رکھ انکی خوشنودی سے ہم پر احسان کر اور ہمیں انکی محبت عطا فرما انکی رحمت انکی دعا اور انکی برکت عطا فرما جسکے ذریعے ہم تیری وسیع رحمت اور تیرے ہاں کامیابی حاصل کریں ان کے ذریعے ہماری نماز قبول فرما ان کے وسیلے ہمارے گناہ بخش دے انکے واسطے سے ہماری دعا منظور فرما اور انکے ذریعے سے ہماری روزیاں فراخ کر دے ہماری پریشانیاں دور فرما اور انکے وسیلے سے ہماری حاجات کو پورا فرما اور توجہ کر ہماری طرف اپنی ذات کریم کے واسطے سے اور قبول فرما اپنی بار گاہ میں ہماری حاضری ہماری طرف نظر کرمہربانی کی نظر کہ جس سے تیری درگاہ میں ہماری عزت بڑھ جائے پھر اپنے کرم کی وجہ سے وہ نظر ہم سے نہ ہٹا ہمیں القائم کے نانا کے حوض سے سیراب فرما ان پر اور انکی آل  پر خدا کی رحمت ہو انکے جام سے انکے ہاتھ سے سیر و سیراب کر جس میں مزہ آئے اور پھر پیاس نہ لگے اے سب سے زیادہ رحم والے ۔    `,

reference:`<b> 📖 کتاب: مصباح المتهجد
✍️ مصنف: الشيخ أبو جعفر الطوسي

📚 جلد: 2
📄 صفحہ: 548–556
(بعض مطبوعات میں صفحہ مختلف ہو سکتا ہے)

📑 باب: أعمال يوم الجمعة
<br>
روایت ہے کہ امام جعفر الصادق علیہ السلام نے فرمایا: یہ دعا ہمارے صاحب الامر حضرت قائم آل محمد علیہ السلام کی یاد، ان کے غیبت کے غم اور ان کے ظہور کی دعا کے لیے پڑھی جاتی ہے۔ مستحب ہے کہ اسے جمعہ کے دن، عیدِ غدیر، عیدِ فطر، عیدِ قربان اور چاروں عیدوں میں پڑھا جائے۔
<br>
مزید مصادر:
📚 المزار الكبير — محمد بن جعفر المشهدي
📚 إقبال الأعمال — السيد ابن طاووس
📚 بحار الأنوار — العلامة المجلسي (ج 99)
📚 مفاتيح الجنان — الشيخ عباس القمي  `
}




,
{
id:5,

title:"دعائے توسل",

english:"Dua-e-Tawassul",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`
اللّهُمَّ إنِّي أسْأَلُكَ وَأتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ نَبِيِّ الرَّحْمَةِ مُحَمَّدٍ صَلَّى الله عَلَيْهِ وَآلِهِ، يا أبا القاسِم يا رَسُولَ اللهِ يا إمامَ الرَّحْمَةِ يا سَيِّدَنا وَمَوْلانا إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا الحَسَنِ يا أَميرَ المُؤْمِنِينَ يا عَلِيَّ بْنَ أَبِي طالِبٍ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا فاطِمَةُ الزَّهْراءُ يا بِنْتَ مُحَمَّدٍ يا قُرَّةَ عَيْنِ الرَّسُولِ يا سَيِّدَتَنا وَمَوْلاتَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكِ إِلى اللهِ، وَقَدَّمْناكِ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهةً عِنْدَ اللهِ اِشْفَعِي لَنا عِنْدَ اللهِ.
يا أَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِيٍّ أَيُّها المُجْتَبى يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا عَبْدِاللهِ يا حُسَيْنَ بْنَ عَلِيٍّ أَيُّها الشَّهِيدُ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا الحَسَنِ يا عَلِيَّ بْنَ الحُسَيْنِ يا زَيْنَ العابِدِينَ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا جَعْفَرٍ يا مُحَمَّدَ بْنَ عَلِيٍّ، أَيُّها الباقِرُ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا عَبْدِاللهِ يا جَعْفَرَ بْنَ مُحَمَّدٍ، أَيُّها الصَّادِقُ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا الحَسَنِ يا مُوسَى بْنَ جَعْفَرٍ، أَيُّها الكاظِمُ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا الحَسَنِ يا عَلِيّ بْنَ مُوسَى، أَيُّها الرِّضا يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا جَعْفِرٍ يا مُحَمَّدَ بْنَ عَلِيٍّ، أَيُّها التَّقِيُّ الجَوادُ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا الحَسَنِ يا عَلِيَّ بْنَ مُحَمَّدٍ، أَيُّها الهادِي النَّقِي يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا أَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِيٍّ، أَيُّها الزَّكِيُّ العَسْكَرِيُّ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ.
يا وَصِيَّ الحَسَنِ وَالخَلَفَ الحُجَّةَ، أَيُّها القائِمُ المُنْتَظَرُ المَهْدِيُّ يا بْنَ رَسُولِ اللهِ يا حُجَّةَ اللهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلاَنا، إنَّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ إِلى اللهِ، وَقَدَّمْناكَ بَيْنَ يَدَيْ حاجاتِنا، يا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنا عِنْدَ اللهِ
يا سادَتِي وَمَوالِيَّ إِنِّي تَوَجَّهْتُ بِكُمْ أَئِمَّتِي لِيَوْمِ فَقْرِي وَحاجَتي إِلى اللهِ، وَتَوَسَّلْتُ بِكُمْ إِلى اللهِ، وَاسْتَشْفَعْتُ بِكُمْ إِلى اللهِ، فَاشْفَعُوا لِي عِنْدَ اللهِ، وَاسْتَنْقِذُونِي مِنْ ذُنُوبي عِنْدَ اللهِ، فَإنَّكُمْ وَسِيلَتِي إِلى اللهِ، وَبِحُبِّكُمْ وَبِقُرْبِكُمْ أَرْجُو نَجاةً مِنَ اللهِ، فَكُونُوا عِنْدَ اللهِ رَجائِي يا سادَتي يا أَوْلِياءَ اللهِ، صَلَّى اللهُ عَلَيْهِمْ أَجْمَعِينَ وَلَعَنَ اللهُ أعْداءَ اللهِ ظالِمِيهِم مِنَ الأوَّلِينَ وَالآخِرِينَ، آمِينَ رَبَّ العالَمِينَ. `,

translation:`   
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
اے معبود میں تجھ سے سوال کرتا ہوں اور تیری طرف متوجہ ہوتا ہوں تیرے پیغمبر(ص) نبی رحمت حضرت محمد کے وسیلے سے اے ابوالقاسم(ص) اے اﷲ کے رسول(ص) اے امام رحمت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کو بارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوالحسن(ع) اے امیرالمومنین(ع) اے علی(ع) ابن ابی طالب(ع) اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے فاطمہ الزہرا (ع) اے دختر محمد(ص) اے رسول(ص) کی آنکھوں کی ٹھنڈک اے ہماری سردار اور ہماری آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپکے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والی خدا کے حضور ہماری سفارش کیجئے
اے ابومحمد(ع) اے حسن(ع) بن علی(ع) اے پسندیدہ اے فرزند رسول(ص) اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہوتے ہیں آپ کو بارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے امنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابو عبداﷲ(ع) اے حسین(ع) بن علی(ع) اے شہید اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیںاور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوالحسن(ع) اے علی(ع) بن الحسین(ع) اے عابدوں کی زینت اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپکے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابو جعفر(ع) اے محمد(ع) ابن علی(ع) اے باقر(ع) اے فرزند رسول اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے جعفر(ع) ابن محمد(ع) اے صادق اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سرداراور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوالحسن(ع) اے موسٰی ابن جعفر(ع) اے کاظم(ع) اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوالحسن(ع) اے علی(ع) ابن موسٰی(ع) اے رضا(ع) اے فرزندرسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوجعفر(ع)اے محمد(ع) ابن علی(ع) اے تقی و جواد(ع) اے فرزند رسولﷺ اے خلق خدا پر اسکی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابوالحسن(ع) اے علی(ع) ابن محمد(ع) اے ہادی(ع) نقی(ع) اے فرزند رسول اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے ابو محمد(ع) اے حسن(ع) بن علی اے زکی اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار اور ہمارے آقا ہم آپ کی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپ کے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے
اے وصی حسن(ع) اے خلف حجت اے قائم منتظر مہدی(ع) اے فرزند رسولﷺ اے خلق خدا پر اس کی حجت اے ہمارے سردار و آقا ہم آپکی طرف متوجہ ہیں اور آپ کوبارگاہ الہی میں اپنا سفارشی اور وسیلہ بناتے ہیں اور اپنی حاجتیں آپکے سامنے پیش کرتے ہیں اے خدا کے ہاں عزت والے خدا کے حضور ہماری سفارش کیجئے۔

پس اپنی حاجات طلب کرے کہ وہ انشاء اﷲ پوری ہونگی ایک روایت میں ہے کہ اس کہ بعد یہ بھی پڑھے :

اے میرے سردار اور میرے آقا میرے ائمہ(ع) میرے سرمایہ میں اپنے فقر اور حاجت کے دن کے لئے تمھارے ذریعے اور وسیلے سے خدا کے سامنے حاضر ہوں اور خد اکے ہاں تمہیں اپنا سفارشی بناتا ہوں پس خدا کے حضور میری سفارش کیجئے اور خدا کی جانب سے میرے گناہ معاف کروائیے کیونکہ تم خدا کے ہاں میراوسیلہ ہو اور تمہاری محبت اور قربت کے وسیلے سے میں خدا سے طالب نجات ہوں پس میری امید گاہ بن جائو اے میرے سردار اے خدا کے پیارے خد اکی رحمت ہو ان تمام پر اور خدا کی لعنت ہو ان دشمنا ن خدا پر جنہوں نے ان پر ظلم ڈھائے کہ جو اولین اور اخرین میں سے ہیں آمین اے رب العالمین۔  `,

reference:`<b>مفاتیح الجنان</b><br>مصنف: شیخ عباس قمی<br>باب: دعائے توسل`
}

,
{
id:6,

title:"دعائے مشلول",

english:"Dua-e-Mashlool",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`
اللَّهُمَّ إنّي أسألُكَ باسمك بِسمِ اللهِ الرَّحمنِ الرَّحيمِ يا ذا الجَلالِ وَالإكرامِ يا حَيُّ يا قَيّومُ، يا حَيُّ لا إلهَ إلاّ أنتَ، يا هو يا مَن لا يَعلَمُ ما هُوَ وَلا كَيفَ هُوَ وَلا أينَ هُوَ وَلا حَيثُ هُوَ إلاّ هوَ، يا ذا المُلكِ وَالمَلَكوتِ، يا ذا العِزَّةِ وَالجَبَروتِ، يا مَلِكُ يا قُدّوسُ، يا سَلامُ، يا مُؤمِنُ، يا مُهَيمِنُ، يا عَزيزُ، يا جَبّارُ، يا مُتَكَبِّرُ، يا خالِقُ، يا بارئُ، يا مُصَوِّرُ، يا مُفيدُ، يا مُدَبِّرُ، يا شَديدُ، يا مُبدئُ، يا مُعيدُ، يا مُبيدُ، يا وَدودُ، يا مَحمودُ ، يا مَعبودُ، يا بَعيدُ، يا قَريبُ، يا مُجيبُ، يا رَقيبُ، يا حَسيبُ، يا بَديعُ، يا رَفيعُ، يا مَنيعُ، يا سَميعُ، يا عَليمُ، يا حَليمُ، يا كَريمُ، يا قَديمُ، يا عَليُّ، يا عَظيمُ، يا حَنّانُ، يا مَنّانُ، يا ديانُ، يا مُستَعانُ، يا جَليلُ، يا جَميلُ، يا وَكيلُ، يا كَفيلُ، يا مُقيلُ، يا مُنيلُ، يا نَبيلُ يا دَليلُ، يا هادي، يا بادي، يا أوَّلُ، يا آخِرُ، يا ظاهِرُ، يا باطِنُ، يا قائِمُ، يا دائِمُ، يا عالِمُ يا حاكِمُ، يا قاضي، يا عادِلُ، يا فاصِلُ، يا واصِلُ، يا طاهِرُ، يا مُطَهِّرُ، يا قادِرُ، يا مُقتَدِرُ، يا كَبيرُ، يا مُتَكَبِّرُ، يا واحِدُ، يا أحَدُ، يا صَمَدُ، يا مَن لَم يَلِد وَلَم يولَدُ وَلَم يَكُن لَهُ كُفواً أحَدٌ، وَلَم يَكُن لَهُ صاحِبَةٌ وَلا كانَ مَعَهُ وَزيرٌ، وَلا اتَّخَذَ مَعَهُ مُشيراً، وَلا احتاجَ إلى ظَهيرٍ، وَلا كانَ مَعَهُ مِن إلهٍ غَيرُهُ لا إلهَ إلاّ أنتَ، فَتَعالَيتَ عَمّا يَقولُ الظَّالِمُونَ عُلوّاً كَبيراً، يا عَليُّ، يا شامِخُ يا باذِخُ يا فَتّاحُ يا نَفّاحُ يا مُرتاحُ يا مُفَرِّجُ يا ناصِرُ يا مُنتَصِرُ يا مُدرِكُ يا مُهلِكُ يا مُنتَقِمُ، يا باعِثُ يا وارِثُ يا طالِبُ يا غالِبُ، يا مَن لا يَفوتُهُ هارِبٌ، يا تَوّابُ يا أوّابُ يا وَهّابُ، يا مُسَبِّبَ الأسبابِ، يا مُفَتِّحَ الأبوابِ، يا مَن حَيثُ ما دُعيَ أجابَ، يا طَهورُ يا شَكورُ يا عَفوُّ يا غَفورُ، يا نورَ النّورِ يا مُدَبِّرَ الاُمورِ، يا لَطيفُ يا خَبيرُ، يا مُجيرُ يا مُنيرُ يا بَصيرُ يا ظَهيرُ يا كَبيرُ يا وِترُ يا فَردُ يا أبَدُ يا سَنَدُ يا صَمَدُ، يا كافي يا شافي يا وافي يا مُعافي، يا مُحسِنُ يا مُجمِلُ يا مُنعِمُ يا مُفضلُ يا مُتَكَرِّمُ يا مُتَفَرِّدُ يا مَن عَلا فَقَهَرَ، يا مَن مَلَكَ فَقَدَرَ يا مَن بَطَنَ فخَبَرَ، يا مَن عُبِدَ فَشَكَرَ، يا مَن عُصيَ فَغَفَرَ، يا مَن لا تَحويهِ الفِكَرُ، وَلا يُدرِكُهُ بَصَرٌ، وَلا يَخفى عَلَيهِ أثَرٌ، يا رازِقَ البَشَرِ، يا مُقَدِّرَ كُلِّ قَدَرٍ، يا عاليَ المَكانِ يا شَديدَ الأركانِ، يا مُبَدِّلَ الزَّمانِ، يا قابِلَ القُربانِ يا ذا المَنِّ وَالإحسانِ يا ذا العِزَّةِ وَالسُّلطانِ يا رَحيمُ يا رَحمنُ يا مَن هُوَ كُلَّ يَومٍ في شَأنٍ يا مَن لا يَشغَلُهُ شَأنٌ عَن شَأنٍ يا عَظيمَ الشَّأنِ، يا مَن هُوَ بِكُلِّ مَكانٍ يا سامِعَ الأصواتِ يا مُجيبَ الدَّعَواتِ يا مُنجِحَ الطَّلِباتِ، يا قاضيَ الحاجاتِ، يا مُنزِلَ البَرَكاتِ يا راحِمَ العَبَراتِ، يا مُقيلَ العَثَراتِ يا كاشِفَ الكُرُباتِ يا وَليَّ الحَسَناتِ يا رافِعَ الدَّرَجاتِ يا مُؤتيَ السُّؤُلاتِ يا مُحييَ الأمواتِ، يا جامِعَ الشَّتاتِ، يا مُطَّلِعاً عَلى النّياتِ ، يا رادَّ ما قَد فاتَ، يا مَن لا تَشتَبِهُ عَلَيهِ الأصواتُ، يا مَن لا تُضجِرُهُ المَسألاتُ، وَلا تَغشاهُ الظُّلُماتُ، يا نورَ الأرضِ وَالسَّماواتِ، يا سابِغَ النِّعَمِ، يا دافِعَ النِّقَمِ، يا بارئَ النَّسَمِ، يا جامِعَ الأُمَمِ يا شافي السَّقَمِ يا خالِقَ النّورِ وَالظُّلَمِ، يا ذا الجودِ وَالكَرَمِ يا مَن لا يَطَأُ عَرشَهُ قَدَمٌ، يا أجوَدَ الأجوَدينَ، يا أكرَمَ الأكرَمينَ، يا أسمَعَ السَّامِعينَ، يا أبصَرَ النَّاظِرينَ، يا جارَ المُستَجيرينَ، يا أمانَ الخائِفينَ، يا ظَهرَ اللّاجينَ، يا وَليَّ المُؤمِنينَ، يا غيا ثَ المُستَغيثينَ، يا غايَةَ الطَّالِبينَ، يا صاحِبَ كُلِّ غَريبٍ، يا مُؤنِسَ كُلِّ وَحيدٍ، يا مَلجَأ كُلِّ طَريدٍ، يا مَأوى كُلِّ شَريدٍ، يا حافِظَ كُلِّ ضالَّةٍ، يا راحِمَ الشَّيخِ الكَبيرِ، يا رازِقَ الطِّفلِ الصَّغيرِ يا جابِرَ العَظمِ الكَسيرِ، يا فَاكَّ كُلِّ أسيرِ، يا مُغنيَ البائِسِ الفَقيرِ، يا عِصمَةَ الخائِفِ المُستَجيرِ، يا مَن لَهُ التَّدبيرُ وَالتَّقديرُ، يا مَنِ العَسيرُ عَلَيهِ سَهلٌ يَسيرٌ، يا مَن لا يَحتاجُ إلى تَفسيرٍ، يا مَن هُوَ عَلى كُلِّ شيءٍ قَديرٌ، يا مَن هُوَ بِكُلِّ شيءٍ خَبيرٌ، يا مَن هُوَ بِكُلِّ شيءٍ بَصيرٌ، يا مُرسِلَ الرياحِ، يا فالِقَ الإصباحِ، يا باعِثَ الأرواحِ، يا ذا الجودِ وَالسَّماِح، يا مَن بيَدِهِ كُلُّ مِفتاحٍ يا سامِعَ كُلِّ صَوتٍ، يا سابِقَ كُلِّ فَوتٍ يا مُحييَ كُلِّ نَفسٍ بَعدَ المَوتِ، يا عُدَّتي في شِدَّتي، يا حافِظي في غُربَتي، يا مؤنِسي في وَحدَتي، يا وَليّي في نِعمَتي، يا كَهفي حينَ تُعييني المَذاهِبُ، وَتُسَلِّمُني الأقارِبُ، وَيَخذلُني كُلُّ صاحِبٍ يا عِمادَ مَن لا عِمادَ لَهُ يا سَنَدَ مَن لا سَنَدَ لَهُ، يا ذُخرَ مَن لا ذُخرَ لَهُ، يا حِرزَ مَن لا حِرزَ لَهُ، يا كَهفَ مَن لا كَهفَ لَهُ، يا كَنزَ مَن لا كَنزَ لَهُ، يا رُكنَ مَن لا رُكنَ لَهُ يا غيا ثَ مَن لا غيا ثَ لَهُ، يا جارَ مَن لا جارَ لَهُ يا جاريَ اللّصيقَ، يا رُكنيَ الوَثيقَ، يا إلهي بِالتَّحقيقِ، يا رَبَّ البَيتِ العَتيقِ، يا شَفيقُ يا رَفيقُ، فُكَّني مِن حَلَقِ المَضيقِ، وَاصرِف عَنّي كُلَّ هَمٍّ وَغَمٍّ وَضيقٍ، وَاكفِني شَرَّ ما لا اُطيقُ، وَأعِنّي عَلى ما اُطيقُ، يا رادَّ يوسُفَ عَلى يَعقوبَ، يا كاشِفَ ضُرِّ أيّوبَ، يا غافِرَ ذَنبِ داوُدَ، يا رافِعَ عيسى بنِ مَريَمَ وَمُنجيَهُ مِن أيدي اليَهودِ يا مُجيبَ نِداءِ يونُسَ في الظُّلُماتِ، يا مُصطَفيَ موسى بِالكَلِماتِ، يا مَن غَفَرَ لآدَمَ خطيئَتَهُ، وَرَفَعَ إدريسَ مَكاناً عَلياً بِرَحمَتِهِ، يا مَن نَجَّى نوحاً مِنَ الغَرَقِ، يا مَن أهلَكَ عاداً الاُولى وَثَمودَ فَما أبقى، وَقَومَ نوحٍ مِن قَبلُ إنَّهُم كانوا هُم أظلَمَ وَأطغى، وَالمُؤتَفِكَةَ أهوى، يا مَن دَمَّرَ عَلى قَوِم لوطٍ، وَدَمدَمَ عَلى قَومِ شُعَيبٍ، يا مَن اتَّخَذَ إبراهيمَ خَليلاً، يا مَن اتَّخَذَ موسى كَليماً، وَاتَّخَذَ مُحَمَّداً (صلّى الله عليه و آله وَعَلَيهِم أجمَعينَ) حَبيباً، يا مُؤتي لُقمانَ الحِكمَةِ، وَالواهِبَ لِسُلَيمانَ مُلكاً لا يَنبَغي لأحَدٍ مِن بَعدِهِ، يا مَن نَصَرَ ذا القَرنَينِ عَلى المُلوكِ الجَبابِرَةِ، يا مَن أعطى الخِضرَ الحياةَ، وَرَدَّ ليوشَعَ بنَ نونٍ الشَّمسَ بَعدَ غُروبِها، يا مَن رَبَطَ عَلى قَلبِ اُمِّ موسى، وَأحصَنَ فَرجَ مَريَمَ ابنَةِ عِمرانَ، يا مَن حَصَّنَ يَحيى بنَ زَكَريا مِنَ الذَّنبِ، وَسَكَّنَ عَن موسى الغَضَبَ، يا مَن بَشَّرَ زَكَريا بيَحيى، يا مَن فَدى إسماعيلَ مِنَ الذَّبحِ بِذِبحٍ عَظيمٍ، يا مَن قَبِلَ قُربانَ هابيلَ وَجَعَلَ اللَّعنَةَ عَلى قابيلَ، يا هازِمَ الأحزابِ لِمُحَمَّدٍ (صلّى الله عليه و آله) ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَعَلى جَميعِ المُرسَلينَ وَمَلائِكَتِكَ المُقَرَّبينَ وَأهلِ طاعَتِكَ أجمَعينَ، وَأسألُكَ بِكُلِّ مَسألَةٍ سألَكَ بِها أحَدٌ مِمّن رَضيتَ عَنهُ، فَحَتَمتَ لَهُ عَلى الإجابَةِ، يا اللهُ يا اللهُ يا اللهُ، يا رَحمنُ يا رَحمنُ يا رَحمنُ، يا رَحيمُ يا رَحيمُ يا رَحيمُ، يا ذا الجَلالِ وَالإكرامِ، يا ذا الجَلالِ وَالإكرامِ، يا ذا الجَلالِ وَالإكرامِ، بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ، أسألُكَ بِكُلِّ اسمٍ سَمَّيتَ بِهِ نَفسَكَ، أو أنزَلتَهُ في شيءٍ مِن كُتُبِكَ، أو استَأثَرتَ بِهِ في عِلمِ الغَيبِ عِندَكَ، وَبِمَعاقِدِ العِزِّ مِن عَرشِكَ، وَبِمُنتَهى الرَّحمَةِ مِن كِتابِكَ، وَبِما لَو أنَّ ما في الأرضِ مِن شَجَرَةٍ أقلامٌ وَالبَحرُ يَمُدُّهُ مِن بَعدِهِ بِسَبعَةِ أبحُرٍ ما نَفِدَت كَلِماتُ اللهِ إنَّ اللهَ عَزيزٌ حَكيمٌ، وَأسألُكَ بِأسمائِكَ الحُسنى الَّتي نَعَتَّها في كِتابِكَ فَقُلتَ: {وَللهِ الأسماءِ الحُسنى فَادعوُه بِها} وَقُلتَ: {ادعُوني أستَجِب لَكُم}، وَقُلتَ: {وَإذا سألَكَ عِبادي عَنّي فَإنّي قَريبٌ اُجيبُ دَعوَةَ الدَّاعِ إذا دَعانِ}، وَقُلتَ: {يا عِباديَ الَّذينَ أسرَفوا عَلى أنفُسِهِم لا تَقنَطوا مِن رَحمَةِ اللهِ إنَّ الله يَغفِرُ الذُّنوبَ جَميعاً إنَّه هُوَ الغَفورُ الرَّحيمُ}.
وَأنا أسألُكَ يا إلهي، وَأدعوكَ يا رَبِّ، وَأرجوكَ يا سَيِّدي، وَأطمَعُ في إجابَتي يا مَولايَ كَما وَعَدتَني وَقَد دَعَوتُكَ كَما أمَرتَني، فَافعَل بي ما أنتَ أهلُهُ يا كَريمُ، وَالحَمدُ للهِ رَبِّ العالَمينَ وَصَلّى اللهُ عَلى مُحَمَّدٍ وَآلِهِ أجمَعينَ.               `,

translation:`  
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
اس دعا کا ایک اور نام بھی ہے یعنی دعا الشاب الماخوذ بذنبہیہ وہ دعا جو ایک نوجوان نے اپنے گنا ہوں کی سزا میں گرفتار ہونے کے بعد پڑھی۔مہج الد عو ات اور کتابِ کفعمی میں مذکو ر ہے یہ وہ دعا ہے جو امیر المو منین- نے اس نوجوان کو تعلیم فرمائی جو اپنے والدین کی نافرمانی کرنے کے با عث شل ہوگیا تھا جب اس نے یہ دعا پڑھی تو خواب میں دیکھا کہ رسول اللہصلى‌الله‌عليه‌وآله‌وسلم نے اپنا د ست شفقت اسکے بدن پر پھیرا اور فرما یا کہ اس اسم اعظم کو حفظ کر لے کہ یقینا تیرا کا م بن جا ئے گا ۔اب جو اسکی آنکھ کھلی تو کیا د یکھتا ہے کہ اسکا نا کا رہ جسم درست ہو گیا ہے وہ دعا یہ ہے :
*****
اے اللہ! میں تجھ سے سوال کرتا ہوں تیرے نام کے واسطے سے الله کے نام سے شروع کرتا ہوں جو رحمن ورحیم ہے اے جز جلالت و بزرگی اے زندہ، اے نگہبان، اے زندہ سوائے تیرے کوئی معبود نہیں اے وہ کہ جسے کوئی نہیں جانتا کہ وہ کیا ہے اور کیسا   ہے ،وہ کہاں ہے ،وہ کیوں کر ہے ہاں وہ خود ہی جانتا ہے۔اے صاحب ملک و ملکوت اے صاحب عزت و اقتدار، اے بادشاہ، اے پاک، اے   سلا متی والے، اے امن دینے وا لے، اے پاسبان، اے عزت والے، اے زبردست ،اے بڑائی والے،اے پیدا کرنے والے، اے وجود دینے والے، اے صورت بنانے والے ، اے فائدہ دینے والے، اے تدبیر والے، اے محکم کار  اے صاحب ایجاد، اے مرجع  خلق،اے ظالم کوختم کرنے والے، اے محبت والے، اے نیک صفات، اے معبود اے بعید، اے قریب  اے دعا قبول کرنے والے، اے نگہبان ،اے حساب کرنے والے،اے ایجاد کرنے والے،اے بلند مرتبہ اے عالی مقام، اےسننے والے، اے علم والے، اے حلم والے، اے مہربان، اے حکمت والے ،اے وجود قدیم، اے عالی شان اے بزرگی والے، اے محبت کرنے والے، اے احسان کرنے والے، اے جزا دینے والے، اے مدد کرنے والے، اے جلالت والے، اے صا حب جما ل، اے کارساز، اے سرپرست ،اے معاف کرنے والے ،اے پہنچانے والےاے باعظمت ،اے رہنما ،اے رہبر، اے ابتداء کرنے والے ،اے اول، اے آخر، اے ظاہر، اے   باطن ،اے استوار ،اے ہمیشہ رہنے والے، اے علم والے، اے صاحب حکم، اے منصف ،اے عدل کرنے والے، اے سب سے جدا، اے سب سے ملے ہو ئے، اے پاک  اے پاک کرنے والے، اے قدرت والے، اے اقتدار والے، اے بزرگ، اے بزرگی والے، اے یگانہ، اے یکتا اے بے نیاز، اے وہ جو کسی کا باپ نہیں اور نہ کسی کا  بیٹا ہے اور جسکا کوئی ہمسر نہیں ہے اور نہ ہی اس کی کوئی زوجہ ہے نہ اس کیلئے کوئی وزیر ہےاور نہ اس نے اپنا کوئی مشیر بنایا ہے نہ وہ کسی مددگار کی حاجت رکھتا ہے اور نہ اسکے ساتھ کوئی اور معبود ہے سوائے تیرے کوئی معبود نہیں پس تو اس سے بہت زیادہ بلند ہے جو یہ ظالم کہا کرتے ہیں۔اے عالی شان اے بلند مرتبہ والے اے عالی مرتبہ اے کھولنے والے اے بخشنے والے اے ہوا کو چلانے والےاے راحت دینے والے اے مدد کرنے والے اے مدد دینے والے اے پہنچنے والے اے ہلاک کرنے والے اے بدلہ لینے والے اے اٹھانے والے اے وارث اے طالب اے غالب اے وہ جس سے بھاگنے والا بھاگ نہیں سکتا اے توبہ قبول کرنے والے اے پلٹنے والے اے بہت دینے والے اے اسباب   مہیاکرنے والے اے دروازوں کے کھولنے والےاے وہ کہ جسے پکارا جا ئے تو وہ دعا قبول کرتا ہے اے بہت پاکیزہ اے بہت شکر کرنے والے اے معاف کرنے والے اے بخشنے والے اے نورکے پیدا کرنے والےاے امورکی تدبیرکرنے والے اے مہربان اے خبردار اے پناہ دینے والے اے روشن کرنے والے اے بینا اے مددگار اے سب سے بڑے اے بزرگ اے یکتا اے تنہا اے ہمیشگی والےاے نگہبا ن اے بے نیاز اے کافی اے شفا د ینے ،اے وفا کرنے ،اے معا ف کرنے ،اوراے احسا ن کرنے والے اے نیکوکار اے نعمت دینے والے اے بزرگواراے بڑے مرتبے والےاے یگانگی والے وہ جو بلندی کیساتھ غالب ہے اے وہ جو مالک ہے پھر قادر ہے اے وہ جو نہاں ہے اور باخبر ہے اے وہ جو معبود ہے تو بدلہ دیتا ہے اے جو نافرمانی پر بخشتا ہےاے وہ جو فکر میں سما نہیں سکتا اور نگاہ اسے دیکھ نہیں پاتی اور کوئی نشان اس سے پوشیدہ نہیں ہے اے انسانوں کو رزق دینے والے اے ہر اندازہ کے مقرر کرنے والے اے بلند مرتبہ اے محکم وسائل والے اے زمانے کو بدلنے والے اے قربانی قبول کرنے والے اے صاحب نعمت و احسان  اے صاحب عزت اور ابدی حکومت والےاے رحیم اے رحمن اے وہ کہ ہر روز جسکی نئی شان ہے اے وہ جسے ایک کام دوسرے کام سے غافل نہیں کرتا اے بڑے مقام والے اے وہ جو ہر جگہ موجود ہےاے آوازوں کے سننے والے اے دعا ئیں قبول کرنے والے اے مرادیں برلانے والے اے حاجات پوری کرنے والے اے برکتیں نازل کرنے والے اے آنسوؤں پر رحم کھانے والےاے گناہوں کے معاف کرنے والے اے سختیاں دور کرنے والے اے نیکیوں کو پسند کرنے والے اے مرتبے بلند کرنے والے اے مرادیں پوری کرنے والے اے مردوں کو زندہ کرنے والےاے بکھروں کو اکٹھا کرنے والے اے نیتوں کی خبر رکھنے والے اے کھوئی ہوئی چیزیں لوٹانے والے اے وہ جس پر آوازیں مشتبہ نہیں ہوتیں اے وہ جسے کثرت سوال سے تنگی نہیں ہوتی اور تاریکیاں اسے گھیرتی نہیں ہیں اے آسمانوں اور زمین کی روشنی اے نعمتوں کے پورا کرنے والے اے بلائیں ٹالنے والےاے جانداروں کو پیدا کرنے   والے اے امتوں کو جمع کرنے والے اے بیماروں کو شفا دینے والے اے روشنی اور تاریکی کے پیدا کرنے والے اے صاحب جودو کرم اے وہ جس کے عرش پر کسی کا قدم نہیں آیا اے سخیوں میں سے سب سے بڑے سخی اے بزرگی والوں سے زیادہ بزرگ اے سننے والوں میں سے زیادہ سننے والےاے دیکھنے والوں میں سے زیادہ دیکھنے والے اے پناہ گزینوں کی پناہ گاہ اے ڈرے ہوؤں کی جائے امن اے پناہ چاہنے والوں کی جائے پناہ اے مومنوں کے   سرپرست اے فریادیوں کے فریاد رس اے طلبگاروں کی امید اے ہر سفر کرنے والے کے ساتھی اے ہر اکیلے کے ہم نشیں اے ہر نکالے گئے کی جائے پناہ اے بے ٹھکانوں کی قرارگاہ اے گمشدہ کے نگہبان اے بڑے بوڑھے پر رحم   کرنے والے اے ننھے بچے کو روزی دینے والے اے ٹوٹی ہڈی کو جوڑنے والے اے ہر قیدی کو رہائی دینے والےاے بے چارے مفلس کو غنی بنانے والے اے خائف پناہ گزین کی جائے قرار اے تدبیر اور تقدیر کے مالک اے وہ جس کے لیے ہر مشکل کام آسان اور ہلکا ہےاے وہ جو تفسیر کا محتاج نہیں اے وہ جو ہر چیز پر قدرت رکھتا ہے اے وہ جو ہر چیز سے واقف ہے اے وہ جو ہر چیز کو دیکھتا ہے اے ہواؤں کو چلانے والے اے صبح کی پو کھولنے والے روحوں کو بھیجنے والے اے عطا و سخاوت والے اے وہ جس کے ہاتھ میں ساری کنجیاں ہیں اے ہر آواز کے سننے وا لے اے ہر گزرے ہوئے سے پہلےاے ہر نفس کو اس کی موت کے بعد زندہ کرنے والے اے سختیوں میں میری پناہ اے سفر میں میرے محافظ اے میری تنہائی کے ہمدم اے میری نعمتوں کے مالک اے میری پناہ جب مجھ پر راہیں بند ہوجائیں اور رشتہ دار مجھے دور کر دیں اور احباب مجھے چھوڑ جائیں اے اسکے سہارے جسکا  کوئی سہارا نہیں اے اسکی سند جسکی کوئی سند نہیں اے اسکے ذخیرے جسکا کوئی ذخیرہ نہیں اے اسکی پناہ جسکی کوئی پناہ نہیں اے اسکی اما ن جسکی کوئی امان نہیں اے اسکے خزانے جسکا کوئی خز انہ نہیں اے اسکے پشت پناہ جسکا کوئی پشت پناہ نہیں اے اسکے فریاد رس جسکا کوئی فریاد رس نہیں اے اسکے ہمسائے جسکا کوئی ہمسایہ نہیں جو نزدیک تر ہے اے میرا مضبوط ترین سہارہ اے میرے حقیقی معبود اے خانہ کعبہ کے پروردگار اے مہربان اے دوست مجھے تنگ گھیرے سے آزاد کر مجھ سے ہر غم و اندیشہ اورتنگی دور کر مجھے اس شر سے بچا جو میری طاقت سے زیادہ ہے اور اس میں مدد دے جو میں سہہ سکتا ہوں اے وہ جس نے یعقوب (ع)کو یوسف(ع) واپس دلایا اے ایو ب (ع)کا دکھ دور کرنے والے اے داؤد(ع) کی خطا معاف کرنے والے اے عیسی (ع)بن مریم کو آسمان پر اٹھانے والے۔اور انہیں یہودیوں کے چنگل سے چھڑانے والے اے تاریکیوں میں یونس(ع) کی فریاد کو پہنچنے والے اے موسیٰ(ع) کو اپنے کلام کیلئے منتخب کرنے والےاے آدم(ع)  کے ترک اولی کو معاف کرنے والے اور ادریس (ع)کو اپنی رحمت سے بلند مقام پر لے جانے والے اے نوح (ع) کو ڈوبنے سے بچانے والے اے وہ جس نے عاد اولی اور ثمود کوہلا ک کیا پس کسی کو باقی نہ چھوڑا اور ان سے پہلے قوم نوح (ع)کو ہلاک کیا جو بڑے ظالم سرکش اور دین میں افترا کرنے والے تھےاے وہ جس نے قوم لوط کی بستیوں کو الٹ دیا اور قوم شعیب پر عذاب بھیجا تھا اے وہ جس نے ابراہیم(ع) کو اپنا خلیل بنایا اے وہ جس نے موسی(ع) کو اپنا کلیم بنایا اور محمد   کو اپنا حبیب قرار دیا کہ خدا کی رحمت ہو ان پر انکی آل (ع) پر اور ان سب ہستیوں پر جنکا ذکر ہو ا ہے اے لقما ن (ع)کو حکمت عطاکرنے والےاور سلیما ن (ع)کو ایسی سلطنت د ینے و الے کہ جیسی سلطنت انکے بعد کسی کو نہیں ملی اے وہ جس نے جا بر بادشا ہوں کے خلاف ذوالقرنین  (ع)کی مدد فرمائی اے وہ جس نے خضر (ع)کو دا ئمی زندگی دی اور یوشع (ع)بن نون کی خاطر آفتاب کو پلٹایاجب کہ وہ غروب ہو چکا تھا اے وہ جس نے مادر موسی(ع) کے دل کو سکون دیااور مریم بنت عمران(ع) کو پاکدامنی سے سرفراز فرمایا اے وہ جس نےیحییٰ(ع) بن زکریا(ع)کو گناہ سے   محفوظ رکھا اور موسی (ع)سے غضب کو دور فرمایا اے وہ جس نے زکریا(ع) کو یحیی(ع) کی بشارت دی اے وہ جس نے اسما عیل(ع) کے ذبح ہونے کو ذبح عظیم میں بدلااے وہ جس نے ہا بیل(ع) کی قربانی قبول فرمائی اور قابیل پر لعنت مسلط کر دی اے حضرت محمد  کی خاطر کفار کے جتھو ں کو شکست دینے والے محمد و آل محمد پر رحمت نازل کر اپنے تمام رسولوں پراور اپنے مقرب فرشتوں پر اور فرمانبردار بندوں پر رحمت فرما اور میں سوال کرتا ہوں تجھ سےہر اس سوال سے جو تیرے ہر اس بندے نے کیا جس سے تو راضی و خوش ہےپھر تو نے اسکی دعا یقینا قبول فرمائی یااللہ   یااللہ یاالله یارحمن یارحمن یارحمن یارحیم یارحیم یارحیم اے جلالت و بزرگی والےاے جلالت وبزرگی والے اے جلالت و بزرگی والے اسی کا واسطہ اسی کا اسی کا اسی کا اسی کا اسی کا اسی کا  میں سوال کرتا ہوں تیرے ہر اس نام کے واسطہ سے جس سے تو نے اپنی ذات کو پکارا  یا اپنے صحیفوں میں سے کسی میں اتارا یا اسےعلم غیب میں اپنے لئے مقرر و خاص کیاان مقامات بلند کا واسطہ جو تیرے عرش میں ہیں اس انتہائی رحمت کا واسطہ جو تیری کتاب میں   ہے اور اس آیت کا واسطہ کہ اگر زمین کے تمام درخت قلم اور سمندر روشنائی بن جائیں اسکے بعد سات سمندر اور ہوں تو بھی خدا کے کلمات تمام نہیں ہوں گے بے شک اللہ غا لب ہے حکمت والااور میں سوال کرتا ہوں تیرے پیارے ناموں کیساتھ جنکی تو نے قرآن میں توصیف کی پس تو نے کہا اور اللہ کیلئے ہیں پیارے پیارے نام تو تم اسے انہی سے پکارواور تو نے کہا مجھے پکارو میں تمہاری دعا قبول کروں گا اور کہا کہ جب میرے بندے مجھے پکاریں تو میں ان کے قریب ہی ہوتا ہوں میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ دعا کرے اور تو نے کہا اے میرے وہ بندو جنہوں نے اپنے اوپر ظلم کیا ہے کہ تم اللہ کی رحمت سے ناامید نہ ہو جانا کہ بے شک اللہ تمام گناہ بخش دے گایقینا وہ بہت بخشنے والا مہربان ہے اور میں سوال کرتا ہوں تجھ سے   اے معبود تجھے پکارتا ہوں اے پروردگار اور تجھ سے امید رکھتا ہوں اے میرے آقامیں دعا کے قبول ہونے کی طمع رکھتا ہوں اے   میرے مولا جیسے تو نے وعدہ کیا اور میں نے تجھے پکارا جیسا کہ تو نے مجھے حکم دیاپس اےکریم تو بھی مجھ سے وہ سلوک کر جسکا تو اہل ہےاور تعریف بس خدا کیلئے ہے جو عالمین کا رب ہے اور محمد اوراسکی تمام آل محمد پر الله رحمت فرمائے۔  `,

reference:`<b>مفاتیح الجنان</b><br>مصنف: شیخ عباس قمی<br>باب: دعائے مشلول`
}

,
{
id:7,

title:"دعائے صباح",

english:"Dua-e-Sabah",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`
اللّهُمَّ يا مَنْ دَلَعَ لِسانَ الصَّباحِ بِنُطْقِ تَبلُّجِهِ وَسَرَّحَ قِطَعَ اللَّيْلِ المُظْلِمِ بِغَياهِبِ تَلَجْلُجِهِ وَأَتْقَنَ صُنعَ الفَلَكِ الدَّوّارِ في‌ مَقادِيرِ تَبَرُّجِهِ وَشَعْشَعَ ضِياءَ الشَّمْسِ بِنُورِ تَأَجُّجِهِ يا مَنْ دَلَّ عَلى ذاتِهِ بِذاتِهِ وَتَنَزَّهَ عَنْ مُجانَسَةِ مَخلُوقاتِهِ وَجَلَّ عَن‌ مُلائَمَةِ كَيْفيّاتِهِ يا مَنْ قَرُبَ مِنْ خَطَراتِ الظُّنُونِ وَبَعُدَ عَنْ لَحَظاتِ العُيُونِ وَعَلِمَ بِما كانَ قَبْلَ أَنْ يَكُونَ يا مَنْ أَرْقَدَني‌ في‌ مِهادِ أَمْنِهِ وَأَمانِهِ وَأَيْقَظَني‌ إِلى ما مَنَحَني‌ بِهِ مِن‌ مِنَنِهِ وَإِحسانِهِ وَكَفَّ أَكُفَّ السَّوءِ عَنِّي‌ بِيَدِهِ وَسُلْطانِهِ صَلِّ اللّهُمَّ عَلىَ الدَّلِيلِ إِلَيكَ في‌ اللَّيْلِ الأَلْيَلِ وَالِماسِكِ مِنْ أَسْبابِكَ بِحَبلِ الشَّرَفِ الأَطْوَلِ وَالنّاصِعِ الحَسَبِ في‌ ذِرْوَةِ الكاهِلِ الأَعْبَلِ وَالثّابِتِ القَدَمِ عَلى زَحالِيفِها في‌ الزَّمَنِ الأَوَّلِ وَعَلى آلِهِ الأَخْيارِ المُصْطَفِينَ الأَبرارِ وَ افْتَحِ اللّهُمَّ لَنا مَصارِيعَ الصَّباحِ بِمَفاتِيحِ الرَّحْمَةِ وَالفَلاحِ وَأَلْبِسْني‌ اللّهُمَّ مِنْ أَفْضَلِ خِلَعِ الهِدايةِ وَالصَّلاحِ وَأَغْرِسْ اللّهُمَّ بِعَظَمَتِكَ في‌ شِرْبِ جَناني‌ ينابِيعَ الخُشُوعِ وَأَجْرِ اللّهُمَّ لِهَيْبتِكَ مِنْ أَماقي‌ زَفَراتِ الدُّمُوعِ وَأَدِّبِ اللّهُمَّ نَزَقَ الخُرْقِ مِنِّي‌ بِأَزِمَّةِ القُنُوعِ إِلهي‌ إِنْ لَمْ تَبتَدِئْنِي‌ الرَّحْمَةُ مِنْكَ بِحُسْنِ التَّوْفِيقِ فَمَنِ السَّالِكُ بي‌ إِلَيكَ في‌ وَاضِحِ الطَّرِيقِ وَإِنْ أَسْلَمَتْني‌ أَناتُكَ لِقائِدِ الأَمَلِ وَالمُنى فَمَنِ المُقيلُ عَثَراتي‌ مِنْ كَبَواةِ الهَوى وَإِنْ خَذَلَني‌ نَصْرُكَ عِنْدَ مُحارَبَةِ النَّفْسِ وَالشَّيطانِ فَقَدْ وَكَلَني‌ خِذْلانُكَ إِلى حَيثُ النَّصَبِ وَالحِرْمانِ إِلهي‌ أَتَراني‌ ما أَتَيتُكَ إِلاّ مِنْ حَيْثُ الآمالِ أَمْ عَلِقْتُ بِأَطْرافِ حِبالِكَ إِلاّ حِينَ باعَدَتْني‌ ذُنُوبي‌ عَنْ دارِ الوِصالِ فَبِئْسَ المَطِيَّةُ الَّتي‌ امْتَطَتْ نَفْسي‌ مِنْ هَواها فَواهاً لَها لِما سَوَّلَتْ لَها ظُنُونُها وَمُناها وَتَبّاً لَها لِجُرْأَتِها عَلى سَيدِها وَمَوْلاها إِلهي‌ قَرَعْتُ بابَ رَحْمَتِكَ بِيدِ رَجائي‌ وَهَرَبتُ إِلَيكَ لاجِئاً مِنْ فَرْطِ أَهْوائي‌ وَعَلَّقْتُ بِأَطْرافِ حِبالِكَ أَنامِلَ وَلائي‌ فَاصْفَحِ اللّهُمَّ عَمّا كانَ أَجْرَمْتُهُ مِنْ زَلَلي‌ وَخَطائي‌ وَأَقِلْني‌ اللّهُمَّ مِنْ صَرْعَةِ رَدائي‌ وَعُسْرَةِ بلائي‌ فَإِنَّكَ سَيّدي‌ وَمَوْلاي‌َ وَمُعْتَمَدِي‌ وَرَجائي‌ وَغايةُ مُناي‌َ في‌ مُنْقَلَبي‌ وَمَثْواي‌َ إِلهي‌ كَيْفَ تَطْرُدُ مِسْكيناً الْتَجَأَ إِلَيْكَ مِنَ الذُّنُوبِ هارِباً أَمْ كَيْفَ تُخَيبُ مُسْتَرْشِداً قَصَدَ إِلى جَنابِكَ ساعِياً أَمْ كَيفَ تَرُدُّ ظَّمْاناً وَرَدَ إِلى حَياضِكَ شارِباً كَلاّ وَحَياضُكَ مُتْرَعَةٌ في‌ ضَنْكِ الُمحُولِ وَبابكَ مَفْتُوحٌ للطَّلَبِ وَالوُغُولِ وَأَنْتَ غايَةُ المَسْؤُولِ وَنِهايَةُ المَأْمُولِ إِلهي‌ هذِهِ أَزِمَّةُ نَفْسي‌ عَقَلْتُها بِعِقالِ مَشِيتِكَ وَهذِهِ أَعْباءُ ذُنُوبي‌ دَرَأْتُها بِرَحْمَتِكَ وَهذِهِ أَهْوائي‌َ المُضِلَّةُ وَكَلْتُها إِلى جَنابِ لُطْفِكَ وَرَأْفَتِكَ فَاجْعَلْ اللّهُمَّ صَباحي‌ هذا نازِلاً عَلَي‌َّ بِضِياءِ الهُدى وَالسلامَةِ في‌ الدِّينِ وَالدُّنْيا وَمَسائي‌ جُنَّةً مِنْ كَيدِ الْعِدى وَوِقايةً مِنْ مُرْدياتِ الهَوى إِنَّكَ قادِرٌ عَلى ما تَشاءُ تُؤْتي‌ المُلْكَ مَنْ تَشاءُ وَتَنْزِعُ المُلْكَ مِمَّنْ تَشاءُ وَتُعِزُّ مَنْ تَشاءُ وَتُذِلُّ مَنْ تَشاءُ بِيدِكَ الخَيْرُ إِنَّكَ عَلى كُلِّ شَي‌ْءٍ قَدِيرٌ تُولِجُ اللَّيلَ في‌ النَّهارِ وَتُولِجُ النَّهارَ في‌ اللَّيلِ وَتُخْرِجُ الحَي‌َّ مِنَ المَيتِ وَتُخْرِجُ المَيتَ مِنَ الحَي‌ِّ وَتَرْزِقُ مَنْ تَشاءُ بِغَيْرِ حِسابٍ لا إِله‌ إِلاّ أَنْتَ سُبْحانَكَ اللّهُمَّ وَبِحَمْدِكَ مَنْ ذَا يَعْلَمُ قَدْرَتَكَ فَلا يَخافُكَ وَمَنْ ذا يَعْلَمُ ما أَنْتَ فَلا يَهابُكَ أَلَّفْتَ بِقُدْرَتِكَ الفِرَقِ وَفَلَقْتَ بِلُطْفِكَ الفَلَقَ وَأَنَرْتَ بِكَرَمِكَ دَياجِي‌َ الغَسَقَ وَأَنْهَرْتَ المِياهَ مِنَ الصُّمِّ الصَّياخِيدِ عَذْباً وَأُجاجاً وَأَنْزَلْتَ مِنَ المُعْصِراتِ ماءً ثَجّاجاً وَجَعَلْتَ الشَّمْسَ وَالقَمَرَ لِلبَريةِ سَراجاً وَهّاجاً مِنْ غَيْرِ أَنْ تُمارِسَ فيما ابْتَدَأْتَ بِهِ لُغُوباً وَلا عِلاجاً فَيا مَنْ تَوَحَّدَ بِالعِزِّ وَالبقاءِ وَقَهَرَ عِبادَهُ بِالمَوْتِ وَالفَناءِ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ الأَتْقِياءِ وَاسْتَمِعْ نِدائِي‌ وَاسْتَجِبْ دُعائي‌ وَحَقِّقْ بَفَضْلِكَ أَمَلي‌ وَرَجائي‌ يا خَيْرَ مَنْ دُعِي‌َ لِكَشْفِ الضُرِّ وَالمَأْمُولِ لِكُلِّ عُسْرٍ وَيُسْرٍ بِكَ أَنْزَلْتُ حاجَتي‌ فَلا تَرُدَّني‌ يا سَيدي‌ مِنْ سَنِي‌ِّ مَواهِبِكَ خائِباً يا كَرِيمُ يا كَرِيمُ آمِينَ بِرَحْمَتِكَ يا أَرحَمَ الرّاحِمينَ وَصَلَّىَ اللهُ عَلى سَيِّدِنا مُحَمَّدٍ وَآلِهِ الطّاهِرِينَ يا كَرِيمُ (ثم‌ تسجد وتقول:) إِلهي‌ قَلْبي‌ مَحْجُوبٌ وَعَقْلي‌ مَغْلُوبٌ وَنَفْسي‌ مَعْيُوبٌ وَهَوائي‌ غالِبٌ وَطاعَتي‌ قَلِيلَةٌ وَمَعْصيتي‌ كَثِيرَةٌ وَلِساني‌ مُقِرٌّ بِالذُّنُوبِ وَمُعْتَرِفٌ بِالعُيُوبِ فَما حيلَتي‌ يا عَلاّمَ الغُيُوبِ وَيا سَتّارِ العُيوبِ وَيا غَفّارِ الذُنُوبِ اغْفِرْ لي‌ ذُنُوبي‌ كُلَّها يا غَفّارُ وَاسْتُرْ عَلَي‌َّ يا سَتّارِ بِمُحَمَّدٍ وَآلِهِ الأَطهارُ بِرَحْمَتِكَ يا أَرحَمَ الرّاحِمينَ                `,

translation:` 
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
یہ حضرت امیر المو منین - کی د عا ہے :مؤلّف کہتے ہیںکہ علامہ مجلسی نے یہ دعا اپنی کتاب بحار الانوار کی کتاب الدعائ اور کتاب الصلوۃ میں درج کی ہے۔ نیز فرمایا ہے کہ یہ مشہور دعائوں میں سے ہے ۔ لیکن میں نے اسے دیگر معتبر کتب میں نہیں پایا۔ البتہ سید بن باقی کی کتابِ مصباح میں یہ دعا موجود ہے۔اور اسی طرح علامہ مجلسی نے فرمایا ہے کہ اس دعا کا فریضہ ِصبح کے بعد پڑھا جانا مشہور ہے ۔ تا ہم سید بن باقیرحمه‌الله نے روایت کی ہے کہ اسے نافلہ صبح کے بعد پڑھا جائے۔ بہرحال ان دونوں میں سے جو صورت بھی اختیار کی جائے مناسب ہے:
*****
اے میرے معبود! جس نے صبح کی زبان کو روشنی کی گویائی دی اور اندھیری رات کے ٹکڑوں کو لرزتی تاریکیوں سمیت ہنکا دیا اور گھومتے آسمان کی ساخت کو اسکے برجوں سے محکم کیا اور سورج کی روشنی کو اسکے نور فروزاں سے چمکایا۔ اے وہ جس نے اپنی ذات کو دلیل بنایا جو اپنی مخلوقات کا ہم جنس ہونے سے پاک اور اسکی کیفیتوں کی آمیزش سے بلند ہے اے وہ جو ظنی خیالوں سے قریب ہے اور آنکھوں کی دید سے دور ہے اور ہونے والی چیزوں کوہونے سے پہلے جان چکا ہے اے وہ جس نے مجھے اپنے امن و سلامتی کے گہوارے میں سلایا اور اپنی بخشش اور احسان کو پانے کیلئے مجھے بیدار کیا اپنی قدرت و اقتدار سے برائی کو مجھ پر ہاتھ ڈالنے سے روکا۔ اے معبود  اس پر رحمت فرما جو تاریک رات میں تیری طرف رہنمائی کرنے والا، تیرے سہاروں میں سے شرف کی پا ئیدار رسی کو پکڑ ے والا،  اعلیٰ خاندان میں سے چمکتی پیشانی والا، استوار روش والا،آغاز ہی سے لغزشوں کے مواقع پر ثابت قدم رہنے والا ہے اور اس نبی کی نیکوکار برگزیدہ خوش کردار آل(ع) پر رحمت فرما۔ اے معبود! اپنی رحمت و بخشش کی کنجیوں سے ہمارے لئے صبح کے دروازے کھول دے ۔اے معبود مجھے نیکی وہدایت کی بہترین خلعت پہنادے خداوند! اپنی عظمت کے باعث میرے دل کی زمین میں خشوع و انکساری کے درخت لگا دے اے معبود! اپنی ہیبت کیلئے  میری آنکھوں سے آنسوئوں کے تار جاری کردے۔ خدایا میری کج خلقی کو قناعت کی لگام ڈال دے۔ میرے اللہ اگر  تو نے اپنی نیکی کی توفیق نہ دی تو کون مجھے تیری طرف کشادہ راہ پر لے چلے گا اورتیری دی ہوئی ڈھیل سے میں خواہش کے پیچھے چل پڑا تو کون مجھے ہوس کی ٹھوکروں سے بچائے گا  اور اگر میرے نفس اور شیطا ن کی جنگ میں تیری نصرت میرے شامل حال نہ ہوتی تو گویا تیری دوری نے مجھے  رنج و غم کے حوالے کر دیا ہوتا میرے مالک کیا تیری نظر سے تیرے پاس اپنی خواہشوں کیلئے آیا ہوں یا میں نے  تجھ سے اس وقت تعلق قائم کیا کہ جب میرے گناہوں نے مجھے تیرے وصال سے دور کردیا پس میرے دل نے خواہشوں کو اپنی بری سواری بنایا پس اس پر اور اسکی خیالی تمنائوں پر نفرین ہے اور تباہی ہو اسکی جو  اس نے اپنے آقا پر یہ جرات کی ہے۔ الہی میں نے اپنی امید کے ہاتھوں تیرے باب ِرحمت پر دستک دی ہے اور اپنی حد سے زیادہ  تمنائوں سے ڈر کے تیرے پاس بھاگ آیا ہوں اور محبت کی انگلیوں سے تیرے دامان ِرحمت کو تھام لیا ہے۔ اے معبود! مجھ سے جو  لغزشیں اور خطائیں ہوئی ہیں ان سے چشم پوشی فرما اور میری چادر کی پایچی﴿وادی ہلاکت﴾ سے صرف نظر فرما کیونکہ تو میرا آقا و  مالک اور میرا سہارا اور امید ہے اور تو ہی اس دنیا اور آخرت میں میرا اصلی مطلوب و مقصود ہے ۔میرے معبود! تو اس بے چارے  کو کیسے نکال دے گا جوتیرے پاس گناہوں سے بھاگ کر آیا ہے یا اس طالب ہدایت کو کیسے مایوس کرے گا جو تیرے حضور دوڑتا ہوا  آیا ہے یا اس پیاسے کو کیسے دور کرے گا جو تیرے کرم کے حوض سے پیاس بجھانے آیا ہے ہرگز نہیں !کہ تیرے فیض کے چشمے خشک سالی میں بھی رواں ہیں اور تیرا بابِ کرم داخلے اور سوال کیلئے کھلا ہے تو سوال کی انتہا اور امید کی آخری  حد ہے میرے معبود! یہ میرے نفس کی باگیں ہیں جنکو میں نے تیری مشیت کی رسی سے باندھ دیا ہے اور یہ ہیں میرے گناہوں کی گٹٹھریاں جو میں نے تیری بخشش و رحمت کے آگے لا رکھی ہیں اور یہ ہیں میری گمراہ کن خواہشیں جو میں نے تیرے لطف و کرم کے سپرد کر دی ہیں پس اے پروردگار! اس صبح کو میرے لیے نور ہدایت اور دین و دنیا کی سلامتی کی حامل بنا کر نازل فرما اور اس رات کو دشمنوں کی مکاری سے میری ڈھال اور ہلاک کرنے والی ہوس کی سپر بنادے بے شک تو جو چاہے اس پر قادر ہے جسے چاہے ملک دیتا ہے اور جس سے چاہے واپس لے لیتا ہے اور جسے چاہے عزت دیتا اور جسے چاہے ذلت دیتا ہے ہر بھلائی  تیرے ہاتھ میں ہے بے شک تو ہر چیز پر قادر ہے رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے مردہ سے زندہ اور زندہ سے مردہ کو برآمد کرتا ہے اور جسے چاہے بے حساب رزق عطا  فرماتا ہے تیرے سوا کوئی معبود نہیں پاک ہے تو اے اللہ اور حمد تیرے ہی لیے ہے کون ہے جو تیری قدر و عظمت کو پہچانے تو اس سے  نہ ڈرے کون ہے جو جانتا ہو تو کون ہے پھر تجھ سے مرعوب نہ ہو تو نے اپنی قدرت سے منتشرکو متحد کیا اور اپنے لطف سے سپیدہ صبح کو نمایاں کیا اور تو نے ہی اپنے کرم سے تاریک راتوں کو روشن کیا اور تو نے سخت پتھروں میں سے میٹھے اور کھاری پانی کے چشمے جاری  کیے اور بادلوں سے نتھرا ہوا میٹھا پانی برسایا اور تو نے سورج اور چاند کو مخلوق کیلئے روشن چراغ قرار دیا بغیر اس کے کہ پیدا کرنے میں تجھے کوئی تھکاوٹ و خستگی عارض ہوئی یا تو محتاج ہوا ہو پس اے عزت اور بقا میں یگانہ اور موت دفنا کے ذریعے بندوں پر غالب رہنے والے! محمد(ص) و آل محمد(ص) پر رحمت فرما جو پرہیزگار ہیں اور میری پکار سن لے میری دعا  قبول فرما اور اپنے کرم سے میری تمناو امید پوری کر دے اے وہ بہترین ذات جسے تکلیف دور کرنے کیلئے پکارا جاتا ہے اور اے تنگی و فراخی کی امید گاہ، میں تیرے حضور حاجت لے کر آیا ہوں پس مجھے اپنی وسیع عطائوں سے محرومی کے ساتھ دور نہ کر یاکریم  یاکریم یاکریم اپنی رحمت کے ساتھ اے سب سے زیادہ رحمت کرنے والے اور اس کی بہترین مخلوق حضرت محمد(ص) اور ان کی سبھی آل(ع) پر  خدا کی رحمت ہو۔

پھر سجدے میں جائیں اور یہ پڑہیں

 خدایا !میرے دل پر حجاب ہے میرے نفس میں عیب ہے میری عقل ناکارہ ہے میری خواہش غالب میری عبادت کم اور گناہ بہت زیادہ ہیں میری زبان گناہوں کا اقرار کرتی ہے تو میرا چارہ کار کیا ہے؟ اے عیبوں کو چھپانے والے اے چھپی باتوں کو جاننے والے اے دکھوں کو دور کرنے والے میرے تمام گناہ بخش دے محمد(ص)(ص) و آل (ع) محمد (ص) کی حرمت کے واسطے سے یاغفار یاغفار یاغفار اپنی رحمت کے ساتھ اے سب سے زیادہ رحم کرنے والے۔ `,

reference:`<b>کتاب:</b> مصباح المتهجد<br><b>مصنف:</b> شیخ الطوسی<br><b>اصل ماخذ:</b> دعائے صباح`
}





,
{
id:8,

title:"دعائے افتتاح",

english:"Dua-e-Iftitah",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اللّهُمَّ إِنِّي‌ أَفْتَتِحُ الثَّناءَ بِحَمْدِكَ وَأَنْتَ مُسَدِّدٌ لِلصَّوابِ بِمَنِّكَ وَأَيقَنْتُ أَنَّكَ أَنْتَ أَرْحَمُ الرّاحِمِينَ في‌ مَوْضِعِ العَفْوِ وَالرَّحْمَةِ وَأَشَدُّ المُعاقِبِينَ في‌ مَوْضِعِ النَّكالِ وَالنَّقِمَةِ وَأَعْظَمُ المُتَجَبِّرِينَ في‌ مَوْضِعِ الكِبْرِياءِ وَالعَظَمَةِ اللّهُمَّ أَذِنْتَ لي‌ في‌ دُعائِكَ وَمَسْئَلَتِكَ فاسْمَعْ يا سَمِيعُ مِدْحَتي‌ وَأَجِبْ يا رَحِيمُ دَعْوَتي‌ وَأَقِلْ يا غَفُورُ عَثْرَتي‌ فَكَمْ يا إِلهي‌ مِنْ كُرْبَةٍ قَدْ فَرَّجْتَها وَهُمُومٍ قَدْ كَشَفْتَها وَعَثْرَةٍ قَدْ أَقَلْتَها وَرَحْمَةٍ قَدْ نَشَرْتَها وَحَلْقَةِ بَلاءٍ قَدْ فَكَكْتَها الحَمْدُ للهِ الَّذِي‌ لَمْ يَتَّخِذْ صاحِبَةً وَلا وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيكٌ في‌ المُلْكِ وَلَمْ يكُنْ لَهُ وَلي‌ٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً الحَمْدُ للهِ بِجَمِيعِ مَحامِدِهِ كُلِّها عَلى جَمِيعِ نِعَمِهِ كُلِّها الحَمْدُ للهِ الَّذِي‌ لا مُضادَّ لَهُ في‌ مُلْكِهِ وَلا مُنازِعَ لَهُ في‌ أَمْرِهِ الحَمْدُ للهِ الَّذِي‌ لا شَرِيكَ لَهُ في‌ خَلْقِهِ وَلا شَبِيهَ لَهُ في‌ عَظَمَتِهِ الحَمْدُ للهِ الفاشِي‌ في‌ الخَلْقِ أَمْرُهُ وَحَمْدُهُ الظّاهِرِ بِالكَرَمِ مَجْدُهُ الباسِطِ بِالجُودِ يدَهُ الَّذِي‌ لا تَنْقُصُ خَزائِنُهُ وَلا تَزِيدُهُ كَثْرَةُ العَطاءِ إِلاّ جُوداً وَكَرَماً إِنَّهُ هُوَ العَزِيزُ الوَهّابُ اللّهُمَّ إِنّي‌ أَسْأَلُكَ قَلِيلاً مِنْ كَثِيرٍ مَعَ حاجَةٍ بي‌ إِلَيْهِ عَظِيمَةٌ وَغِناكَ عَنْهُ قَدِيمٌ وَهُوَ عِنْدِي‌ كَثِيرٌ وَهُوَ عَلَيْكَ سَهْلٌ يَسِيرٌ اللّهُمَّ إِنَّ عَفْوَكَ عَنْ ذَنْبي‌ وَتَجاوُزَكَ عَنْ خَطِيئَتي‌ وَصَفْحَكَ عَنْ ظُلْمي‌ وَسِتْرَكَ عَنْ قَبِيحِ عَمَلي‌ وَحِلْمَكَ عَنْ كَثِيرِ جُرْمي‌ عِنْدَما كانَ مِنْ خَطَأي‌ وَعَمْدِي‌ أَطْمَعَني‌ في‌ أَنْ أَسْأَلُكَ مالا أَسْتَوجِبُهُ مِنْكَ الَّذِي‌ رَزَقْتَني‌ مِن‌ رَحْمَتِكَ وَأَرَيتَني‌ مِن‌ قُدْرَتِكَ وَعَرَّفْتَني‌ مِن‌ إِجابتِكَ فَصِرتُ أَدعُوكَ آمِناً وَأَسْأَلُكَ مُسْتَأنِسْاً لا خائِفاً وَلا وَجِلاً مُدِلاًّ عَلَيْكَ فِيما قَصَدْتُ فِيهِ إِلَيْكَ فَإِنْ أَبطَأَ عَنِّي‌ عَتَبتُ بِجَهْلي‌ عَلَيكَ وَلَعَلَّ الَّذِي‌ أَبطَأَ عَنِّي‌ هُوَ خَيْرٌ لي‌ لِعِلْمِكَ بِعاقِبةِ الأُمُورِ فَلَمْ أَرَ مَوْليً كَرِيماً أَصْبَرَ عَلى عَبْدٍ لَئِيمٍ مِنْكَ عَلَي‌َّ يا رَبِّ إِنَّكَ تَدْعُوني‌ فَأُوَلِّي‌ عَنْكَ وَتَتَحَبَّبُ إِلَي‌َّ فَأَتَبغَّضُ إِلَيْكَ وَتَتَوَدَّدُ إِلَي‌َّ فَلا أَقْبَلُ مِنْكَ كَأَنَّ لِيَ التَّطَوُّلُ عَلَيكَ فَلَم‌ يَمْنَعْكَ ذلِكَ مِنَ الرَّحْمَةِ لي‌ والإِحْسانِ إِلَي‌َّ وَالتَّفَضُّلِ عَلَي‌َّ بِجُودِكَ وَكَرَمِكَ فَارْحَمْ عَبْدَكَ الجاهِلْ وَجُدْ عَلَيْهِ بِفَضْلِ إِحْسانِكَ إِنَّكَ جَوادٌ كَرِيمٌ الحَمْدُ للهِ مالِكِ المُلْكِ مُجْرِي‌ الفُلْكِ مُسَخِّرِ الرِّياحِ فالِقِ الإِصْباحِ دَيَّانِ الدِّينِ رَبِّ العالَمِينَ الحَمْدُ للهِ عَلى حِلمِهِ بعْدَ عِلْمِهِ وَالحَمْدُ للهِ عَلى عَفْوِهِ بعْدَ قُدْرَتِهِ وَالحَمْدُ للهِ عَلى طُولِ أَناتِهِ في‌ غَضَبِهِ وَهُوَ قادِرٌ عَلى ما يُرِيدُ الحَمْدُ للهِ خالِقِ الخَلْقِ باسِطِ الرِّزْقِ فالِقِ الإِصْباحِ ذِي‌ الجَلالِ وَالإِكْرامِ وَالفَضْلِ وَالأَنْعامِ الَّذِي‌ بَعُدَ فَلا يُرى وَقَرُبَ فَشَهِدَ النَّجْوى تَبارَكَ وَتَعالى الحَمْدُ للهِ الَّذِي‌ لَيسَ لَهُ مُنازِعٌ يُعادِلُهُ وَلا شَبِيهٌ يُشاكِلُهُ وَلا ظَهِيرٌ يعاضِدُهُ قَهَرَ بِعِزَّتِهِ الأَعِزَّاءَ وَتَواضَعَ لِعَظَمَتِهِ العُظَماءَ فَبلَغَ بِقُدْرَتِهِ ما يَشاءُ الحَمْدُ للهِ الَّذِي‌ يُجِيبني‌ حِينَ أُنادِيهِ وَيسْتُرُ عَلَي‌َّ كُلَّ عَوْرَةٍ وَأَنا أَعْصِيهِ وَيعَظِّمُ النِّعْمَةَ عَلَي‌َّ فَلا أُجازِيهِ فَكَمْ مِنْ مَوْهِبةٍ هَنِيئَةٍ قَدْ أَعْطاني‌ وَعَظِيمَةٍ مَخُوفَةٍ قَدْ كَفاني‌ وَبهْجَةٍ مُونِقَةٍ قَدْ أَراني‌ فَأُثْني‌ عَلَيْهِ حامِداً وَأَذْكُرُهُ مُسَبِّحاً الحَمْدُ للهِ الَّذِي‌ لا يهْتَكُ حِجابُهُ وَلا يغْلَقُ بابُهُ وَلا يرَدُّ سائِلُهُ وَلا يُخَيبُ آمِلُهُ الحَمْدُ للهِ الَّذِي‌ يؤْمِنُ الخائِفِينَ وَينَجِّي‌ الصّالِحِينَ وَيَرفَعُ المُسْتَضْعَفِينَ وَيضَعُ المُسْتَكْبِرِينَ وَيُهْلِكُ مُلُوكاً وَيسْتَخْلِفُ آخَرِينَ وَالحَمْدُ للهِ قاصِمِ الجَبَّارِينَ مُبِيرِ الظّالِمِينَ مُدْرِكِ الهارِبِينَ نَكالِ الظّالِمِينَ صَرِيخِ المُسْتَصْرِخِينَ مَوْضِعِ حاجاتِ الطّالِبِينَ مُعْتَمَدِ المُؤْمِنِينَ الحَمْدُ للهِ الَّذِي‌ مِنْ خَشْيَتِهِ تَرْعَدُ السَّماءُ وَسُكّانُها وَتَرْجُفُ الأَرْضُ وَعُمّارُها وَتَمُوجُ البِحارُ وَمَنْ يَسْبَحُ في‌ غَمَراتِها الحَمْدُ للهِ الَّذِي‌ هَدانا لِهذا وَما كُنّا لِنَهْتَدِيَ لَوْلا أَنْ هَدانا اللهُ الحَمْدُ للهِ الَّذِي‌ يَخْلُقُ وَلَم‌ يُخْلَقْ وَيَرْزُقُ وَلا يُرْزَقُ وَيُطْعِمُ وَلا يُطْعَمُ وَيُمِيتُ الأَحْياءَ وَيُحْيي‌ المَوْتى وَهُوَ حَي‌ٌّ لا يَمُوتُ بِيَدِهِ الخَيْرُ وَهُوَ عَلى كُلِّ شَيْءٍ قَدِيرٌ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَأَمِينِكَ وَصَفِيكَ وَحَبِيبِكَ وَخِيَرَتِكَ مِن‌ خَلْقِكَ وَحافِظِ سِرِّكَ وَمُبَلِّغِ رِسالاتِكَ أَفْضَلَ وَأَحْسَنَ وَأَجْمَلَ وَأَكْمَلَ وَأَزْكى وَأَنْمى وَأَطْيبَ وَأَطْهَرَ وَأَسْنَى وَأَكْثَرَ ما صَلَّيْتَ وَبارَكْتَ وَتَرَحَّمْتَ وَتَحَنَّنْتَ وَسَلَّمْتَ عَلى أَحَدٍ مِنْ عِبادِكَ وَأَنْبِيائِكَ وَرُسُلِكَ وَصِفْوَتِكَ وَأَهْلِ الكَرامَةِ عَلَيكَ مِنْ خَلْقِكَ اللّهُمَّ وَصَلِّ عَلى عَلي‌ٍّ أَمِيرِ المُؤْمِنِينَ وَوَصي‌ِّ رَسُولِ رَبِّ العالَمِينَ عَبدِكَ وَوَلِيكَ وَأَخي‌ رَسُولِكَ وَحُجَّتِكَ عَلى خَلْقِكَ وَآيَتِكَ الكُبْرى وَالنَّبأِ العَظِيمِ وَصَلِّ عَلَى الصِّدِّيقَةِ الطّاهِرَةِ فاطِمَةَ سَيِّدَةِ نِساءِ العالَمِينَ وَصَلِّ عَلى سِبْطَي‌ْ الرَّحْمَةِ وَإِمامَي‌ الهُدى الحَسَنِ وَالحُسَيْنِ سَيدَي‌ْ شَبابِ أَهْلِ الجَنَّةِ وَصَلِّ عَلى أَئِمَّةِ المُسْلِمِينَ عَلي‌ِّ بنِ الحُسَيْنِ وَمُحَمَّدِ بنِ عَلي‌ٍّ وَجَعْفَرِ بنِ مُحَمَّدٍ وَمُوسى بنِ جَعْفَرٍ وَعَلي‌ِّ بْنِ مُوسى وَمُحَمَّدِ بْنِ عَلي‌ٍّ وَعَلي‌ِّ بْنِ مُحَمَّدٍ وَالحَسَنِ بْنِ عَلي‌ٍّ وَالخَلَفِ الهادِي‌ المَهْدِي‌ِّ حُجَجِكَ عَلى عِبادِكَ وَأُمَنائِكَ في‌ بِلادِكَ صَلاةً كَثِيرَةً دائِمَةً اللّهُمَّ وَصَلِّ عَلَى وَلي‌ِّ أَمْرِكَ القائِمِ المُؤَمَّلِ وَالعَدْلِ المُنْتَظَرِ وَحُفَّهُ بِمَلائِكَتِكَ المُقَرَّبِينَ وَأَيدْهُ بِرُوحِ القُدُسِ يا رَبَّ العالَمِينَ اللّهُمَّ اجْعَلْهُ الدّاعِيَ إِلى كِتابِكَ وَالقائِمَ بِدِينَكَ اسْتَخْلِفْهُ في‌ الأَرْضِ كَمَا اسْتَخْلَفْتَ الَّذِينَ مِنْ قَبْلِهِ مَكِّنْ لَهُ دِينَهُ الَّذِي‌ ارْتَضَيْتَهُ لَهُ أَبْدِلْهُ مِن‌ بَعْدِ خَوْفِهِ أَمْناً يَعْبُدُكَ لا يُشْرِكَ بِكَ شَيْئاً اللّهُمَّ أَعِزَّهُ وَأَعْزِزْ بِهِ وَانْصُرْهُ وَانْتَصِرْ بِهِ وَانْصُرْهُ نَصْراً عَزِيزاً وَافْتَحْ لَهُ فَتْحاً يسِيراً وَاجْعَلْ لَهُ مِنْ لَدُنْكَ سُلْطاناً نَصِيراً اللّهُمَّ أَظْهِر بِهِ دِينَكَ وَسُنَّةَ نَبِيكَ حَتّى لا يسْتَخْفَِى بِشَيْءٍ مِنَ الحَقِّ مَخافَةَ أَحَدٍ مِنَ الخَلْقِ اللّهُمَّ إِنّا نَرْغَبُ إِلَيكَ في‌ دَوْلَةٍ كَرِيمَةٍ تُعِزُّ بِها الإِسْلامَ وَأَهْلَهُ وَتُذِلُّ بِها النِّفاقَ وَأَهْلَهُ وَتَجْعَلَنا فِيها مِنَ الدُّعاةِ إِلى طاعَتِكَ وَالقادَةِ إِلى سَبِيلِكَ وَتَرْزُقُنا بِها كَرامَةَ الدُّنْيا وَالآخِرَةِ اللّهُمَّ ما عَرَّفْتَنا مِنَ الحَقِّ فَحَمِّلْنَاهُ وَما قَصُرْنا عَنْهُ فَبَلِّغْناهُ اللّهُمَّ المُمْ بِهِ شَعَثَنا وَأَشْعَبْ بِهِ صَدْعَنا وَارْتُقْ بِهِ فَتْقَنا وَكَثِّرْ بِهِ قِلَّتَنا وَأَعْزِزْ بِهِ ذِلَّتَنا وَأَغْنِ بِهِ عائِلَنا وَاقْضِ بِهِ عَنْ مَغْرَمِنا وَاجْبُرْ بِهِ فَقْرَنا وَسُدَّ بِهِ خَلَّتَنا وَيَسِّرْ بِهِ عُسْرَنا وَبَيِّضْ بِهِ وُجُوهَنا وَفُكَّ بِهِ أَسْرَنا وَأَنْجِحْ بِهِ طَلِبَتَنا وَأَنْجِزْ بِهِ مَواعِيدَنا وَاسْتَجِبْ بِهِ دَعْوَتَنا وَأَعْطِنا بِهِ سُؤْلَنا وَبَلِّغْنا بِهِ مِنَ الدُّنْيا وَالآخِرَةِ آمَالَنا وَأَعْطِنا بِهِ فَوْقَ رَغْبَتِنا يا خَيْرَ المَسْئُولِينَ وَأَوْسَعَ المُعْطِينَ اشْفِ بِهِ صُدُورَنا وَأَذْهِبْ بِهِ غَيْظَ قُلُوبِنا وَاهْدِنا بِهِ لِما اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي‌ مَنْ تَشاءُ إِلى صِراطٍ مُسْتَقِيمٍ وَانْصُرنا بِهِ عَلى عَدُوِّكَ وَعَدُوِّنا إِلهَ الحَقِّ آمِينَ اللّهُمَّ إِنّا نَشْكُو إِلَيْكَ فَقْدَ نَبِيِّنا صَلَواتُكَ عَلَيْهِ وَآلِهِ وَغَيبةَ وَلِينا وَكَثْرَةَ عَدُوِّنا وَقِلَّةَ عَدَدِنا وَشِدَّةَ الفِتَنِ بِنا وَتَظاهُرَ الزَّمانِ عَلَيْنا فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَأَعِنَّا عَلى ذلِكَ بِفَتْحٍ مِنْكَ تُعَجِّلُهُ وَبِضُرٍّ تَكْشِفُهُ وَنَصْرٍ تُعِزُّهُ وَسُلْطانِ حَقٍّ تُظْهِرُهُ وَرَحْمَةٍ مِنْكَ تُجَلِّلُناها وَعافِيَةٍ مِنْكَ تُلْبِسُناها بِرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ  `,

translation:`
شُروع اَللہ کے پاک نام سے جو بڑا مہر بان نہايت رحم والا ہے
معبود تیری حمد سے تیری تعریف کا آغاز کرتا ہوں اور تو اپنے احسان سے راہ راست دکھانے والا ہے اور مجھے یقین ہے کہ تو معافی دینے مہربانی کرنےکے مقام پر سب سے بڑھ کر رحم و کرم کرنے والا ہےاور  عذاب کے موقع پر سب سے سخت عذاب دینے والا ہے اور بڑائی اور بزرگی کے مقام پر تو تمام قاہروں اور جابروں سے بڑھا ہوا ہے اے اللہ تو نے مجھے اجازت دے رکھی ہے کہ تجھ سے دعا کروںپس اے سننے والے اپنی یہ تعریف سن اور اے مہربان میری دعا قبول فرما اے بخشنے والے میری خطا معاف کر پس اے میرے معبود کتنی ہی مصیبتوں کو تو نے دور کیااور کتنے ہی اندیشوں کو ہٹایا اور خطاؤں سے درگذر کی رحمت کو عام کیا اور بلاؤں کے گھیرے کو توڑا اور رہائی دی حمد اس اللہ کے لیے ہے جس نے نہ کسی کو اپنی زوجہ بنایا اور نہ کسی کو اپنا بیٹا بنایانہ ہی اس کا کوئی ساجھی ہے سلطنت میں اور نہ وہ عاجز ہے کہ کوئی اس کا سرپرست ہو اس کی بڑائی کرو بہت بڑائی حمد اللہ ہی کے لیے ہے اس کی تمام خوبیوں اور اس کی ساری نعمتوں کے ساتھحمد اس اللہ کے لیے ہے جس کی حکومت میں نہ کوئی اس کا مخالف ہے نہ اسکے حکم میں رکاوٹ ڈالنے والا ہے حمد اس اللہ کے لیے ہےخلقت میں کوئی اسکا ساجھی نہیں اور اس کی بڑائی میں کوئی اس جیسا نہیںحمد اس اللہ کے لیے ہے جس کا حکم اور حمد اور خلق میں آشکار ہے اس کی شان اس کی بخشش کے ساتھ ظاہر ہے بن مانگے دینے میں اس کا ہاتھ کھلا ہے وہی ہے جس کے خزانے کم نہیں ہوتے اور کثرت کے ساتھ عطا کرنے سے اس کی بخشش و سخاوت میں اضافہ ہوتا ہے کیونکہ وہ زبردست عطا کرنے والا ہے اے معبود میں سوال کرتا ہوں تجھ سے بہت میں سے تھوڑے کا  جبکہ مجھے اس کی بہت زیادہ حاجت ہے اور تو ہمیشہ اس سے بے نیاز ہے وہ نعمت میرے لیے بہت بڑی ہے اور تیرے لیے اس کا دینا آسان ہے اے معبود بے شک تیرا میرے گناہ کو معاف کرنا میری خطا سے  تیری درگذر میرے ستم سے تیری چشم پوشی میرے برے عمل کی پردہ پوشی میرے بہت سے جرائم پر تیری بردباری جبکہ ان میں سے بعض بھول کراور بعض میں نے جان بوجھ کر کیے تو اس سے مجھے طمع ہوئی کہ میں تجھ سے مانگوں جس کا میں حقدار نہیں چنانچہ تو نے اپنی رحمت سے مجھے روزی دی اور اپنی قدرت کے کرشمے دکھائے قبولیت کی پہچان کرائی پس اب میں باامن ہو کر تجھے پکارتا ہوں اور سوال کرتا ہوں الفت سے نہ ڈرتے گھبراتے ہوئے اور مجھے ناز ہے کہ اس بارے میں تیری بارگاہ میں آیا ہوں پس اگر تو نے قبولیت میں دیر کی تو میں بوجہ نادانی تجھ سے شکوہ کروں گا اگرچہ وہ تاخیر کاموں کے نتائج سے متعلق تیرے علم میں میرے لیے بہتری کی حامل ہو پس میں نے تیرے سوا کوئی مولا نہیں دیکھاجو میرے جیسے پست بندے پر مہربان و صابر ہو اے پروردگار تو مجھے پکارتا ہے تو میں تجھ سے منہ موڑتا ہوں تو مجھ سے محبت کرتا ہے میں تجھ سے خفگی کرتا ہوں تو میرے ساتھ الفت کرتا ہے میں بے رخی کرتا ہوں جیسا کہ میرا تجھ پر کوئی احسان رہا ہو تو بھی میرا عمل یہ طرز عمل تجھے مجھ پر رحمت فرمانے اور مجھ پر اپنی عطا و بخشش کے ساتھ فضل و احسان کرنے سے باز نہیں رکھتا  پس اپنے اس نادان بندے پر رحم کر اور اس پر اپنے فضل و احسان سے سخاوت فرما بے شک تو بہت دینے والا سخی ہے حمد ہے اس اللہ کے لیے جو سلطنت کا مالک کشتی کو رواں کرنے والا ہواؤں کو قابو رکھنے والاصبح کو روشن کرنے والا اور قیامت میں جزا دینے والا جہانوں کا پروردگار ہے حمد ہے اللہ کی کہ جانتے ہوئے بھی بردباری سے کام لیتا ہے اور حمد ہے اللہ کی قوت کے باوجود معاف کرتا ہے اور حمد ہے اللہ کی حالت غضب میں بھی بڑا بردبار ہے اور وہ جو چاہے اسے کر گزرنے کی طاقت رکھتا ہے حمد ہے اللہ کی جو مخلوق کو پیدا کرنے والا روزی کشادہ کرنے والا صبح کو روشنی بخشنے والا صاحب جلالت و کرماور فضل و نعمت کا مالک ہے جو ایسا دور ہے کہ نظر نہیں آتا اور اتنا قریب ہے کہ راز کو بھی جانتا ہے وہ مبارک اور برتر ہے حمد ہے اس اللہ کی جس کا ہمسر نہیں جو اس سے جھگڑا کرےنہ کوئی اس جیسا ہے کہ اس کا ہمشکل ہو نہ کوئی اس کا مددگار و ہمکار ہے وہ اپنی عزت میں سب عزت والوں پر غالب ہے اور سبھی عظمت والے اس کی عظمت کے آگے جھکتے ہیں وہ جو چاہے اس پر قادر ہےحمد ہے اللہ کی جسے پکارتا ہوں تو وہ جواب دیتا ہے اور میری برائی کی پردہ پوشی کرتا ہے میں اس کی نافرمانی کرتا ہوں تو بھی مجھے بڑی بڑی نعمتیں دیتا ہے کہ جن کا بدلہ میں اسے نہیں دیتاپس اس نے مجھ پر کتنی ہی خوشگوار عنایتیں اور بخششیں کی ہیں کتنی ہی خطرناک آفتوں سے بچایا لیا ہے کئی حیرت انگیز خوشیاں مجھے دکھائی ہیں پس ان پر اس کی حمد و ثنا کرتا ہوں اور لگاتار اس کا نام لیتا ہوں حمد ہے اللہ کی جس کا پردہ ہٹایا نہیں جا سکتا اس کا دررحمت بند نہیں ہوتا اس کا سائل خالی نہیں جاتا اور اس کا امیدوار مایوس نہیں ہوتا حمد ہے اللہ کی جو ڈرنے والوں کوپناہ دیتا ہے نیکو کاروں کو نجات دیتا ہےلوگوں کے دبائے ہوؤں کو ابھارتا ہے بڑا بننے والوں کو نیچا دکھاتا ہے بادشاہوں کو تباہ کرتا اور ان کی جگہ دوسروں کو لے آتا ہے حمد اس اللہ کی کہ وہ دھونسیوں کا زور توڑنے والا ظالموں کو برباد کرنے والافریادیوں کو پہنچنے والا اور بے انصافوں کو سزا دینے والا ہے وہ داد خواہوں کا داد رس حاجات طلب کرنے والوں کا ٹھکانہ اور مومنوں کی ٹیک ہے حمد ہے اللہ کی جس کے خوف سے آسمان اور آسمان والے لرزتے کانپتے ہیں زمین اور اس کے آباد کار دہل جاتے ہیں سمندر لرزتے ہیں اور وہ جو ان کے پانیوں میں تیرتے ہیں حمد ہے اللہ کی جس نے ہمیں یہ راہ ہدایت دکھائیاور ہم ہرگز ہدایت نہ پا سکتے اگر اللہ تعالٰی ہمیں ہدایت نہ فرماتا حمد ہے اللہ کی جو خلق کرتا ہے اور وہ مخلوق نہیں وہ رزق دیتا ہے اور وہ مرزوق نہیں وہ زندوں کو مارتااور مردوں کو زندہ کرتا ہے وہ ایسا زندہ ہے جسے موت بھلائی اسی کے ہاتھ میں ہے اور وہ ہر چیز پر قدرت رکھتا ہے اے معبود اپنی رحمت نازل فرما حضرت محمد ۖ پر جو تیرے بندے تیرے رسولتیرے امانتدار تیرے برگزیدہ تیرے حبیب اور تیرے پسندیدہ ہیں تیری مخلوق میں سے پاسدار ہیں تیرے راز کے اور پہنچانے والے ہیں تیرے پیغاموں کے ان پر رحمت کر بہترین نیکو ترین زیبا ترینکامل ترین پاکیزہ ترین روئیدہ ترین پاک ترین شفاف تریں روشن ترین اور تو نے جو بہت زحمت کی برکت دی نوازش کی مہربانی کی اور درود بھیجا کسی ایک پر اپنے بندے میں اپنے نبیوں اپنے رسولوں اور اپنے برگزیدوں میں سے اور جو تیرے ہاں بزرگی والے ہیں تیری مخلوق میں سے اے معبود رحمت فرما امیر المومنین علی ع پر جو وصی ہیں جہانوں کے پروردگار کے رسول کے تیرے بندے تیرے ولی تیرے رسول ۖ کے بھائی تیری مخلوق پر تیری حجت تیری بہت بڑی نشانی اور بہت بڑی خبر ہیں اور رحمت فرما صدیقہ  طاہرہ فاطمہ پر جو تمام جہانوں کی عورتوں کی سردار ہیں اور رحمت فرما نبی رحمت کے دو نواسوں اور ہدایت والے دو اماموں حسن ع و حسین ع پر جو جنت کے جوانوں کے سید و سردار ہیںاور رحمت فرما مسلمانوں کے اماموں پر کہ وہ علی زین العابدین ع محمد الباقر ع جعفر صادق ع موسٰی الکاظم ع علی الرضا ع محمد تقی الجواد ع  علی نقی الہادی ع حسن العسکری ع اور خلف ہادی المہدی ع ہیں جو تیرے بندوں پر تیری حجتیں اور تیرے شہروں میں تیرے امن ہیں رحمت ہو ان پر بہت بہت ہمیشہ ہمیشہ  اے معبود رحمت فرما اپنے ولی امر پر کہ جو قائم امید گاہ عادل اور منتظر ہے اس کے گرد اپنے مقرب فرشتوں کا گھیرا لگا دے اور روح القدس کے ذریعے اس کی تائید فرما اے جہانوں کے پروردگاراے معبود اسے اپنی کتاب کی طرف دعوت دینے والا اور اپنے دین کے لیے قائم قرار دے اسے زمین میں اپنا خلیفہ بنا جیسے ان کو خلیفہ بنایا جو اس سے پہلے ہو گزرے ہیں پائیدار بنا دےاپنے پسندیدہ دین کو اس کے لیے اس کے خوف کے بعد اسے امن دے کہ وہ تیرا عبادت گزار ہے کسی کو تیرا شریک نہیں بناتا اے معبود اسے معزز فرما اور اس کے ذریعے مجھے عزت دےمیں اس کی مدد کرو اور اس کے ذریعے میری مدد فرما اسے باعزت مدد دے اور اسے آسانی کے ساتھ فتح دے اور اسے اپنی طرف سے قوت والا مددگار عطا فرما اے معبود اس کے ذریعے اپنے دین اور اپنے نبی ۖ کی سنت کو ظاہر فرما یہاں تک کہ حق میں سے کوئی چیز مخلوق کے خوف سے مخفی و پوشیدہ نہ رہ جائے اے معبود ہم ایسی برکت والی حکومت کی خاطر تیری طرف رغبت رکھتے ہیںجس سے تو اسلام و اہل اسلام کو قوت دے اور نفاق و اہل نفاق کو ذلیل کرے اور اس حکومت میں ہمیں اپنی اطاعت کی طرف بلانے والے اور اپنے راستے کی طرف رہنمائی کرنے والے قرار دےاور اس کے ذریعے ہمیں دنیا و آخرت کی عزت دے اے معبود جس حق کی تو نے ہمیں معرفت کرائی اس کے تحمل کی توفیق دے اور جس سے ہم قاصر رہے اس تک پہنچا دے اے معبود اس کے ذریعے ہم بکھروں کو جمع کر دے اس کے ذریعے ہمارے جھگڑے ختم کر اور ہماری پریشانی دور فرما اس کے ذریعے ہماری قلت کو کثرت اور ذلت کو عزت میں بدل دےاسکے ذریعے ہمیں نادار سے تونگر بنا اور ہمارے قرض ادا کردے اس کے ذریعے ہمارا فقر دور فرما دے ہماری حاجتیں پوری کر دے اور تنگی کو آسانی میں بدل دے اس کے ذریعے ہمارے چہرے روشن کراور ہمارے قیدیوں کو رہائی دے اس کے ذریعے ہماری حاجات بر لا اور ہمارے وعدے نبھا دے اس کے ذریعے ہماری دعائیں قبول فرما اورہمارے سوال پورے کر دے اس کے ذریعے پوری فرما دنیا و آخرت میں ہماری امیدیں اور ہمیں ہماری خواست سے زیادہ عطا کر اے سوال کیے جانے والوں میں بہترین اور اے سب سے زیادہ عطا والے اس کے ذریعے ہمارے سینوں کو شفا دے  اور ہمارے دلوں سے بغض و کینہ کو ہٹا دے جس حق میں ہمارا اختلاف ہے اپنے حکم سے اس کے ذریعے ہمیں ہدایت عطا فرما بے شک تو جسے چاہے سیدھے راستے کی طرف لے جاتا ہےاس کے ذریعے اپنے اور ہمارے دشمن پر ہمیں غلبہ عطا فرما اے سچے خدا ایسا ہی ہو اے معبود ہم شکایت کرتے ہیں تجھ سے اپنے نبی کے اٹھ جانے کی کہ ان پر اور ان کی آل پر تیری رحمت ہواور اپنے ولی کی پوشیدگی کی اور شاکی ہیں دشمنوں کی کثرت اور اپنی قلت تعداد پر فتنوں کی سختی اور حوادث زمانہ کی یلغار کی شکایت کرتے ہیں پس رحمت فرما محمد ۖ اور ان کی آل پراور ہماری مدد فرما ان پر فتح کے ساتھ اور اس میں جلدی کر کہ تکلیف دور کر دے نصرت سے عزت عطا کر حق کے غلبے کا اظہار فرما ایسی رحمت فرما جو ہم پر سایہ کرے اور امن عطا کر جو ہمیں محفوظ بنا دےرحمت فرما اے سب سے زیادہ رحم کرنے والے    `,

reference:`<b>📚 کتاب:</b> اقبال الأعمال<br><b>✍️ مصنف:</b> سید ابن طاؤس<br><b>📖 اصل ماخذ:</b> دعائے افتتاح`
}







,
{
id:9,

title:"دعائے مجیر",

english:"Dua-e-Mujeer",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
سُبحانَكَ يا اللهُ، تَعالَيتَ يا رَحمنُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَحيمُ، تَعالَيتَ يا كَريمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مَلِكُ، تَعالَيتَ يا مالِكُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قُدّوسُ، تَعالَيتَ يا سَلامُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُؤمِنُ، تَعالَيتَ يا مُهَيمِنُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عَزيزُ، تَعالَيتَ يا جَبّارُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُتَكَبِّرُ، تَعالَيتَ يا مُتَجَبِّرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا خالِقُ، تَعالَيتَ يا بارئُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُصَوِّرُ، تَعالَيتَ يا مُقَدِّرُ ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا هادي، تَعالَيتَ يا باقي، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا وَهَّابُ، تَعالَيتَ يا تَوّابُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا فَتّاحُ، تَعالَيتَ يا مُرتاحُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا سَيِّدي، تَعالَيتَ يا مَولايَ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قَريبُ، تَعالَيتَ يا رَقيبُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُبدئُ، تَعالَيتَ يا مُعيدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا حَميدُ ، تَعالَيتَ يا مَجيدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قَديمُ، تَعالَيتَ يا عَظيمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا غَفورُ، تَعالَيتَ يا شَكورُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا شاهِدُ، تَعالَيتَ يا شَهيدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا حَنّانُ، تَعالَيتَ يا مَنّانُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا باعِثُ، تَعالَيتَ يا وارِثُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُحيي، تَعالَيتَ يا مُميتُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا شَفيقُ، تَعالَيتَ يا رَفيقُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا أنيسُ، تَعالَيتَ يا مُؤنِسُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا جَليلُ، تَعالَيتَ يا جَميلُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا خَبيرُ، تَعالَيتَ يا بَصيرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا حَفيُّ، تَعالَيتَ يا مَليُّ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مَعبودُ ، تَعالَيتَ يا مَوجودُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا غَفّارُ، تَعالَيتَ يا قَهّارُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مَذكورُ، تَعالَيتَ يا مَشكورُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا جَوادُ، تَعالَيتَ يا مَعاذُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا جَمالُ، تَعالَيتَ يا جَلالُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا سابِقُ، تَعالَيتَ يا رازِقُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا صادِقُ، تَعالَيتَ يا فالِقُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا سَميعُ، تَعالَيتَ يا سَريعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَفيعُ، تَعالَيتَ يا بَديعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا فَعّالُ، تَعالَيتَ يا مُتَعالُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قاضي، تَعالَيتَ يا راضي ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قاهِرُ، تَعالَيتَ يا طاهِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عالِمُ ، تَعالَيتَ يا حاكِمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا دائِمُ، تَعالَيتَ يا قائِمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عاصِمُ، تَعالَيتَ يا قاسِمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا غَنيُّ، تَعالَيتَ يا مُغني، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا وَفيُّ، تَعالَيتَ يا قَويُّ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا كافي، تَعالَيتَ يا شافي، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُقَدِّمُ، تَعالَيتَ يا مُؤَخِّرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا أوَّلُ، تَعالَيتَ يا آخِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ظاهِرُ، تَعالَيتَ يا باطِنُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَجاءُ، تَعالَيتَ يا مُرتَجى، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ذا المَنِّ، تَعالَيتَ يا ذا الطَّولِ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا حَيُّ، تَعالَيتَ يا قَيّومُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا واحِدُ، تَعالَيتَ يا أحَدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا سَيِّدُ، تَعالَيتَ يا صَمَدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قَديرُ، تَعالَيتَ يا كَبيرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا والي، تَعالَيتَ يا مُتَعالِي، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عَليُّ، تَعالَيتَ يا أعلى، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا وَليُّ، تَعالَيتَ يا مَولى، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ذارئُ، تَعالَيتَ يا بارئُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا خافِضُ، تَعالَيتَ يا رافِعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُقسِطُ، تَعالَيتَ يا جامِعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُعِزُّ، تَعالَيتَ يا مُذِلُّ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا قادِرُ، تَعالَيتَ يا مُقتَدِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عَليمُ، تَعالَيتَ يا حَليمُ، أجِرنا مِنَ النّارِ يا مُجيرُ سُبحانَكَ يا حَكَمُ تَعَالَيتَ يا حَكيمُ أجِرنا مِنَ النَّارِ يا مَجيرُ.
سُبحانَكَ يا مُعطي، تَعالَيتَ يا مانِعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ضارُّ، تَعالَيتَ يا نافِعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُجيبُ، تَعالَيتَ يا حَسيبُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عادِلُ، تَعالَيتَ يا فاصِلُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا لَطيفُ، تَعالَيتَ يا شَريفُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَبُّ، تَعالَيتَ يا حَقُّ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ماجِدُ، تَعالَيتَ يا واحِدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا عَفوُّ، تَعالَيتَ يا مُنتَقِمُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا واسِعُ، تَعالَيتَ يا موَسِّعُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَؤوفُ، تَعالَيتَ يا عَطوفُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا فَردُ، تَعالَيتَ يا وِترُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُقيتُ، تَعالَيتَ يا مُحيطُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا وَكيلُ، تَعالَيتَ يا عَدلُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُبينُ، تَعالَيتَ يا مَتينُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا بَرُّ، تَعالَيتَ يا وَدودُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا رَشيدُ، تَعالَيتَ يا مُرشِدُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا نورُ، تَعالَيتَ يا مُنَوِّرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا نَصيرُ، تَعالَيتَ يا ناصِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا صَبورُ، تَعالَيتَ يا صابِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُحصي، تَعالَيتَ يا مُنشئُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا سُبحانُ، تَعالَيتَ يا دَيانُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا مُغيثُ، تَعالَيتَ يا غيا ثُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا فاطِرُ، تَعالَيتَ يا حاضِرُ، أجِرنا مِنَ النّارِ يا مُجيرُ.
سُبحانَكَ يا ذا العِزِّ وَالجَمالِ، تَبارَكتَ يا ذا الجَبَروتِ وَالجَلالِ.
سُبحانَكَ لا إلهَ إلاّ أنتَ سُبحانَكَ إنّي كُنتُ مِنَ الظّالِمينَ فَاستَجَبنا لَهُ وَنَجَّيناهُ مِنَ الغَمِّ وَكذلِكَ نُنجي المُؤمِنين، وَصَلّى اللهُ عَلى سَيِّدِنا مُحَمَّدٍ وَآلِهِ أجمَعينَ، وَالحَمدُ للهِ رَبِّ العالَمينَ، وَحَسبُنا الله وَنِعمَ الوَكيلُ، وَلاحَولَ وَلاقوَّةَ إلاّ بِالله العَليِّ العَظيمِ.`,

translation:`تو پاک ہے`,

reference:`<b>📚 کتاب:</b> بلد الأمین<br><b>✍️ مصنف:</b> ابراہیم کفعمی<br><b>📖 اصل ماخذ:</b> دعائے مجیر`
}






,
{
id:10,

title:"دعائے جوشن کبیر",

english:"Dua-e-Jawshan Kabir",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
(1) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا اللهُ، يا رَحمنُ، يا رَحيمُ، يا كَريمُ، يا مُقيمُ، يا عَظيمُ، يا قَديمُ، يا عَليمُ، يا حَليمُ، يا حَكيمُ، سُبحانَكَ، يا لا إلهَ إلاّ أنتَ، الغَوثَ الغَوثَ الغَوثَ، خَلِّصنا مِنَ النّارِ، يا رَبِّ.
(2) يا سَيِّدَ السّاداتِ، يا مُجيبَ الدَّعَواتِ، يا رافعَ الدَّرَجاتِ، يا وَليَّ الحَسَناتِ، يا غافِرَ الخَطيئاتِ، يا مُعطيَ المَسألاتِ، يا قابِلَ التَّوباتِ، يا سامعَ الأصواتِ، يا عالِمَ الخَفياتِ، يا دافعَ البَلياتِ.
(3) يا خَيرَ الغافِرينَ، يا خَيرَ الفاتِحينَ، يا خَيرَ النّاصِرينَ، يا خَيرَ الحاكِمينَ، يا خَيرَ الرّازِقينَ، يا خَيرَ الوارِثينَ، يا خَيرَ الحامِدينَ، يا خَيرَ الذَّاكِرينَ، يا خَيرَ المُنزِلينَ، يا خَيرَ المُحسِنينَ.
(4) يا مَن لَهُ العِزَّةُ وَالجَمالُ، يا مَن لَهُ القُدرَةُ وَالكَمالُ، يا مَن لَهُ المُلكُ وَالجَلالُ، يا مَن هُوَ الكَبيرُ المُتَعالِ، يا مُنشئَ السَّحابِ الثِّقالِ، يا مَن هُوَ شَديدُ المِحالِ، يا مَن هُوَ سَريعُ الحِسابِ، يا مَن هُوَ شَديدُ العِقابِ، يا مَن عِندَهُ حُسنُ الثَّوابِ، يا مَن عِندَهُ اُمُّ الكِتابِ.
(5) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حَنَّانُ، يا مَنَّانُ، يا دَيانُ، يا بُرهانُ، يا سُلطانُ، يا رِضوانُ، يا غُفرانُ، يا سُبحانُ، يا مُستَعانُ، يا ذا المَنِّ وَالبَيا نِ.
(6) يا مَن تَواضَعَ كُلُّ شيءٍ لِعَظَمَتِهِ، يا مَن استسلّم كُلُّ شيءٍ لِقُدرَتِهِ، يا مَن ذَلَّ كُلُّ شيءٍ لِعِزَّتِهِ، يا مَن خَضَعَ كُلُّ شيءٍ لِهَيبَتِهِ، يا مَن انقادَ كُلُّ شيءٍ مِن خَشيَتِهِ، يا مَن تَشَقَّقَتِ الجِبالُ مِن مَخافَتِهِ، يا مَن قامَتِ السَّماواتُ بِأمرِهِ، يا مَن استَقَرَّتِ الأرَضونَ بِإذنِهِ، يا مَن يُسَبِّحُ الرَّعدُ بِحَمدِهِ، يا مَن لا يَعتَدي عَلى أهلِ مَملَكَتِهِ.
(7) يا غافِرَ الخطايا، يا كاشِفَ البَلايا، يا مُنتَهى الرَّجايا، يا مُجزِلَ العَطايا، يا واهِبَ الهَدايا، يا رازِقَ البَرايا، يا قاضيَ المَنايا، يا سامِعَ الشَّكايا، يا باعِثَ البَرايا، يا مُطلِقَ الاُسارى.
(8) يا ذا الحَمدِ وَالثَّناءِ، يا ذا الفَخرِ وَالبَهاءِ، يا ذا المَجدِ وَالسَّناءِ، يا ذا العَهدِ وَالوَفاءِ، يا ذا العَفوِ وَالرِّضاءِ، يا ذا المَنِّ وَالعَطاءِ، يا ذا الفَصلِ وَالقَضاءِ، يا ذا العِزِّ وَالبَقاءِ، يا ذا الجودِ وَالسَّخاءِ، يا ذا الآلاء وَالنَّعماءِ.
(9) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مانِعُ، يا دافِعُ، يا رافِعُ، يا صانِعُ، يا نافِعُ، يا سامِعُ، يا جامِعُ، يا شافِعُ، يا واسِعُ، يا موسِعُ.
(10) يا صانِعَ كُلِّ مَصنوعٍ، يا خالِقَ كُلِّ مَخلوقٍ، يا رازِقَ كُلِّ مَرزوقٍ، يا مالِكَ كُلِّ مَملوكٍ، يا كاشِفَ كُلِّ مَكروبٍ، يا فارِجَ كُلِّ مَهمومٍ، يا راحِمَ كُلِّ مَرحومٍ، يا ناصِرَ كُلِّ مَخذولٍ، يا ساتِرَ كُلِّ مَعيوبٍ، يا مَلجَأَ كُلِّ مَطرودٍ.
(11) يا عُدَّتي عِندَ شِدَّتي، يا رَجائي عِندَ مُصيبَتي، يا مؤنِسي عِندَ وَحشَتي، يا صاحِبي عِندَ غُربَتي، يا وَليّي عِندَ نِعمَتي، يا غياثي عِندَ كُربَتي، يا دَليلي عِندَ حَيرَتي، يا غَنائي عِندَ افتِقاري، يا مَلجَأي عِندَ اضطِراري، يا مُعيني عِندَ مَفزَعي.
(12) يا عَلّا مَ الغُيوبِ، يا غَفَّارَ الذُّنوبِ، يا سَتَّارَ العُيوبِ، يا كاشِفَ الكُروبِ، يا مُقَلِّبَ القُلوبِ، يا طَبيبَ القُلوبِ، يا مُنَوِّرَ القُلوبِ، يا أنيسَ القُلوبِ، يا مُفَرِّجَ الهُمومِ، يا مُنَفِّسَ الغُمومِ.
(13) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا جَليلُ، يا جَميلُ، يا وَكيلُ، يا كَفيلُ، يا دَليلُ، يا قَبيلُ ، يا مُديلُ، يا مُنيلُ، يا مُقيلُ، يا مُحيلُ.
(14) يا دَليلَ المُتَحَيِّرينَ، يا غيا ثَ المُستَغيثينَ، يا صَريخَ المُستَصرِخينَ، يا جارَ المُستَجيرينَ، يا أمانَ الخائِفينَ، يا عَونَ المُؤمِنينَ، يا راحِمَ المَساكينَ، يا مَلجأ العاصينَ، يا غافِرَ المُذنِبينَ، يا مُجيبَ دَعوَةِ المُضطَرّينَ.
(15) يا ذا الجودِ وَالإحسانِ، يا ذا الفَضلِ وَالامتِنانِ، يا ذا الأمنِ وَالأمانِ، يا ذا القُدسِ وَالسُّبحانِ، يا ذا الحِكمَةِ وَالبَيا نِ، يا ذا الرَّحمَةِ وَالرِّضوانِ، يا ذا الحُجَّةِ وَالبُرهانِ، يا ذا العَظَمَةِ وَالسُّلطانِ، يا ذا الرَأفَةِ وَالمُستَعانِ، يا ذا العَفوِ وَالغُفرانِ.
(16) يا مَن هُوَ رَبُّ كُلِّ شيءٍ، يا مَن هُوَ إلهُ كُلِّ شيءٍ، يا مَن هُوَ خالِقُ كُلِّ شيءٍ، يا مَن هُوَ صانِعُ كُلِّ شيءٍ، يا مَن هُوَ قَبلَ كُلِّ شيءٍ، يا مَن هُوَ بَعدَ كُلِّ شيءٍ، يا مَن هُوَ فَوقَ كُلِّ شيءٍ، يا مَن هُوَ عالِمٌ بكُلِّ شيءٍ، يا مَن هُوَ قادِرٌ عَلى كُلِّ شيءٍ، يا مَن هُوَ يَبقى وَيَفنى كُلُّ شيءٍ.
(17) اللهُمَّ إنّي أسألُكَ، يا مُؤمِنُ، يا مُهَيمِنُ، يا مُكَوِّنُ، يا مُلَقِّنُ، يا مُبيّنُ، يا مُهَوِّنُ، يا مُمَكِّنُ، يا مُزَيِّنُ، يا مُعلِنُ، يا مُقَسِّمُ.
(18) يا مَن هُوَ في مُلكِهِ مُقيمٌ، يا مَن هُوَ في سُلطانِهِ قَديمٌ، يا مَن هُوَ في جَلالِهِ عَظيمٌ، يا مَن هُوَ عَلى عِبادِهِ رَحيمٌ، يا مَن هُوَ بكُلِّ شيءٍ عَليمٌ، يا مَن هُوَ بِمَن عَصاهُ حَليمٌ، يا مَن هُوَ بِمَن رَجاهُ كَريمٌ، يا مَن هُوَ في صُنعِهِ حَكيمٌ، يا مَن هُوَ في حِكمَتِهِ لَطيفٌ، يا مَن هُوَ في لُطفِهِ قَديمٌ.
(19) يا مَن لايُرجى إلاّ فَضلُهُ، يا مَن لايُسألُ إلاّ عَفوُهُ، يا مَن لايُنظَرُ إلاّ بِرُّهُ، يا مَن لا يُخافُ إلاّ عَدلُهُ، يا مَن لا يَدومُ إلاّ مُلكُهُ، يا مَن لاسُلطانَ إلاّ سُلطانُهُ، يا مَن وَسِعَت كُلَّ شيءٍ رَحمَتُهُ، يا مَن سَبَقَت رَحمَتُهُ غَضَبَهُ، يا مَن أحاطَ بِكُلِّ شيءٍ عِلمُهُ، يا مَن لَيسَ أحَدٌ مِثلَهُ.
(20) يا فارِجَ الهَمِّ، يا كاشِفَ الغَمِّ، يا غافِرَ الذَّنبِ، يا قابِلَ التَّوبِ، يا خالِقَ الخَلقِ، يا صادِقَ الوَعدِ، يا موفي العَهدِ، يا عالِمَ السِّرِّ، يا فالِقَ الحَبِّ، يا رازِقَ الأنامِ.
(21) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عَليُّ، يا وَفيُّ، يا غَنيُّ، يا مَليُّ، يا حَفيُّ، يا رَضيُّ، يا زَكيُّ ، يا بَديُّ، يا قَويُّ، يا وَليُّ.
(22) يا مَن أظهَرَ الجَميلَ، يا مَن سَتَرَ القَبيحَ، يا مَن لَم يُؤاخِذ بِالجَريرَةِ، يا مَن لَم يَهتِكِ السِّترَ، يا عَظيمَ العَفوِ، يا حَسَنَ التَّجاوُزِ، يا واسِعَ المَغفِرَةِ، يا باسِطَ اليَّدَينِ بِالرَّحمَةِ، يا صاحِبَ كُلِّ نَجوى، يا مُنتَهى كُلِّ شَكوى.
(23) يا ذا النِّعمَةِ السَّابِغَةِ، يا ذا الرَّحمَةِ الواسِعَةِ، يا ذا المِنَّةِ السَّابِقَةِ، يا ذا الحِكمَةِ البالِغَةِ، يا ذا القُدرَةِ الكامِلَةِ، يا ذا الحُجَّةِ القاطِعَةِ، يا ذا الكَرامَةِ الظاهِرَةِ، يا ذا العِزَّةِ الدَّائِمَةِ، يا ذا القوَّةِ المَتينَةِ، يا ذا العَظَمَةِ المَنيعَةِ.
(24) يا بَديعَ السَّماواتِ، يا جاعِلَ الظُّلُماتِ، يا راحِم العَبَراتِ، يا مُقيلَ العَثَراتِ، يا ساتِرَ العَوراتِ، يا مُحييَ الأمواتِ، يا مُنزِلَ الآيات، يا مُضَعِّفَ الحَسَناتِ، يا ماحي السَّيِّئاتِ، يا شَديدَ النَّقَماتِ.
(25) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُصَوِّرُ، يا مُقَدِّرُ، يا مُدَبِّرُ، يا مُطَهِّرُ، يا مُنَوِّرُ، يا مُيَسِّرُ، يا مُبَشِّرُ، يا مُنذِرُ، يا مُقَدِّمُ، يا مُؤَخِّرُ.
(26) يا رَبَّ البَيتِ الحَرامِ، يا رَبَّ الشَّهرِ الحَرامِ، يا رَبَّ البَلَدِ الحَرامِ، يا رَبَّ الرُّكنِ وَالمَقامِ، يا رَبَّ المَشعَرِ الحَرامِ، يا رَبَّ المَسجِدِ الحَرامِ، يا رَبَّ الحِلِّ وَالحَرامِ، يا رَبَّ النّورِ وَالظَّلامِ، يا رَبَّ التَّحيَّةِ وَالسَّلامِ، يا رَبَّ القُدرَةِ في الأنامِ.
(27) يا أحكَمَ الحاكِمينَ، يا أعدَلَ العادِلينَ، يا أصدَقَ الصَّادِقينَ، يا أطهَرَ الطَّاهِرِينَ، يا أحسَنَ الخالِقينَ، يا أسرَعَ الحاسِبينَ، يا أسمَعَ السَّامِعينَ، يا أبصَرَ النَّاظِرينَ، يا أشفَعَ الشَّافِعينَ، يا أكرَمَ الأكرَمينَ.
(28) يا عِمادَ مَن لا عِمادَ لَهُ، يا سَنَدَ مَن لا سَنَدَ لَهُ، يا ذُخرَ مَن لا ذُخرَ لَهُ، يا حِرزَ مَن لا حِرزَ لَهُ، يا غيا ثَ مَن لا غيا ثَ لَهُ، يا فَخرَ مَن لا فَخرَ لَهُ، يا عِزَّ مَن لا عِزَّ لَهُ، يا مُعينَ مَن لا مُعينَ لَهُ ، يا أنيسَ مَن لا أنيسَ لَهُ، يا أمانَ مَن لا أمانَ لَهُ.
(29) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عاصِمُ، يا قائِمُ، يا دائِمُ، يا راحِمُ، يا سالِمُ، يا حاكِمُ، يا عالِمُ، يا قاسِمُ، يا قابِضُ، يا باسِطُ.
(30) يا عاصِمَ مَنِ استَعصَمَهُ ، يا راحِمَ مَن استَرحَمَهُ، يا غافِرَ مَنِ استَغفَرَهُ، يا ناصِرَ مَنِ استَنصَرَهُ، يا حافِظَ مَنِ استَحفَظَهُ، يا مُكرِمَ مَنِ استَكرَمَهُ، يا مُرشِدَ مَنِ استَرشَدَهُ، يا صِريخَ مَنِ استَصرَخَهُ، يا مُعينَ مَنِ استَعانَهُ، يا مُغيثَ مَنِ استَغاثَهُ.
(31) يا عَزيزاً لا يُضامُ، يا لَطيفاً لا يُرامُ، يا قَيّوماً لا يَنامُ، يا دائِماً لا يَفوتُ، يا حَيا لا يَموتُ ، يا مَلِكاً لا يَزولُ، يا باقياً لا يَفنى، يا عالِماً لا يَجهَلُ، يا صَمَداً لا يُطعَمُ، يا قَويا لا يَضعُفُ.
(32) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا أحَدُ، يا واحِدُ، يا شاهِدُ، يا ماجِدُ، يا حامِدُ، يا راشِدُ، يا باعِثُ، يا وارِثُ، يا ضارُّ، يا نافِعُ.
(33) يا أعظَمَ مِن كُلِّ عَظيمٍ، يا أكرَمَ مِن كُلِّ كَريمٍ، يا أرحَمَ مِن كُلِّ رَحيمٍ، يا أعلَمَ مِن كُلِّ عَليمٍ، يا أحكَمَ مِن كُلِّ حَكيمٍ، يا أقدَمَ مِن كُلِّ قَديمٍ، يا أكبَرَ مِن كُلِّ كَبيرٍ، يا ألطَفَ مِن كُلِّ لَطيفٍ، يا أجَلَّ مِن كُلِّ جَليلٍ، يا أعَزَّ مِن كُلِّ عَزيزٍ.
(34) يا كَريمَ الصَّفحِ، يا عَظيمَ المَنِّ، يا كَثيرَ الخَيرِ، يا قَديمَ الفَضلِ، يا دائِمَ اللُّطفِ، يا لَطيفَ الصُّنعِ، يا مُنَفِّسَ الكَربِ، يا كاشِفَ الضُّرِّ، يا مالِكَ المُلكِ، يا قاضيَ الحَقِّ.
(35) يا مَن هُوَ في عَهدِهِ وَفيُّ، يا مَن هُوَ في وَفائِهِ قَويُّ، يا مَن هُوَ في قوَّتِهِ عَليُّ، يا مَن هُوَ في عُلوِّهِ قَريبٌ، يا مَن هُوَ في قُربِهِ لَطيفٌ، يا مَن هُوَ في لُطفِهِ شَريفٌ، يا مَن هُوَ في شَرَفِهِ عَزيزٌ ، يا مَن هُوَ في عِزِّهِ عَظيمٌ، يا مَن هُوَ في عَظَمَتِهِ مَجيدٌ، يا مَن هُوَ في مَجدِهِ حَميدٌ.
(36) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا كافي، يا شافي، يا وافي، يا مُعافي، يا هادي، يا داعي، يا قاضي، يا راضي، يا عالي، يا باقي.
(37) يا مَن كُلُّ شيءٍ خاضِعٌ لَهُ، يا مَن كُلُّ شيءٍ خاشِعٌ لَهُ، يا مَن كُلُّ شيءٍ كائِنٌ لَهُ، يا مَن كُلُّ شيءٍ مَوجودٌ بِهِ، يا مَن كُلُّ شيءٍ مُنيبٌ إلَيهِ، يا مَن كُلُّ شيءٍ خائِفٌ مِنهُ، يا مَن كُلُّ شيءٍ قائِمٌ بِهِ ، يا مَن كُلُّ شيءٍ صائِرٌ إلَيهِ، يا مَن كُلُّ شيءٍ يُسَبِّح بِحَمدِهِ يا مَن كُلُّ شيءٍ هالِكٌ إلاّ وَجهَهُ.
(38) يا مَن لامَفَرَّ إلاّ إلَيهِ، يا مَن لا مَقصَدَ إلاّ إلَيهِ، يا مَن لا مَنجى مِنهُ إلاّ إلَيهِ، يا مَن لايُرغَبُ إلاّ إلَيهِ، يا مَن لاحَولَ وَلا قوَّةَ إلاّ بِهِ، يا مَن لا يُستَعانُ إلاّ بِهِ، يا مَن لايُتَوَكَّلُ إلاّ عَلَيهِ، يا مَن لايُرجى إلاّ هوَ، يا مَن لا يُعبَدُ إلاّ هوَ.
(39) يا خَيرَ المَرهوبينَ، يا خَيرَ المَرغوبينَ، يا خَيرَ المَطلوبينَ، يا خَيرَ المَسؤولينَ، يا خَيرَ المَقصودينَ، يا خَيرَ المَذكورينَ، يا خَيرَ المَشكورينَ، يا خَيرَ المَحبوبينَ، يا خَيرَ المَدعوّينَ، يا خَيرَ المُستَأنِسينَ.
(40) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا غافِرُ، يا ساتِرُ، يا قادِرُ، يا قاهِرُ، يا فاطِرُ، يا كاسِرُ، يا جابِرُ، يا ذاكِرُ، يا ناظِرُ، يا ناصِرُ.
(41) يا مَن خَلَقَ فَسَوَّى، يا مَن قَدَّرَ فَهَدى، يا مَن يَكشِفُ البَلوى، يا مَن يَسمَعُ النَّجوى، يا مَن يُنقِذُ الغَرقى، يا مَن يُنجي الهَلكى، يا مَن يَشفي المَرضى، يا مَن أضحَكَ وَأبكى، يا مَن أماتَ وَأحيى، يا مَن خَلَقَ الزَّوجَينِ الذَّكَرَ وَالاُنثى.
(42) يا مَن في البَرِّ وَالبَحرِ سَبيلُهُ، يا مَن في الآفاقِ آياتُهُ، يا مَن في الآيات بُرهانُهُ، يا مَن في المَماتِ قُدرَتُهُ، يا مَن في القُبورِ عِبرَتُهُ، يا مَن في القيامة مُلكُهُ، يا مَن في الحِسابِ هَيبَتُهُ، يا مَن في الميزانِ قَضاؤُهُ، يا مَن في الجَنَّةِ ثَوابُهُ، يا مَن في النّارِ عِقابُهُ.
(43) يا مَن إلَيهِ يَهرَبُ الخائِفونَ، يا مَن إلَيهِ يَفزَعُ المُذنِبونَ، يا مَن إلَيهِ يَقصِدُ المُنيبونَ، يا مَن إلَيهِ يَرغَبُ الزَّاهِدونَ، يا مَن إلَيهِ يَلجَأُ المُتَحَيِّرونَ، يا مَن بِهِ يَستَأنِسُ المُريدونَ، يا مَن بِهِ يَفتَخِرُ المُحِبّونَ، يا مَن في عَفوِهِ يَطمَعُ الخاطِئونَ، يا مَن إلَيهِ يَسكُنُ الموقِنونَ، يا مَن عَلَيهِ يَتَوَكَّلُ المُتَوَكِّلونَ.
(44) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حَبيبُ، يا طَبيبُ، يا قَريبُ، يا رَقيبُ، يا حَسيبُ، يا مَهِيبُ، يا مُثيبُ، يا مُجيبُ، يا خَبيرُ، يا بَصيرُ.
(45) يا أقرَبَ مِن كُلِّ قَريبٍ، يا أحَبَّ مِن كُلِّ حَبيبٍ، يا أبصَرَ مِن كُلِّ بَصيرٍ، يا أخبَرَ مِن كُلِّ خَبيرٍ، يا أشرَفَ مِن كُلِّ شَريفٍ، يا أرفَعَ مِن كُلِّ رَفيعٍ، يا أقوى مِن كُلِّ قَويٍّ، يا أغنى مِن كُلِّ غَنيٍّ، يا أجوَدَ مِن كُلِّ جَوادٍ، يا أرأفَ مِن كُلِّ رَؤوفٍ.
(46) يا غالِباً غَيرَ مَغلوبٍ، يا صانِعاً غَيرَ مَصنوعٍ، يا خالِقاً غَيرَ مَخلوقٍ، يا مالِكاً غَيرَ مَملوكٍ، يا قاهِراً غَيرَ مَقهورٍ، يا رافِعاً غَيرَ مَرفوعٍ، يا حافِظاً غَيرَ مَحفوظٍ، يا ناصِراً غَيرَ مَنصورٍ، يا شاهِداً غَيرَ غائِبٍ، يا قَريباً غَيرَ بَعيدٍ.
(47) يا نورَ النّورِ، يا مُنَوِّرَ النّورِ، يا خالِقَ النّورِ، يا مُدَبِّرَ النّورِ، يا مُقَدِّرَ النّورِ، يا نورَ كُلِّ نورٍ، يا نوراً قَبلَ كُلِّ نورٍ، يا نوراً بَعدَ كُلِّ نورٍ، يا نوراً فَوقَ كُلِّ نورٍ، يا نوراً لَيسَ كَمَثلِهِ نورٌ.
(48) يا مَن عَطاؤُهُ شَريفٌ ، يا مَن فِعلُهُ لَطيفٌ، يا مَن لُطفُهُ مُقيمٌ، يا مَن إحسانُهُ قَديمٌ، يا مَن قَولُهُ حَقُّ، يا مَن وَعدُهُ صِدقٌ، يا مَن عَفوُهُ فَضلٌ، يا مَن عَذابُهُ عَدلٌ، يا مَن ذِكرُهُ حُلوٌ، يا مَن فَضلُهُ عَميمٌ.
(49) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُسَهِّلُ، يا مُفَصِّلُ، يا مُبَدِّلُ، يا مُذَلِّلُ، يا مُنَزِّلُ، يا مُنَوِّلُ، يا مُفضِلُ، يا مُجزِلُ، يا مُمهِلُ، يا مُجمِلُ.
(50) يا مَن يَرى وَلا يُرى، يا مَن يَخلُقُ وَلايُخلَقُ، يا مَن يَهدي وَلايُهدى، يا مَن يُحيي وَلا يُحيى، يا مَن يَسألُ وَلايُسألُ، يا مَن يُطعِمُ وَلايُطعَمُ، يا مَن يُجيرُ وَلا يُجارُ عَلَيهِ، يا مَن يَقضي وَلا يُقضى عَلَيهِ، يا مَن يَحكُمُ وَلا يُحكَمُ عَلَيهِ، يا مَن لَم يَلِد وَلَم يولَد وَلَم يَكُن لَهُ كُفُواً أحَدٌ.
(51) يا نِعمَ الحَسيبُ، يا نِعمَ الطَّبيبُ، يا نِعمَ الرَّقيبُ، يا نِعمَ القَريبُ، يا نِعمَ المُجيبُ، يا نِعمَ الحَبيبُ، يا نِعمَ الكَفيلُ، يا نِعمَ الوَكيلُ، يا نِعمَ المَولى، يا نِعمَ النَّصيرُ.
(52) يا سُرورَ العارِفينَ، يا مُنى المُحِبّينَ، يا أنيسَ المُريدينَ، يا حَبيبَ التَّوَّابينَ، يا رازِقَ المُقِلّينَ، يا رَجاءَ المُذنِبينَ، يا قُرَّةَ عَينِ العابِدينَ، يا مُنَفِّسَ عَنِ المَكروبينَ، يا مُفَرِّجَ عَنِ المَغمومينَ، يا إلهَ الأوَّلينَ وَالآخِرينَ.
(53) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا رَبَّنا، يا إلهَنا، يا سَيِّدِنا، يا مَولانا، يا ناصِرَنا، يا حافِظَنا، يا دَليلَنا، يا مُعينَنا، يا حَبيبَنا، يا طَبيبَن.
(54) يا رَبَّ النَّبيّينَ وَالأبرارِ، يا رَبَّ الصِّدّيقينَ وَالأخيارِ، يا رَبَّ الجَنَّةِ وَالنّارِ، يا رَبَّ الصِّغارِ وَالكِبارِ، يا رَبَّ الحُبُوبِ وَالثِّمارِ، يا رَبَّ الأنهارِ وَالأشجارِ، يا رَبَّ الصَّحاري وَالقِفارِ، يا رَبَّ البَراري وَالبِحارِ، يا رَبَّ اللَّيلِ وَالنَّهارِ، يا رَبَّ الإعلانِ وَالاَسرارِ.
(55) يا مَن نَفَذَ في كُلِّ شيءٍ أمرُهُ، يا مَن لَحِقَ بِكُلِّ شيءٍ عِلمُهُ، يا مَن بَلَغَت إلى كُلِّ شيءٍ قُدرَتُهُ، يا مَن لا تُحصي العِبادُ نِعَمَهُ، يا مَن لاتَبلُغُ الخَلائِقُ شُكرَهُ، يا مَن لاتُدرِكُ الأفهامُ جَلالَهُ، يا مَن لاتَنالُ الأوهامُ كُنهَهُ، يا مَن العَظَمَةُ وَالكِبرياءُ رِداؤُهُ، يا مَن لا تَرُدُّ العِبادُ قَضاءَهُ، يا مَن لا مُلكَ إلاّ مُلكُهُ، يا مَن لا عَطاءَ إلاّ عَطاؤُهُ.
(56) يا مَن لَهُ المَثَلُ الأعلى، يا مَن لَهُ الصِّفاتُ العُليا، يا مَن لَهُ الآخرةُ وَالاُولى، يا مَن لَهُ الجَنَّةُ المَأوى، يا مَن لَهُ الآيات الكُبرى، يا مَن لَهُ الأسماءُ الحُسنى، يا مَن لَهُ الحُكمُ وَالقَضاءُ، يا مَن لَهُ الهَواءُ وَالفَضاءُ، يا مَن لَهُ العَرشُ وَالثَّرى، يا مَن لَهُ السَّماواتُ العُلى.
(57) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عَفوُّ، يا غَفورُ، يا صَبورُ، يا شَكورُ، يا رَؤوفُ، يا عَطوفُ، يا مَسؤولُ، يا وَدودُ، يا سُبّوحُ، يا قُدّوسُ.
(58) يا مَن في السَّماءِ عَظَمَتُهُ، يا مَن في الأرضِ آياتُهُ، يا مَن في كُلِّ شيءٍ دَلائِلُهُ، يا مَن في البِحارِ عَجائِبُهُ، يا مَن في الجِبالِ خَزائِنُهُ، يا مَن يُبدِئُ الخَلقَ ثمّ يُعيدُهُ، يا مَن إلَيهِ يَرجِعُ الأمرُ كُلُّهُ، يا مَن أظهَرَ في كُلِّ شيءٍ لُطفَهُ، يا مَن أحسَنَ كُلَّ شيءٍ خَلقَهُ، يا مَن تَصَرَّفَ في الخَلائِقِ قُدرَتُهُ.
(59) يا حَبيبَ مَن لاحَبيبَ لَهُ، يا طَبيبَ مَن لا طَبيبَ لَهُ، يا مُجيبَ مَن لا مُجيبَ لَهُ، يا شَفيقَ مَن لا شَفيقَ لَهُ، يا رَفيقَ مَن لا رَفيقَ لَهُ، يا مُغيثَ مَن لا مُغيثَ لَهُ، يا دَليلَ مَن لا دَليلَ لَهُ، يا أنيسَ مَن لا أنيسَ لَهُ، يا راحِمَ مَن لا راحِمَ لَهُ، يا صاحِبَ مَن لا صاحِبَ لَهُ.
(60) يا كافيَ مَن استَكفاهُ، يا هاديَ مَن استَهداهُ، يا كالئ مَن استَكلّاهُ، يا راعيَ مَنِ استَرعاهُ، يا شافيَ مَن استَشفاهُ، يا قاضيَ مَنِ استَقضاهُ، يا مُغنيَ مَنِ استَغناهُ، يا موفيَ مَنِ استَوفاهُ، يا مُقَوّيَ مَنِ استَقواهُ، يا وَليَّ مَنِ استَولاهُ.
(61) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا خالِقُ، يا رازِقُ، يا ناطِقُ، يا صادِقُ، يا فالِقُ، يا فارِقُ، يا فاتِقُ، يا راتِقُ، يا سابِقُ، يا سامِقُ.
(62) يا مَن يُقَلِّبُ اللَّيلَ وَالنَّهارَ، يا مَن جَعَلَ الظُّلُماتِ وَالأنوارَ، يا مَن خَلَقَ الظِّلَّ وَالحَرورَ، يا مَن سَخَّرَ الشَّمسَ وَالقَمَرَ، يا مَن قَدَّرَ الخَيرَ وَالشَّرَّ، يا مَن خَلَقَ المَوتَ وَالحياةَ، يا مَن لَهُ الخَلقُ وَالأمرُ، يا مَن لَم يَتَّخِذ صاحِبَةً وَلا وَلَداً، يا مَن لَيسَ لَهُ شَريكٌ في المُلكِ، يا مَن لَم يَكُن لَهُ وَليُّ مِنَ الذُّلِّ.
(63) يا مَن يَعلَمُ مُرادَ المُريدينَ، يا مَن يَعلَمُ ضَميرَ الصَّامِتينَ، يا مَن يَسمَعُ أنينَ الواهِنينَ، يا مَن يَرى بُكاءَ الخائِفينَ، يا مَن يَملِكُ حَوائِجَ السَّائِلينَ، يا مَن يَقبَلُ عُذرَ التَّائِبينَ، يا مَن لا يُصلِحُ عَمَلَ المُفسِدينَ، يا مَن لا يُضيعُ أجرَ المُحسِنينَ، يا مَن لا يَبعُدُ عَن قُلوبِ العارِفينَ، يا أجوَدَ الأجوَدينَ.
(64) يا دائِمَ البَقاءِ، يا سامِعَ الدُّعاءِ، يا واسِعَ العَطاءِ، يا غافِرَ الخَطاءِ، يا بَديعَ السَّماءِ، يا حَسَنَ البَلاءِ، يا جَميلَ الثَّناءِ، يا قَديمَ السَّناءِ، يا كَثيرَ الوَفاءِ، يا شَريفَ الجَزاءِ.
(65) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا سَتَّارُ، يا غَفَّارُ، يا قَهَّارُ، يا جَبَّارُ، يا صَبَّارُ، يا بارُّ، يا مُختارُ، يا فَتَّاحُ، يا نَفَّاحُ، يا مُرتاحُ.
(66) يا مَن خَلَقَني وَسَوَّاني، يا مَن رَزَقَني وَرَبَّاني، يا مَن أطعَمَني وَسَقاني، يا مَن قَرَّبَني وَأدناني، يا مَن عَصَمَني وَكَفاني، يا مَن حَفِظَني وَكَلاني ، يا مَن أعَزَّني وَأغناني، يا مَن وَفَّقَني وَهَداني، يا مَن آنَسَني وَآواني، يا مَن أماتَني وَأحياني.
(67) يا مَن يُحِقُّ الحَقَّ بِكَلِماتِهِ، يا مَن يَقبَلُ التَّوبَةَ عَن عِبادِهِ، يا مَن يَحولُ بَينَ المَرءِ وَقَلبِهِ، يا مَن لاتَنفَعُ الشَّفاعَةُ إلاّ بِإذنِهِ، يا مَن هُوَ أعلَمُ بِمَن ضَلَّ عَن سَبيلِهِ، يا مَن لامُعَقِّبَ لِحُكمِهِ، يا مَن لا رادَّ لِقَضائِهِ، يا مَن انقادَ كُلُّ شيءٍ لأمرِهِ، يا مَن السَّماواتُ مَطويا تٌ بيَمينِهِ، يا مَن يُرسِلُ الرياحَ بُشراً بَينَ يَدَي رَحمَتِهِ.
(68) يا مَن جَعَلَ الأرضَ مِهاداً، يا مَن جَعَلَ الجِبالَ أوتاداً، يا مَن جَعَلَ الشَّمسَ سِراجاً، يا مَن جَعَلَ القَمَرَ نوراً، يا مَن جَعَلَ اللَّيلَ لِباساً، يا مَن جَعَلَ النَّهارَ مَعاشاً، يا مَن جَعَلَ النَّومَ سُباتاً، يا مَن جَعَلَ السَّماء بِناءً، يا مَن جَعَلَ الأشياءَ أزواجاً، يا مَن جَعَلَ النّارَ مِرصاد.
(69) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا سَميعُ، يا شَفيعُ، يا رَفيعُ، يا مَنيعُ، يا سَريعُ، يا بَديعُ، يا كَبيرُ، يا قَديرُ، يا خَبيرُ، يا مُجيرُ.
(70) يا حَيا قَبلَّ كُلِّ حَيٍّ، يا حَيا بَعدَ كُلِّ حَيٍّ، يا حَيُّ الَّذي لَيسَ كَمِثلِهِ حَيُّ، يا حَيُّ الَّذي لا يُشارِكُهُ حَيُّ، يا حَيُّ الَّذي لايَحتاجُ إلى حَيٍّ، يا حَيُّ الَّذي يُميتُ كُلَّ حَيٍّ، يا حَيُّ الَّذي يَرزُقُ كُلَّ حَيٍّ، يا حَيا لَم يَرِثِ الحياةَ مِن حَيٍّ، يا حَيُّ الَّذي يُحيي المَوتى، يا حَيُّ يا قَيّومُ لاتَأخُذُهُ سِنَةٌ وَلانَومٌ.
(71) يا مَن لَهُ ذِكرٌ لايُنسى، يا مَن لَهُ نورٌ لا يُطفى، يا مَن لَهُ نِعَمٌ لا تُعَدُّ، يا مَن لَهُ مُلكٌ لا يَزولُ، يا مَن لَهُ ثَناءٌ لا يُحصى، يا مَن لَهُ جَلالٌ لا يُكَيَّفُ، يا مَن لَهُ كَمالٌ لا يُدرَكُ، يا مَن لَهُ قَضاءٌ لا يُرَدُّ، يا مَن لَهُ صِفاتٌ لا تُبَدَّلُ، يا مَن لَهُ نُعوتٌ لا تُغَيَّرُ.
(72) يا رَبَّ العالَمينَ، يا مالِكَ يَومِ الدّينِ، يا غايَةَ الطَّالِبينَ، يا ظَهرَ اللّاجِينَ، يا مُدرِكَ الهارِبينَ، يا مَن يُحِبُّ الصَّابِرينَ، يا مَن يُحِبُّ التَّوَّابينَ، يا مَن يُحِبُّ المُتَطَهِّرينَ، يا مَن يُحِبُّ المُحسِنينَ، يا مَن هُوَ أعلَمُ بِالمُهتَدينَ.
(73) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا شَفيقُ، يا رَفيقُ، يا حَفيظُ ، يا مُحيطُ، يا مُقيتُ، يا مُغيثُ، يا مُعِزُّ، يا مُذِلُّ، يا مُبدئُ، يا مُعيدُ.
(74) يا مَن هُوَ أحَدٌ بِلا ضِدٍّ، يا مَن هُوَ فَردٌ بِلا نِدٍّ، يا مَن هُوَ صَمَدٌ بِلا عَيبٍ، يا مَن هُوَ وِترٌ بِلا كَيفٍ، يا مَن هُوَ قاضٍ بِلا حَيفٍ، يا مَن هُوَ رَبٌّ بِلا وَزيرٍ، يا مَن هُوَ عَزيزٌ بِلا ذُلٍّ، يا مَن هُوَ غَنيٌّ بِلا فَقرٍ، يا مَن هُوَ مَلِكٌ بِلا عَزلٍ، يا مَن هُوَ مَوصوفٌ بِلا شَبيهٍ.
(75) يا مَن ذِكرُهُ شَرَفٌ لِلذَّاكِرينَ، يا مَن شُكرُهُ فَوزٌ لِلشَّاكِرينَ، يا مَن حَمدُهُ عِزٌّ لِلحامِدينَ، يا مَن طاعَتُهُ نَجاةٌ لِلمُطيعينَ، يا مَن بابُهُ مَفتوحٌ لِلطَّالِبينَ، يا مَن سَبيلُهُ وَاضِحٌ لِلمُنيبينَ، يا مَن آياتُهُ بُرهانٌ لِلنَّاظِرينَ، يا مَن كِتابُهُ تَذكِرَةٌ لِلمُتَّقينَ، يا مَن رِزقُهُ عُموم لِلطَّائِعينَ وَالعاصينَ، يا مَن رَحمَتُهُ قَريبٌ مِنَ المُحسِنينَ.
(76) يا مَن تَبارَكَ اسمُهُ، يا مَن تَعالى جَدُّهُ، يا مَن لا إلهَ غَيرُهُ، يا مَن جَلَّ ثَناؤُهُ، يا مَن تَقَدَّسَت أسماؤُهُ، يا مَن يَدومُ بَقاؤُهُ، يا مَن العَظَمَةُ بَهاؤُهُ، يا مَن الكِبرياءُ رِداؤُهُ، يا مَن لا تُحصَى آلاؤُهُ، يا مَن لا تُعَدُّ نَعماؤُهُ.
(77) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُعينُ، يا أمينُ، يا مُبينُ، يا مَتينُ، يا مَكينُ، يا رَشيدُ، يا حَميدُ، يا مَجيدُ، يا شَديدُ، يا شَهيدُ.
(78) يا ذا العَرشِ المَجيدِ، يا ذا القَولِ السَّديدِ، يا ذا الفِعلِ الرَّشيدِ، يا ذا البَطشِ الشَّديدِ، يا ذا الوَعدِ وَالوَعيدِ، يا مَن هُوَ الوَليُّ الحَميدُ ، يا مَن هُوَ فَعَّالٌ لِما يُريدُ، يا مَن هُوَ قَريبٌ غَيرُ بَعيدٌ، يا مَن هُوَ عَلى كُلِّ شيء شَهيدٌ، يا مَن هُوَ لَيسَ بِظَلّامٍ لِلعَبيدِ.
(79) يا مَن لا شَريكَ لَهُ وَلا وَزيرَ، يا مَن لا شَبيهَ لَهُ وَلا نَظيرَ، يا خالِقَ الشَّمسِ وَالقَمَرِ المُنيرِ، يا مُغنيَ البائِسِ الفَقيرِ، يا رازِقَ الطِّفلِ الصَّغيرِ، يا راحِمَ الشَّيخِ الكَبيرِ، يا جابِرَ العَظمِ الكَسيرِ، يا عِصمَةَ الخائِفِ المُستَجيرِ، يا مَن هُوَ بِعِبادِهِ خَبيرٌ بَصيرٌ، يا مَن هُوَ عَلى كُلِّ شيء قَديرٌ.
(80) يا ذا الجودِ وَالنِّعَمِ، يا ذا الفَضلِ وَالكَرَمِ، يا خالِقَ اللَّوحِ وَالقَلَمِ، يا بارئَ الذَّرِّ وَالنَّسَمِ، يا ذا البَأسِ وَالنِّقَمِ، يا مُلهِمَ العَرَبِ وَالعَجَمِ، يا كاشِفَ الضُّرِّ وَالألَمِ، يا عالِمَ السِّرِّ وَالهِمَمِ، يا رَبَّ البَيتِ وَالحَرَمِ، يا مَن خَلَقَ الأشياءَ مِنَ العَدَمِ.
(81) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا فاعِلُ، يا جاعِلُ، يا قابِلُ، يا كامِلُ، يا فاصِلُ، يا واصِلُ، يا عادِلُ، يا غالِبُ، يا طالِبُ، يا واهِبُ.
(82) يا مَن أنعَمَ بِطَولِهِ، يا مَن أكرَمَ بِجودِهِ، يا مَن جادَ بِلُطفِهِ، يا مَن تَعَزَّزَ بِقُدرَتِهِ، يا مَن قَدَّرَ بِحِكمَتِهِ، يا مَن حَكَمَ بِتدبيرِهِ، يا مَن دَبَّرَ بِعِلمِهِ، يا مَن تَجاوَزَ بِحِلمِهِ، يا مَن دَنا في عُلوِّهِ، يا مَن عَلا في دُنوِّهِ.
(83) يا مَن يَخلُقُ ما يَشاءُ، يا مَن يَفعَلُ ما يَشاءُ، يا مَن يَهدي مَن يَشاءُ، يا مَن يُضِلُّ مَن يَشاءُ، يا مَن يُعَذِّبُ مَن يَشاءُ، يا مَن يَغفِرُ لِمَن يَشاءُ، يا مَن يُعِزُّ مَن يَشاءُ، يا مَن يُذِلُّ مَن يَشاءُ، يا مَن يُصَوِّرُ في الأرحامِ ما يَشاءُ، يا مَن يَختَصُّ بِرَحمَتِهِ مَن يَشاءُ.
(84) يا مَن لَم يَتَّخِذ صاحِبَةً وَلا وَلَداً، يا مَن جَعَلَ لكلّ شيء قَدراً، يا مَن لا يُشرِكُ في حُكمِهِ أحَداً، يا مَن جَعَلَ المَلائِكَةَ رُسُلاً، يا مَن جَعَلَ في السَّماءِ بُروجاً، يا مَن جَعَلَ الأرضَ قَراراً، يا مَن خَلَقَ مِنَ الماءِ بَشَراً، يا مَن جَعَلَ لكلّ شيء أمَداً، يا مَن أحاطَ بِكُلِّ شيء عِلماً، يا مَن أحصى كُلَّ شيء عَدَد.
(85) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا أوَّلُ، يا آخِرُ، يا ظاهِرُ، يا باطِنُ، يا بَرُّ، يا حَقُّ، يا فَردُ، يا وِترُ، يا صَمَدُ، يا سَرمَدُ.
(86) يا خَيرَ مَعروفٍ عُرِفَ، يا أفضَلَ مَعبودٍ عُبِدَ، يا أجَلَّ مَشكورٍ شُكِرَ، يا أعَزَّ مَذكورٍ ذُكِرَ، يا أعلى مَحمودٍ حُمِدَ، يا أقدَمَ مَوجودٍ طُلِبَ، يا أرفَعَ مَوصوفٍ وُصِفَ، يا أكبَرَ مَقصودٍ قُصِدَ، يا أكرَمَ مَسؤولٍ سُئِلَ، يا أشرَفَ مَحبوبٍ عُلِمَ.
(87) يا حَبيبَ الباكينَ، يا سَيِّدَ المُتَوَكِّلينَ، يا هاديَ المُضِلّينَ، يا وَليَّ المُؤمِنينَ، يا أنيسَ الذَّاكِرينَ، يا مَفزَعَ المَلهوفينَ، يا مُنجيَ الصَّادِقينَ، يا أقدَرَ القادِرينَ، يا أعلَمَ العالِمينَ، يا إلهَ الخَلقِ أجمَعينَ.
(88) يا مَن عَلا فَقَهَرَ، يا مَن مَلَكَ فَقَدَرَ، يا مَن بَطَنَ فَخَبَرَ، يا مَن عُبِدَ فَشَكَرَ، يا مَن عُصيَ فَغَفَرَ، يا مَن لا تَحويهِ الفِكَرُ، يا مَن لايُدرِكُهُ بَصَرٌ، يا مَن لايَخفى عَلَيهِ أثَرٌ، يا رازِقَ البَشَرِ، يا مُقَدِّرَ كُلِّ قَدَرٍ.
(89) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حافِظُ، يا ذارئُ، يا بارئُ، يا باذِخُ، يا فارِجُ، يا فاتِحُ، يا كاشِفُ، يا ضامِنُ، يا آمِرُ، يا ناهي.
(90) يا مَن لايَعلَمُ الغَيبَ إلاّ هوَ، يا مَن لا يَصرِفُ السّوءَ إلاّ هوَ، يا مَن لايَخلُقُ الخَلقَ إلاّ هوَ، يا مَن لايَغفِرُ الذَّنبَ إلاّ هوَ، يا مَن لايُتِمُّ النِّعمَةَ إلاّ هوَ، يا مَن لا يُقَلِّبُ القُلوبَ إلاّ هوَ، يا مَن لا يُدَبِّرُ الأمرَ الاّ هوَ، يا مَن لايُنَزِّلُ الغَيثَ إلاّ هوَ، يا مَن لايَبسُطُ الرِّزقَ إلاّ هوَ، يا مَن لايُحيِى المَوتى إلاّ هوَ.
(91) يا مُعينَ الضُّعَفاءِ، يا صاحِبَ الغُرَباءِ، يا ناصِرَ الأولياءِ، يا قاهِرَ الأعداءِ، يا رافِعَ السَّماءِ، يا أنيسَ الأصفياءِ، يا حَبيبَ الأتقياءِ، يا كَنزَ الفُقَراءِ، يا إلهَ الأغنياءِ، يا أكرَمَ الكُرَماءِ.
(92) يا كافياً مِن كُلِّ شيءٍ، يا قائِماً عَلى كُلِّ شيءٍ، يا مَن لا يَشبَهُهُ شيءٍ، يا مَن لايَزيدُ في مُلكِهِ شيءٍ، يا مَن لايَخفى عَلَيهِ شيءٍ، يا مَن لا يَنقُصُ مِن خَزائِنِهِ شيءٍ، يا مَن لَيسَ كَمِثلِهِ شيءٍ، يا مَن لايَعزُبُ عَن عِلمِهِ شيءٍ، يا مَن هُوَ خَبيرٌ بِكُلِّ شيءٍ، يا مَن وَسِعَت رَحمَتُهُ كُلَّ شيءٍ.
(93) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُكرِمُ، يا مُطعِمُ، يا مُنعِمُ، يا مُعطي، يا مُغني، يا مُقني، يا مُفني، يا مُحيي، يا مُرضي، يا مُنجي.
(94) يا أوَّلَ كُلِّ شيء وَآخِـرَهُ، يا إلهَ كُلِّ شيء وَمَليكَهُ، يا رَبَّ كُلِّ شيء وَصانِعَهُ، يا بارئَ كُلِّ شيء وَخالِقَهُ، يا قابِضَ كُلِّ شيء وَباسِطَهِ، يا مُبدئَ كُلِّ شيء وَمُعيدَهُ، يا مُنشئَ كُلِّ شيء وَمُقَدِّرَهُ، يا مُكَوِّنَ كُلِّ شيء وَمُحَوِّلَهُ، يا مُحيي كُلِّ شيء وَمُميتَهُ، يا خالِقَ كُلِّ شيء وَوارِثَهُ.
(95) يا خَيرَ ذاكِرٍ وَمَذكورٍ، يا خَيرَ شاكِرٍ وَمَشكورٍ، يا خَيرَ حامِدٍ وَمَحمودٍ، يا خَيرَ شاهِدٍ وَمَشهودٍ، يا خَيرَ داعٍ وَمَدعوٍّ، يا خَيرَ مُجيبٍ وَمُجابٍ، يا خَيرَ مُؤنِسٍ وَأنيسٍ، يا خَيرَ صاحِبٍ وَجَليسٍ، يا خَيرَ مَقصودٍ وَمَطلوبٍ، يا خَيرَ حَبيبٍ وَمَحبوبٍ.
(96) يا مَن هُوَ لِمَن دَعاهُ مُجيبٌ، يا مَن هُوَ لِمَن أطاعَهُ حَبيبٌ، يا مَن هُوَ إلى مَن أحَبَّهُ قَريبٌ، يا مَن هُوَ بِمَن استَحفَظَهُ رَقيبٌ، يا مَن هُوَ بِمَن رَجاهُ كَريمٌ، يا مَن هُوَ بِمَن عَصاهُ حَليمٌ، يا مَن هُوَ في عَظَمَتِهِ رَحيمٌ ، يا مَن هُوَ في حِكمَتِهِ عَظيمٌ، يا مَن هُوَ في إحسانِهِ قَديمٌ، يا مَن هُوَ بِمَن أرادَهُ عَليمٌ.
(97) اللهُمَّ إنّي اسألُكَ بِاسمِكَ، يا مُسَبِّبُ، يا مُرَغِّبُ، يا مُقَلِّبُ، يا مُعَقِّبُ، يا مُرَتِّبُ، يا مُخَوِّفُ، يا مُحَذِّرُ، يا مُذَكِّرُ، يا مُسَخِّرُ، يا مُغَيِّرُ.
(98) يا مَن عِلمُهُ سابِقٌ، يا مَن وَعدُهُ صادِقٌ، يا مَن لُطفُهُ ظاهِرٌ، يا مَن أمرُهُ غالِبٌ، يا مَن كِتابُهُ مُحكَمٌ، يا مَن قَضاؤُهُ كائِنٌ، يا مَن قَرآنُهُ مَجيدٌ، يا مَن مُلكُهُ قَديمٌ، يا مَن فَضلُهُ عَميمٌ، يا مَن عَرشُهُ عَظيم.
(99) يا مَن لايَشغَلُهُ سَمعٌ عَن سَمعٍ، يا مَن لايَمنَعُهُ فِعلٌ عَن فِعلٍ، يا مَن لا يُلهيهِ قَولٌ عَن قَولٍ، يا مَن لا يُغلِّطُهُ سُؤالٌ عَن سُؤالٍ، يا مَن لايَحجُبُهُ شيءٌ عَن شيءٍ، يا مَن لا يُبرِمُهُ إلحاحُ المُلِحّينَ، يا مَن هُوَ غايَةُ مُرادِ المُريدينَ، يا مَن هُوَ مُنتَهى هِمَمِ العارِفينَ، يا مَن هُوَ مُنتَهى طَلَبِ الطَّالِبينَ، يا مَن لا يَخفى عَلَيهِ ذَرَّةٌ في العالَمينَ.
(100) يا حَليماً لا يعجَلُ، يا جَواداً لا يَبخَلُ، يا صادِقاً لا يُخلِفُ، يا وَهَّاباً لا يَمَلُّ، يا قاهِراً لا يُغلَبُ، يا عَظيماً لا يوصَفُ، يا عَدلاً لا يَحيفُ، يا غَنيا لا يَفتَقِرُ، يا كَبيراً لا يَصغُرُ، يا حافِظاً لا يَغفَلُ سُبحانَكَ، يا لا إلهَ إلاّ أنتَ الغَوثَ الغَوثَ خَلِّصنا مِنَ النّارِ يا رَبِّ.  `,

translation:`اے اللہ`,

reference:`<b>📚 کتاب:</b> بلد الأمین<br><b>✍️ مصنف:</b> ابراہیم کفعمی<br><b>📖 اصل ماخذ:</b> دعائے جوشن کبیر`
}





,
{
id:11,

title:"دعائے جوشن صغیر",

english:"Dua-e-Jawshan Saghir",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
إلهي كَم مِن عَدوٍّ انتَضى عَلَيَّ سَيفَ عَداوَتِهِ، وَشَحَذَ لي ظُبَةَ مِديَتِهِ وَأرهَفَ لي شَبا حَدِّهِ، وَدافَ لي قَواتِلَ سُمومِهِ، وَسَدَّدَ إلَيَّ صَوائِبَ سِهامِهِ وَلَم تَنَم عَنّي عَينُ حِراسَتِهِ، وَأضمَرَ أن يَسومَني المَكروهَ، وَيُجَرِّعَني ذُعافَ مَرارَتِهِ، نَظَرتَ إلى ضَعفي عَن احتِمالِ الفَوادِحِ وعَجزي عَنِ الانتِصارِ مِمَّن قَصَدَني بِمُحارَبَتِهِ، وَوَحدَتي في كَثيرٍ مِمَّن ناواني وَأرصَدَ لي فيما لَم أعمِل فِكري في الارصادِ لَهُم بِمِثلِهِ فَأيَّدتَني بِقوَّتِكَ وَشَدَدتَ أزري بِنُصرَتِكَ وَفَلَلتَ لي حَدَّهُ، وَخَذَلتَهُ بَعدَ جَمعِ عَديدِهِ وَحَشدِهِ وَأعلَيتَ كَعبي عَلَيهِ، وَوَجَّهتَ ما سَدَّدَ إلَيَّ مِن مَكائِدِهِ إلَيهِ، وَرَدَدتَهُ عَلَيهِ، وَلَم يَشفِ غَليلَهُ، وَلَم تَبرُدُ حَزازاتُ غَيظِهِ، وَقَد عَضَّ عَلى أنامِلِهِ، وَأدبَرَ موَلياً قَد أخفَقَت سَراياهُ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لايُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن باغٍ بَغاني بِمَكائِدِهِ، وَنَصَبَ لي أشراكَ مَصائِدِهِ، وَوَكَّلَ بي تَفَقُّدَ رِعايَتِهِ، وَأضبأَ إلَيَّ إضباءَ السَّبُعِ لِطَريدَتِهِ، انتِظاراً لانتِهازِ فُرصَتِهِ، وَهُوَ يُظهِرُ بَشاشَةَ المَلَقِ، وَيُبسُطُ وَجهاً غَيرَ طَلِقٍ فَلَمّا رَأيتَ دَغَلَ سَريرَتِهِ، وَقُبحَ ما انطَوى عَلَيهِ لِشَريكِهِ في مِلَّتِهِ، وأصبَحَ مُجلِباً لي في بَغيِهِ أركَستَهُ لأُمِّ رَأسِهِ، وَأتَيتَ بُنيا نَهُ مِن أساسِهِ، فَصَرَعتَهُ في زُبيَتِهِ وَرَدَّيتَهُ في مَهوى حُفرَتِهِ، وَجَعَلتَ خَدَّهُ طَبَقاً لِتُرابِ رِجلِهِ، وَشَغَلتَهُ في بَدَنِهِ وَرِزقِهِ، وَرَمَيتَهُ بِحَجَرِهِ، وَخَنَقتَهُ بِوَتَرِهِ، وَذَكَّيتَهُ بِمَشاقِصِهِ، وَكَبَبتَهُ لِمَنخَرِهِ، وَرَدَدتَ كَيدَهُ في نَحرِهِ، وَرَبَقتَهُ بِنَدامَتِهِ، وَفَسأتَهُ بِحَسرَتِهِ فاستَخذَأ وَتَضاءَلَ بَعدَ نَخوَتِهِ وانقَمَعَ بَعدَ استِطالَتِهِ ذَليلاً مأسوراً في رِبقِ حِبالَتِهِ الَّتي كانَ يُؤَمِّلُ أن يَراني فيها يَومَ سَطوَتِهِ، وَقَد كِدتُ يا رَبِّ لَولا رَحمَتُكَ أن يَحُلَّ بي ماحَلَّ بِساحَتِهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لايُغلَبُ، وَذي أناةٍ لا يَعجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن حاسِدٍ شَرِقَ بِحَسرَتِهِ وَعَدوٍّ شَجيَ بِغَيظِهِ، وَسَلَقَني بِحَدِّ لِسانِهِ، وَوَخَزَني بِموقِ عَينِهِ، وَجَعَلَني غَرَضاً لِمَراميهِ وَقَلَّدَني خِلالاً لَم تَزَل فيهِ، نادَيتُكَ يا رَبِّ مُستَجيراً بِكَ، واثِقاً بِسُرعَةِ إجابَتِكَ مُتَوَكِّلاً عَلى مالَم أزَل أتَعَرَّفُهُ مِن حُسنِ دِفاعِكَ، عالِماً أنَّهُ لا يُضطَهَدُ مَن آوى إلى ظِلِّ كَنَفِكَ، وَلَن تَقرَعَ الحَوادِثُ مَن لَجَأ إلى مَعقِلِ الانتِصارِ بِكَ، فَحَصَّنتَني مِن بَأسِهِ بِقُدرَتِكَ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن سَحائِبِ مَكروهٍ جَلَّيتَها، وَسماءِ نِعمَةٍ مَطَرتَها ، وَجَداوِلَ كَرامَةٍ أجرَيتَها، وَأعيُنِ أحداثٍ طَمَستَها، وَناشِئَةِ رَحمَةٍ نَشَرتَها، وَجُنَّةِ عافيَةٍ ألبَستَها، وَغَوامِرِ كُرُباتٍ كَشَفتَها، وَأُمورٍ جاريَةٍ قَدَّرتَها، لَم تُعجِزكَ إذ طَلَبتَها، وَلَم تَمتَنِع مِنكَ إذ أرَدتَها، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن ظَنٍّ حَسَنٍ حَقَّقتَ، وَمِن كَسرِ إملاقٍ جَبَرتَ، وَمِن مَسكَنَةٍ فادِحَةٍ حَوَّلتَ، وَمن صَرعَةٍ مُهلِكَةٍ نَعَشتَ، وَمِن مَشَقَّةٍ أرَحتَ، لا تُسألُ عَمّا تَفعَلُ وَهُم يُسألونَ، وَلا يَنقُصُكَ ما أنفَقتَ، وَلَقَد سُئِلتَ فَأعطَيتَ، وَلَم تُسأل فَابتَدَأتَ، وَاستُميحَ بابُ فَضلِكَ فَما أكدَيتَ، أبَيتَ إلاّ إنعاماً وَامتِناناً، وَإلاّ تَطَوُّلاً يا رَبِّ وَإحساناً، وَأبَيتُ إلاّ انتِهاكاً لِحُرُماتِكَ، وَاجتِرَاءً عَلى مَعاصيكَ، وَتَعَدياً لِحُدودِكَ، وَغَفلَةً عَن وَعيدِكَ وَطاعَةً لِعَدوّي وَعَدوِّكَ، وَلَم يَمنَعكَ يا إلهي وَناصِري إخلالي بِالشُّكرِ عَن إتمامِ إحسانِكَ، وَلا حَجَزَني ذلِكَ عَن ارتِكابِ مَساخِطِكَ.
اللهُمَّ وَهذا مَقامُ عَبدٍ ذَليلٍ اعتَرَفَ لَكَ بِالتَّوحيدِ وَأقَرَّ عَلى نَفسِهِ بِالتَّقصيرِ في أداءِ حَقِّكَ وَشَهِدَ لَكَ بِسُبُوغِ نِعمَتِكَ عَلَيهِ، وَجَميلِ عادَتِكَ عِندَهُ، وَإحسانِكَ إلَيهِ، فَهَب لي يا إلهي وَسَيِّدي مِن فَضلِكَ ما اُريدُهُ إلى رَحمَتِكَ، وَأتَّخِذُهُ سُلَّماً أعرُجُ فيهِ إلى مَرضاتِكَ، وَآمَنُ بِهِ مِن سَخَطِكَ، بِعِزَّتِكَ وَطَولِكَ وَبِحَقِّ نَبيِّكَ مُحَمَّدٍ (صلّى الله عليه و آله) ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ في كَربِ المَوتِ، وَحَشرَجَةِ الصَّدرِ، وَالنَّظَرِ إلى ما تَقشَعِرُّ مِنهُ الجُلودُ، وَتَفزَعُ لَهُ القُلوبُ، وَأنا في عافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ سَقيماً موجِعاً في أنَّةٍ وَعَويلٍ يَتَقَلَّبُ في غَمِّهِ لا يَجِد مَحيصاً وَلا يُسيغُ طَعاماً وَلا شَراباً وَأنا في صِحَّةٍ مِنَ البَدَنِ وَسَلامَةٍ مِنَ العَيشِ كُلُّ ذلِكَ مِنكَ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ خائِفاً مَرعوباً مُشفِقاً وَجِلاً هارِباً طَريداً مُنجَحِراً في مَضيقٍ وَمَخبَأةٍ مِنَ المَخابئِ قَد ضاقَت عَلَيهِ الأرضُ بِرُحبِها، لا يَجِدُ حيلَةً وَلا مَنجى، وَلا مَأوى، وَأنا في أمنٍ وَطُمأنينَةٍ وَعافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَسَيِّدي وَكَم مِن عَبدٍ أمسى وَأصبَحَ مَغلولاً مُكَبَّلاً في الحَديدِ بَأيدي العُداةِ لا يَرحَمونَهُ، فَقيداً مِن أهلِهِ وَوَلَدِهِ مُنقَطِعاً عَن اخوانِهِ وَبَلَدِهِ يَتَوَقَّعُ كُلَّ ساعَةٍ بِأيِّ قَتلَةٍ يُقتَلُ وَبِأيِّ مُثلَةٍ يُمَثَّلُ بِهِ، وَأنا في عافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ يُقاسي الحَربَ وَمُباشَرَةَ القِتالِ بِنَفسِهِ قَد غَشيَتهُ الأعداءُ مِن كُلِّ جانِبٍ بِالسُّيوفِ وَالرِّماحِ وَآلَةِ الحَربِ، يَتَقَعقَعُ في الحَديدِ قَد بَلَغَ مَجهودَهُ لا يَعرِفُ حيلَةً، وَلا يَجِدُ مَهرَباً قَد أُدنِفَ بِالجِراحاتِ، أَوَ مُتَشَحِّطاً بِدَمِهِ تَحتَ السَّنابِكِ وَالأرجُلِ، يَتَمَنَّى شَربَةً مِن ماءٍ أو نَظرَةً إلى أهلِهِ وَوَلَدِهِ لا يَقدِرُ عَلَيها، وَأنا في عافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ في ظُلُماتِ البِحارِ وَعَواصِفِ الرياحِ وَالأهوالِ وَالأمواجِ، يَتَوَقَّعُ الغَرَقَ وَالهَلاكَ، لا يَقدِرُ عَلى حيلَةٍ، أو مُبتَلى بِصاعِقَةٍ أو هَدمٍ أو حَرقٍ أو شَرقٍ أو خَسفٍ أو مَسخٍ أو قَذفٍ، وَأنا في عافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَكَم مِن عَبدٍ أمسى وَأصبَحَ مُسافِراً شاخِصاً عَن أهلِهِ وَوَلَدِهِ، مُتَحَيِّراً في المَفاوِزِ، تائِهاً مَعَ الوُحوشِ وَالبَهائِمِ وَالهَوامِّ، وَحيداً فَريداً لايَعرِفُ حيلَةً وَلايَهتَدي سَبيلاً، أو مُتَأذّيا بِبَردٍ أو حَرِّ أو جوعٍ أو عُريٍ أو غَيرِهِ مِنَ الشَدائِدِ مِمَّا أنا مِنهُ خِلوٌ في عافيَةٍ مِن ذلِكَ كُلِّهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَسَيِّدي وَكَم مِن عَبدٍ أمسى وَأصبَحَ فَقيراً عائِلاً عارياً مُملِقاً مُخفِقاً مَهجوراً جائِعاً ظَمآنَاً، يَنتَظِرُ مَن يَعودُ عَلَيهِ بِفَضلٍ، أو عَبدٍ وَجيهٍ عِندَكَ هُوَ أوجَهُ مِنّي عِندَكَ وَأشَدُّ عِبادَةً لَكَ، مَغلولاً مَقهوراً قَد حَمَلَ ثِقلاً مِن تَعَبِ العَناءِ وَشِدَّةِ العُبوديَّةِ، وَكُلفَةِ الرِّقِّ، وَثِقلِ الضَّريبَةِ، أو مُبتَلىً بِبَلاءٍ شَديدٍ لا قِبَلَ لَهُ إلاّ بِمَنِّكَ عَلَيهِ وَأنا المَخدومُ المُنَعَّمُ المُعافى المُكَرَّمُ في عافيَةٍ مِمّا هُوَ فيهِ، فَلَكَ الحَمدُ يا رَبِّ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.
إلهي وَسَيّدي وَكَم مِن عَبدٍ أمسى وَأصبَحَ عَليلاً مَريضاً سَقيماً مُدنِفاً عَلى فُرُشِ العِلَّةِ وَفي لِباسِها يَتَقَلَّبُ يَميناً وَشِمالاً لا يَعرِفُ شَيئاً مِن لَذَّةِ الطَّعامِ وَلا مِن لَذَّةِ الشَّرابِ، يَنظُرُ إلى نَفسِهِ حَسرَةً لا يَستَطيعُ لَها ضَرّاً وَلا نَفعاً وَأنا خِلوٌ مِن ذلِكَ كُلِّهِ بِجودِكَ وَكَرَمِكَ فَلا إلهَ إلاّ أنتَ سُبحانَكَ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لَكَ مِنَ العابِدينَ، وَلِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ، وَارحَمني بِرَحمَتِكَ يا أرحَمَ الرَّاحِمينَ.
مَولايَ وَسَيِّدي وَكَم مِن عَبدٍ أمسى وَأصبَحَ وَقَد دَنا يَومُهُ مِن حَتفِهِ، وَأحدَقَ بِهِ مَلَكُ المَوتِ في أعوانِهِ يُعالِجُ سَكَراتِ المَوتِ وَحياضَهُ، تَدورُ عَيناهُ يَميناً وَشِمالاً يَنظُرُ إلى أحِبّائِهِ وَأوِدَّائِهِ وَأخِلّائِهِ قَد مُنِعَ مِنَ الكَلامِ، وَحُجِبَ عَنِ الخِطابِ، يَنظُرُ إلى نَفسِه حَسرَةً لا يَستَطيعُ لَها ضَرّاً وَلا نَفعاً وَأنا خِلوٌ مِن ذلِكَ كُلِّهِ بِجودِكَ وَكَرَمِكَ فَلا إلهَ إلاّ أنتَ سُبحانَكَ مِن مُقتَدِرٍ لا يُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ، وَارحَمني بِرَحمَتِكَ يا أرحَمَ الرَّاحِمينَ.
مَولايَ وَسَيِّدي وَكَم مِن عَبدٍ أمسى وَأصبَحَ في مَضائِقِ الحُبوسِ وَالسُّجونِ وَكُرَبِها وَذُلِّها وَحَديدِها يَتَداوَلُهُ أعوانُها وَزَبانيَتُها فَلا يَدري أيُّ حالٍ يُفعَلُ بِهِ، وَأيُّ مُثلَةٍ يُمَثَّلُ بِهِ، فَهُوَ في ضُرٍّ مِنَ العَيشِ وَضَنَكٍ مِنَ الحياةِ يَنظُرُ إلى نَفسِهِ حَسرَةً لا يَستَطيعُ لَها ضَرّاً وَلا نَفعاً، وَأنا خِلوٌ مِن ذلِكَ كُلِّهِ بِجودِكَ وَكَرَمِكَ فَلا إلهَ إلاّ أنتَ سُبحانَكَ مِن مُقتَدِرٍ لايُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لَكَ مِنَ العابِدينَ، وَلِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ، وَارحَمني بِرَحمَتِكَ يا أرحَمَ الرَّاحِمينَ.
سَيِّدي وَمَولايَ وَكَم مِن عَبدٍ أمسى وَأصبَحَ قَد استَمَرَّ عَلَيهِ القَضاءُ، وَأحدَقَ بِهِ البَلاء وَفارَقَ أوِدَّائهُ وَأحِبَّائهُ وَأخِلّائهُ، وَأمسى أسيراً حَقيراً ذَليلاً في أيدي الكُفّارِ وَالأعداءِ يَتَداوَلونَهُ يَميناً وَشِمالاً قَد حُصِرَ في المَطاميرِ، وَثُقِّلَ بِالحَديدِ، لا يَرى شَيئاً مِن ضياءِ الدُّنيا وَلا مِن رَوحِها، يَنظُرُ إلى نَفسِهِ حَسرَةً لايَستَطيعُ لَها ضَرّاً وَلا نَفعاً وَأنا خِلوٌ مِن ذلِكَ كُلِّهِ بِجودِكَ وَكَرَمِكَ فَلا إلهَ إلاّ أنتَ سُبحانَكَ مِن مُقتَدِرٍ لايُغلَبُ، وَذي أناةٍ لا يَعجَلُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لَكَ مِنَ العابِدينَ، وَلِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ، وَارحَمني بِرَحمَتِكَ يا أرحَمَ الرَّاحِمينَ.
وَعِزَّتِكَ يا كَريمُ لأطلُبَنَّ مِمّا لَدَيكَ، وَلأُلِحـَّنَّ عَلَيكَ، وَلأمُدَّنَ يَدَي نَحوَكَ مَعَ جُرمِها إلَيكَ يا رَبِّ فَبِمَن أعوذُ، وَبِمَن ألوذُ، لا أحَدَ لي إلاّ أنتَ، أفَتَرُدَّني وَأنتَ مُعَوَّلي وَعَلَيكَ مُتَّكَلي أسألُكَ بِاسمِكَ الَّذي وَضَعتَهُ عَلى السَّماء فاستَقَلَّت وَعَلى الأرضِ فَاستَقَرَّت، وَعَلى الجِبالِ فَرَسَت وَعَلى اللَيلِ فَأظلَمَ، وَعَلى النَّهارِ فَاستَنارَ، أن تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأن تَقضيَ لي حَوائِجي كُلَّها، وَتَغفِرَ لي ذُنوبي كُلَّها صَغيرَها وَكَبيرَها، وَتوَسِّعَ عَلَيَّ مِنَ الرِّزقِ ما تُبَلِّغُني بِهِ شَرَفَ الدُّنيا وَالآخرةِ يا أرحَمَ الرّاحِمينَ.
مَولايَ بِكَ استَعَنتُ فَصَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأعِنّي، وَبِكَ استَجَرتُ فَأجِرني، وَأغنِني بِطاعَتِكَ عَن طاعَةِ عِبادِكَ، وَبِمَسألَتِكَ عَن مَسألَةِ خَلقِكَ، وَانقُلني مِن ذُلِّ الفَقرِ إلى عِزِّ الغِنى، وَمِن ذُلِّ المَعاصي إلى عِزِّ الطَّاعَةِ فَقَد فَضَّلتَني عَلى كَثيرٍ مِن خَلقِكَ جوداً مِنكَ وَكَرَماً، لا بِاستِحقاقٍ مِنّي. إلهي فَلَكَ الحَمدُ عَلى ذلِكَ كُلِّهِ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجعَلني لِنَعمائِكَ مِنَ الشَّاكِرينَ، وَلآلائِكَ مِنَ الذَّاكِرينَ.

ثمّ اسجد وقل:
سَجَدَ وَجهي الذَّليلُ لِوَجهِكَ العَزيزِ الجَليلِ، سَجَدَ وَجهي البالي الفاني لِوَجهِكَ الدائِمِ الباقي، سَجَدَ وَجهي الفَقيرُ لِوَجهِكَ الغَنيِّ الكَبيرِ، سَجَدَ وَجهي وَسَمعي وَبَصَري وَلَحمي وَدَمي وَجِلدي وَعَظمي وَما أقَلَّتِ الأرضُ مِنّي للهِ رَبِّ العالَمينَ. اللهُمَّ عُد عَلى جَهلي بِحِلمِكَ، وَعَلى فَقري بِغِناكَ، وَعَلى ذُلّي بِعِزِّكَ وَسُلطانِكَ، وَعَلى ضَعفي بِقوَّتِكَ، وَعَلى خَوفي بِأمنِكَ وَعَلى ذُنوبي وَخَطايايَ بِعَفوِكَ وَرَحمَتِكَ يا رَحمنُ يا رَحيمُ. اللهُمَّ إنّي أدرَءُ بِكَ في نَحرِ فلان بن فلان، وَأعوذُ بِكَ مِن شَرِّهِ فَاكفِنيهِ بِما كَفَيتَ بِهِ أنبيائَكَ وَأوليائَكَ مِن خَلقِكَ وَصالِحي عِبادِكَ مِن فَراعِنَةِ خَلقِكَ، وَطُغاةِ عُداتِكَ، وَشَرِّ جَميعِ خَلقِكَ، بِرَحمَتِكَ يا أرحَمَ الرّاحِمينَ، إنَّكَ عَلى كُلِّ شيءٍ قَديرٌ، وَحَسبُنا الله وَنِعمَ الوَكيلُ.
  `,

translation:`اے رحمٰن`,

reference:`<b>📚 کتاب:</b> بلد الأمین<br><b>✍️ مصنف:</b> ابراہیم کفعمی<br><b>📖 اصل ماخذ:</b> دعائے جوشن صغیر`
}






,
{
id:12,

title:"دعائے سمات",

english:"Dua-e-Simat",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اللَّهُمَّ إنّي أسألُكَ باسمك العَظيمِ الأعظَمِ الأعَزِّ الأجَلِّ الأكرَمِ الَّذي إذا دُعيتَ بِهِ عَلى مَغالِقِ أبوابِ السَّماء لِلفَتحِ بِالرَّحمَةِ انفَتَحَت، وَإذا دُعيتَ بِهِ عَلى مَضائِقِ أبوابِ الأرضِ لِلفَرَجِ انفَرَجَت وَإذا دُعيتَ بِهِ عَلى العُسرِ لِليُسرِ تيَسَّرَت وَإذا دُعيتَ بِهِ عَلى الأمواتِ لِلنُّشورِ انتَشَرَت وَإذا دُعيتَ بِهِ عَلى كَشفِ البَأساءِ وَالضَّرَّاءِ انكَشَفَت.
وَبِجَلالِ وَجهِكَ الكَريمِ أكرَمِ الوُجوهِ وَأعَزِّ الوُجوهِ الَّذي عَنَت لَهُ الوُجوهِ وَخَضَعَت لَهُ الرِّقابُ، وَخَشَعَت لَهُ الأصواتِ وَوَجِلَت لَهُ القُلوبُ مِن مَخافَتِكَ. وَبِقوَّتِكَ الَّتي بِها تُمسِكُ السَّماء أن تَقَعَ عَلى الأرضِ إلاّ بِإذنِكَ، وَتُمسِكُ السَّماواتِ وَالأرضَ أن تَزولا، وَبِمَشيَّتِكَ الَّتي دانَ لَها العالَمونَ، وَبِكَلِمَتِكَ الَّتي خَلَقتَ بِها السَّماواتِ وَالأرضَ وَبِحِكمَتِكَ الَّتي صَنَعتَ بِها العَجائِبَ، وَخَلَقتَ بِها الظُّلمَةَ وَجَعَلتَها لَيلاً وَجَعَلتَ اللَّيلَ سَكَناً، وَخَلَقتَ بِها النّورَ وَجَعَلتَهُ نَهاراً، وَجَعَلتَ النَّهارَ نُشوراً مُبصِراً، وَخَلَقتَ بِها الشَّمسَ وَجَعَلتَ الشَّمسَ ضياءً، وَخَلَقتَ بِها القَمَرَ وَجَعَلتَ القَمَرَ نوراً، وَخَلَقتَ بِها الكَواكِبَ وَجَعَلتَها نُجوماً وَبُروجاً وَمَصابيحَ وَزينَةً وَرُجوماً، وَجَعَلتَ لَها مَشارِقَ وَمَغارِبَ، وَجَعَلتَ لَها مَطالِعَ وَمَجاري، وَجَعَلتَ لَها فَلكاً وَمَسابِحَ، وَقَدَّرتَها في السَّماء مَنازِلَ فَأحسَنتَ تَقديرَها، وَصَوَّرتَها فَأحسَنتَ تَصويرَها وَأحصَيتَها بِأسمائِكَ إحصاءً وَدَبَّرتَها بِحِكمَتِكَ تَدبيراً وَأحسَنتَ تَدبيرَها، وَسَخّرتَها بِسُلطانِ اللَّيلِ وَسُلطانِ النَّهارِ وَالسَّاعاتِ وَعَدَدِ السِّنينَ وَالحِسابِ وَجَعَلتَ رُؤيَتَها لِجَميعِ النّاسِ مَرءً وَاحِداً، وَأسألُكَ اللَّهُمَّ بِمَجدِكَ الَّذي كَلَّمتَ بِهِ عَبدَكَ وَرَسولَكَ موسى بنَ عِمرانَ (عليه السلام) في المُقَدَّسينَ فَوقَ إحساسِ الكَروبين فَوقَ غَمائِمِ النّورِ فَوقَ تابوتِ الشَّهادَةِ في عَمودِ النَّارِ وَفي طورِ سَيناء، وَفي جَبَلِ حوريثَ في الوادِ المُقَدَّسِ في البُقعَةِ المُبارَكَةِ مِن جانِبِ الطّورِ الأيمَنِ مِنَ الشَّجَرَةِ، وَفي أرضِ مِصرَ بِتِسعِ آياتٍ بَيِّناتٍ، وَيَومَ فَرَقتَ لِبَني إسرائيلَ البَحرَ وَفي المُنبَجِساتِ التي صَنَعتَ بِها العَجائِبَ في بَحرِ سُوفٍ، وَعَقَدتَ ماءَ البَحرِ في قَلبِ الغَمرِ كَالحِجارَةِ، وَجاوَزتَ بِبَني إسرائيلَ البَحرَ، وَتَمَّت كَلِمَتُكَ الحُسنى عَلَيهِم بِما صَبَروا وَأورَثتَهُم مَشارِقَ الأرضِ وَمَغارِبَها الَّتي بارَكتَ فيها لِلعالَمينَ وَأغرَقتَ فِرعَونَ وَجُنودَهُ وَمَراكِبَهُ في اليَمِّ.
وَبِاسمِكَ العَظيمِ الأعظَمِ الأعَزِّ الأجَلِّ الأكرَمِ، وَبِمَجدِكَ الَّذي تَجَلَّيتَ بِهِ لِموسى كَليمِكَ (عليه السلام) في طورِ سَيناءَ، وَلإبراهيمَ (عليه السلام) خَليلِكَ مِن قَبلُ في مَسجِدِ الخَيفِ، وَلإسحاقَ صَفيِّكَ (عليه السلام) في بِئرِ شِيَعٍ، وَليَعقوبَ نَبيِّكَ (عليه السلام) في بَيتِ إيلٍ وَأوفَيتَ لإبراهيمَ (عليه السلام) بِميثاقِكَ، وَلإسحاقَ بِحَلفِكَ، وَليَعقوبَ بِشَهادَتِكَ، وَلِلمُؤمِنينَ بِوَعدِكَ وَلِلدَّاعينَ بِأسمائِكَ فَأجَبتَ، وَبِمَجدِكَ الَّذي ظَهَرَ لِموسى بنِ عِمرانَ (عليه السلام) عَلى قُبَّةِ الرُّمّانِ وَبِآياتِكَ الَّتي وَقَعَت عَلى أرضِ مِصرَ بِمَجدِ العِزَّةِ وَالغَلَبَةِ بِآياتٍ عَزيزَةٍ وَبِسُلطانِ القوَّةِ، وَبِعِزَّةِ القُدرَةِ، وَبِشَأنِ الكَلِمَةِ التَّامَّةِ، وَبِكَلِماتِكَ الَّتي تَفَضَّلتَ بِها عَلى أهلِ السَّماواتِ وَالأرضِ، وَأهلِ الدُّنيا وَأهلِ الآخرةِ، وَبِرَحمَتِكَ الَّتي مَنَنتَ بِها عَلى جَميعِ خَلقِكَ، وَباستِطاعَتِكَ الَّتي أقَمتَ بِها عَلى العالَمينَ وَبِنورِكَ الَّذي قَد خَرَّ مِن فَزَعِهِ طورُ سَيناءَ وَبِعِلمِكَ وَجَلالِكَ وَكِبريائِكَ وَعِزَّتِكَ وَجَبَروتِكَ الَّتي لَم تَستَقِلَّها الأرض، وَانخَفَضَت لَها السَّماواتُ وَأنزَجَرَ لَها العُمقُ الأكبَرُ وَرَكَدَت لَها البِحارُ وَالأنهارُ، وَخَضَعَت لَها الجِبالُ وَسَكَنَت لَها الأرضُ بِمَناكِبِها وَاستَسلَمَت لَها الخَلائِقُ كُلُّها وَخَفَقَت لَها الرياحُ في جَريانِها وَخَمَدَت لَها النّيرانُ في أوطانِها وَبِسُلطانِكَ الَّذي عُرِفَت لَكَ بِهِ الغَلَبَةُ دَهرَ الدُّهورِ، وَحُمِدتَ بِهِ في السَّماواتِ وَالأرضِ وَبِكَلِمَتِكَ كَلِمَةِ الصِّدقِ الَّتي سَبَقَت لأبينا آدَمَ (عليه السلام) وَذُرّيَّتِهِ بِالرَّحمَةِ، وَأسألُكَ بِكَلِمَتِكَ الَّتي غَلَبَت كُلَّ شيءٍ، وَبِنورِ وَجهِكَ الَّذي تَجَلَّيتَ بِهِ لِلجَبَلِ فَجَعَلتَهُ دَكّاً وَخَرَّ موسى صَعِقاً، وَبِمَجدِكَ الَّذي ظَهَرَ عَلى طورِ سَيناءَ فَكَلَّمتَ بِهِ عَبدَكَ وَرَسولَكَ موسى بنَ عِمرانَ، وَبِطَلعَتِكَ في ساعيرَ، وَظُهورِكَ في جَبَلِ فارانَ، بِرَبَواتِ المُقَدَّسَينِ وَجُنودِ المَلائِكَةِ الصَّافّينَ، وَخُشوعِ المَلائِكَةِ المُسَبِّحينَ، وَبِبَرَكاتِكَ الَّتي بارَكتَ فيها عَلى إبراهيمَ خَليلِكَ (عليه السلام) في اُمَّةِ مُحَمَّدٍ (صلّى الله عليه و آله) ، وَبارَكتَ لإسحاقَ صَفيِّكَ في اُمَّةِ عيسى (عليهما السلام) ، وَبارَكتَ ليَعقوبَ إسرائيلِكَ في اُمَّةِ موسى (عليهما السلام) وَبارَكتَ لِحَبيبِكَ مُحَمَّدٍ (صلّى الله عليه و آله) في عِترَتِهِ وَذُرّيَّتِهِ وَاُمَّتِهِ. اللَّهُمَّ وَكَما غِبنا عَن ذلِكَ وَلَم نَشهَدهُ وَآمَنّا بِهِ وَلَم نَرَهُ صِدقاً وَعَدلاً أن تُصَلّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأن تُبارِكَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَتَرَحَّم عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَأفضَلِ ما صَلَّيتَ وَبارَكتَ وَتَرَحَّمتَ عَلى إبراهيمَ وَآلِ إبراهيمَ إنَّكَ حَميدٌ مَجيدٌ فَعّالٌ لِما تُريدُ وَأنتَ عَلى كُلِّ شيءٍ قَديرٌ.
ثمّ تذكر حاجتك وتقول: اللَّهُمَّ بِحَقِّ هذا الدُّعاءِ، وَبِحَقِّ هذِهِ الأسماءِ الَّتي لا يَعلَمُ تَفسيرَها وَلا يَعلَمُ باطِنَها غَيرُكَ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافعَل بي ما أنتَ أهلُهُ وَلا تَفعَل بي ما أنا أهلُهُ وَاغفِر لي مِن ذُنوبي ما تَقَدَّمَ مِنها وَما تَأخَّرَ وَوَسِّع عَلَيَّ مِن حَلالِ رِزقِكَ، وَاكفِني مَؤنَةَ إنسانِ سَوءٍ وَجارِ سَوءٍ وَقَرينِ سَوءٍ وَسُلطانِ سوءٍ، إنَّكَ عَلى ما تَشاءُ قَديرٌ وَبِكُلِّ شيءٍ عَليمٌ آمينَ رَبَّ العالَمينَ.
في بعض النسخ بعد: وَأنتَ عَلى كُلِّ شيءٍ قَديرٌ.
ثمّ اذكر حاجتك وقل: يا اللهُ يا حَنَّانُ يا مَنَّانُ يا بَديعَ السَّماواتِ وَالأرضِ يا ذا الجَلالِ وَالإكرامِ، يا أرحَمَ الرَّاحِمينَ، اللَّهُمَّ بِحَقِّ هذا الدِّعاءِ... الى آخر الدعاء.
وروى المجلسي عن مصباح السيد ابن باقي أنّه قال: قل بعد دعاء السمات: اللَّهُمَّ بِحَقِّ هذا الدُّعاءِ، وَبِحَقِّ هذِهِ الأسماءِ الَّتي لا يَعلَمُ تَفسيرَها وَلا تَأويلَها وَلا باطِنَها وَلا ظاهِرَها غَيرُكَ، أن تُصَلّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأن تَرزُقَني خَيرَ الدُّنيا وَالآخرةِ.
ثمّ اطلب حاجتك وقل: وَافعَل بي ما أنتَ أهلُهُ وَلا تَفعَل بي ما أنا أهلُهُ، وَانتَقِم لي مِن فلان بن فلانٍ، وسمّ عدوك، وَاغفِر لي مِن ذُنوبي ما تَقَدَّمَ مِنها وَما تَأخَّرَ، وَلِوالِدَيَّ وَلِجَميعِ المُؤمِنينَ وَالمُؤمِناتِ وَوَسِّع عَلَيَّ مِن حَلالِ رِزقِكَ وَاكفِني مَؤُنَةَ إنسانِ سَوءٍ، وَجارِ سَوءٍٍ، وَسُلطانِ سَوءٍٍ، وَقَرينِ سَوءٍٍ وَيَومِ سَوءٍٍ، وَساعَةِ سَوءٍ، وَانتَقِم لي مِمّن يَكيدُني ، وَمِمّن يَبغي عَلَيَّ وَيُريدُ بي وَبِأهلي وَأولادي وَإخواني وَجيراني وَقَراباتي مِنَ المُؤمِنينَ وَالمُؤمِناتِ ظُلماً إنَّكَ عَلى ما تَشاءُ قَديرٌ وَبِكُلِّ شيءٍ عَليم آمينَ رَبَّ العالَمينَ.
ثمّ قل: اللَّهُمَّ بِحَقِّ هذا الدُّعاءِ تَفَضَّل عَلى فُقَراءِ المُؤمِنينَ وَالمُؤمِناتِ بِالغِنى وَالثَّروَةِ وَعَلى مَرضى المُؤمِنينَ وَالمُؤمِناتِ بِالشِّفاءِ وَالصِّحَّةِ، وَعَلى أحياءِ المُؤمِنينَ وَالمؤمِناتِ بِاللُّطفِ وَالكَرامَةِ، وَعَلى أمواتِ المُؤمِنينَ وَالمُؤمِناتِ بِالمَغفِرَةِ وَالرَّحمَةِ، وَعَلى مُسافِري المُؤمِنينَ وَالمؤمِناتِ بِالرَّدِّ إلى أوطانِهِم سالِمينَ غانِمينَ بِرَحمَتِكَ يا أرحَمَ الرَّاحِمينَ وَصَلَّى اللهُ عَلى سَيِّدِنا مُحَمَّدٍ خاتَمِ النَّبيّينَ وَعِترَتِهِ الطَّاهِرينَ وَسَلَّمَ تَسليماً كَثيراً.
وقال الشيخ ابن فهد: يستحب أن تقول بعد دعاء السمات:
اللَّهُمَّ إنّي أسألُكَ بِحُرمَةِ هذا الدُّعاءِ وَبِما فاتَ مِنهُ مِن الأسماءِ وَبِما يَشتَمِلُ عَلَيهِ مِن التَّفسيرِ وَالتَّدبيرِ الَّذي لا يُحيطُ بِهِ إلاّ أنتَ أن تَفعَلَ بي كَذا وَكَذا. وتذكر حاجتك عوض كذا وكذا.    `,

translation:`اے صاحبِ جلال`,

reference:`<b>📚 کتاب:</b> مصباح المتهجد<br><b>✍️ مصنف:</b> شیخ الطوسی<br><b>📖 اصل ماخذ:</b> دعائے سمات`
}







,
{
id:13,

title:"دعائے یستشیر",

english:"Dua-e-Yastasheer",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
الحَمدُ للهِ الَّذي لا إلهَ إلاّ هُوَ المَلِكُ الحَقُّ المُبينُ، المُدَبِّرُ بِلا وَزيرٍ، وَلا خَلقٍ مِن عِبادِهِ يَستَشيرُ، الأوَّلُ غَيرُ مَوصوفٍ ، وَالباقي بَعدَ فَناءِ الخَلقِ، العَظيمُ الرُّبوبيَّةِ، نورُ السَّماواتُ وَالأرَضينَ وَفاطِرُهُما وَمُبتَدِعُهُما، بِغَيرِ عَمَدٍ خَلَقَهُما وَفَتَقَهُما فَتقاً، فَقامَتِ السَّماواتِ طائِعاتٍ بِأمرِهِ، وَاستَقَرَّتِ الأرَضونَ بِأوتادِها فَوقَ الماءِ، ثمّ عَلا رَبُّنا في السَّماواتِ العُلى، الرَّحمنُ عَلى العَرشِ استَوى، لَهُ ما في السَّماواتِ وَما في الأرضِ، وَما بَينَهُما وَما تَحتَ الثَّرى، فَأنا أشهَدُ بِأنَّكَ أنتَ الله لا رافِعَ لِما وَضَعتَ وَلا واضِعَ لِما رَفَعتَ، وَلا مُعِزَّ لِمَن أذلَلتَ، وَلا مُذِلَّ لِمَن أعزَزتَ، وَلا مانِعَ لِما أعطَيتَ، وَلا مُعطيَ لِما مَنَعتَ، وَأنتَ الله لا إلهَ إلاّ أنتَ كُنتَ إذ لَم تَكُن سماءٌ مَبنيَّةٌ، وَلا أرضٌ مَدحيَّةٌ، وَلا شَمسٌ مُضيئَةٌ، وَلا لَيلٌ مُظلِمٌ، وَلا نَهارٌ مُضيءٌ، وَلا بَحرٌ لُجّيُّ، وَلا جَبَلٌ راسٍ، وَلا نَجمٌ سارٍ، وَلا قَمَرٌ مُنيرٌ، وَلا ريحٌ تَهُبُّ، وَلا سَحابٌ يَسكُبُ، وَلا بَرقٌ يَلمَعُ، وَلا رَعدٌ يُسَبِّحُ، وَلا روحٌ تَنَفَّسُ، وَلا طائِرٌ يَطيرُ، وَلا نارٌ تَتَوَقَّدُ، وَلا ماءٌ يَطَّرِدُ، كُنتَ قَبلَ كُلِّ شيءٍ، وَكَوَّنتَ كُلَّ شيءٍ، وَقَدَرتَ عَلى كُلِّ شيءٍ، وَابتَدَعتَ كُلَّ شيءٍ وَأغنَيتَ وَأفقَرتَ، وَأمَتَّ وَأحيَيتَ وَأضحَكتَ وَأبكَيتَ وَعَلى العَرشِ استَوَيتَ فَتَبارَكتَ يا اللهُ وَتَعالَيتَ، أنتَ اللهُ الَّذي لا إلهَ إلاّ أنتَ الخَلّاقُ المُعينُ ، أمرُكَ غالِبٌ وَعِلمُكَ نافِذٌ، وَكَيدُكَ غَريبٌ وَوَعدُكَ صادِقٌ وَقَولُكَ حَقُّ وَحُكمُكَ عَدلٌ، وَكَلامُكَ هُدىً، وَوَحيُكَ نورٌ، وَرَحمَتُكَ وَاسِعَةٌ وَعَفوُكَ عَظيمٌ وَفَضلُكَ كَثيرٌ وَعَطاؤُكَ جَزيلٌ، وَحَبلُكَ مَتينٌ وإمكانُكَ عَتيدٌ وَجارُكَ عَزيزٌ وَبَأسُكَ شَديدٌ وَمَكرُكَ مَكيدٌ، أنتَ يا رَبِّ مَوضِعُ كُلِّ شَكوى حاضِرُ كُلِّ مَلأ وَشاهِدُ كُلِّ نَجوى، مُنتَهى كُلِّ حاجَةٍ، مُفَرِّجُ كُلِّ حُزنٍ ، غِنى كُلِّ مِسكينٍ، حِصنُ كُلِّ هارِبٍ أمانُ كُلِّ خائِفٍ، حِرزُ الضُّعَفاءِ، كَنزُ الفُقَراءِ، مُفَرِّجُ الغَمَّاءِ ، مُعينُ الصَّالِحينَ، ذلِكَ الله رَبُّنا لا إلهَ إلاّ هوَ، تَكفي مِن عِبادِكَ مَن تَوَكَّلَ عَلَيكَ، وأنتَ جارُ مَن لاذَ بِكَ وَتَضَرَّعَ إلَيكَ، عِصمَةُ مَنِ اعتَصَمَ بِكَ، ناصِرُ مَنِ انتَصَرَ بِكَ، تَغفِرُ الذُّنوبَ لِمَنِ استَغفَرَكَ، جَبّارُ الجَبابِرَةِ، عَظيمُ العُظَماءِ، كَبيرُ الكُبَراءِ، سَيِّدُ السَّاداتِ، مَولى المَوالي، صَريخُ المُستَصرِخينَ، مُنَفِّسٌ عَنِ المَكروبينَ، مُجيبُ دَعوَةِ المُضطَرّينَ، أسمَعُ السَّامِعينَ، أبصَرُ النَّاظِرينَ، أحكَمُ الحاكِمينَ، أسرَعُ الحاسِبينَ، أرحَمُ الرَّاحِمينَ، خَيرُ الغافِرينَ، قاضي حوائِجِ المُؤمِنينَ، مُغيثُ الصَّالِحينَ، أنتَ الله لا إلهَ إلاّ أنتَ رَبُّ العالَمينَ، أنتَ الخالِقُ وَأنا المَخلوقُ، وَأنتَ المالِكُ وَأنا المَملوكُ، وَأنتَ الرَّبُّ وَأنا العَبدُ، وَأنتَ الرَّازِقُ وَأنا المَرزوقُ، وَأنتَ المُعطي وَأنا السَّائِلُ، وَأنتَ الجَوادُ وَأنا البَخيلُ، وَأنتَ القَويُّ وَأنا الضَّعيفُ، وَأنتَ العَزيزُ وَأنا الذَّليلُ وَأنتَ الغَنيُّ وَأنا الفَقيرُ، وَأنتَ السَّيِّدُ وَأنا العَبدُ، وَأنتَ الغافِرُ وَأنا المُسيءُ، وأنتَ العالِمُ وَأنا الجاهِلُ، وَأنتَ الحَليمُ وَأنا العَجولُ، وَأنتَ الرَّحمنُ وَأنا المَرحومُ، وَأنتَ المُعافي وَأنا المُبتَلى، وَأنتَ المُجيبُ وَأنا المُضطَرُّ، وَأنا أشهَدُ بِأنَّكَ أنتَ الله لا إلهَ إلاّ أنتَ، المُعطي عِبادَكَ بِلا سُؤالٍ، وَأشهَدُ بِأنَّكَ أنتَ الله الواحِدُ الأحَدُ المُتَفَرِّدُ الصَّمّدُ الفَردُ وَإلَيكَ المَصيرُ، وَصََلّى اللهُ عَلى مُحَمَّدٍ وَأهلِ بَيتِهِ الطَّيِّبينَ الطَّاهِرينَ، وَاغفِر لي ذُنوبي، وَاستُر عَلَيَّ عُيوبي، وَافتَح لي مِن لَدُنكَ رَحمَةً وَرِزقاً وَاسِعاً يا أرحَمَ الرَّاحِمينَ، وَالحَمدُ للهِ رَبِّ العالَمينَ، وَحَسبُنا الله وَنِعمَ الوَكيلُ، وَلا حَولَ وَلا قوَّةَ إلاّ بِالله العَليِّ العَظيمِ.  `,

translation:`اے کریم`,

reference:`<b>📚 کتاب:</b> مہج الدعوات<br><b>✍️ مصنف:</b> سید ابن طاؤس<br><b>📖 اصل ماخذ:</b> دعائے یستشیر`
}





,
{
id:14,

title:"دعائے عدیلہ",

english:"Dua-e-Adilah",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
شَهِدَ اللهُ أَنَّهُ لا إِلهَ إِلاّ هُوَ وَالمَلائِكَةُ وَأُولُو العِلْمِ قائِماً بِالقِسْطِ لا إِلهَ إِلاّ هُوَ العَزِيزُ الحَكِيمُ إِنَّ الدِّينَ عِنْدَ اللهِ الإِسْلامِ وَأَنَا العَبْدُ الضَّعِيفُ المُذْنِبُ العاصي‌ المُحتاجُ الحَقِيرُ أَشْهَدُ لِمُنْعِمي‌ وَخالِقي‌ وَرازِقي‌ وَمُكْرِمي‌ كَما شَهِدَ لِذاتِهِ وَشَهِدَتْ لَهُ المَلائِكَةُ وَأُولُو العِلْمِ مِنْ عِبادِهِ بِأَنَّهُ لا إِلهَ إِلاّ هُوَ ذُو النِّعَمِ وَالإِحْسانِ وَالكَرَمِ وَالامْتِنانِ قادِرٌ أَزَلي‌ٌّ عالِمٌ أَبَدِي‌ٌّ حَي‌ٌّ أَحَدِي‌ٌّ مَوْجُودٌ سَرْمَدِي‌ٌّ سَمِيعٌ بَصِيرٌ مُرِيدٌ كارِهٌ مُدْرِكٌ صَمَدِي‌ٌّ يَسْتَحِقُّ هذِهِ الصِّفاتِ وَهُوَ عَلى ما هُوَ عَلَيْهِ في‌ عِزِّ صِفاتِهِ كانَ قَوِيّاً قَبْلَ وُجُودِ القُدْرَةِ وَالقُوَّةِ وَكانَ عَلِيماً قَبْلَ إِيجادِ العِلْمِ وَالعِلَّةِ لَمْ يزَلْ سُلْطاناً إِذْ لا مَمْلَكَةَ وَلا مالَ وَلَمْ يزَلْ سُبْحاناً عَلى جَمِيعِ الأَحْوالِ وُجُودُهُ قَبْلَ القَبْلِ في‌ أَزَلِ الآزالِ وبَقائُهُ بَعْدَ البَعْدِ مِنْ غَيْرِ انْتِقالٍ وَلا زَوالٍ غَنِي‌ٌّ في‌ الأَوَّلِ وَالآخِرِ مُسْتَغْنٍ في‌ الباطِنِ وَالظّاهِرِ لا جَوْرَ في‌ قَضِيتِهِ وَلا مَيْلَ في‌ مَشِيتِهِ وَلا ظُلْمَ في‌ تَقْدِيرِهِ وَلا مَهْرَبَ مِنْ حُكُومَتِهِ وَلا مَلْجَأَ مِنْ سَطَواتِهِ وَلا مَنْجا مِنْ نَقِماتِهِ سَبَقَتْ رَحْمَتُهُ غَضَبَهُ وَلا يَفُوتُهُ أَحَدٌ إِذا طَلَبَهُ أَزاحَ العِلَلَ في‌ التَّكْلِيفِ وَسَوّيَ التَّوْفِيقَ بيْنَ الضَّعِيفِ وَالشَّرِيفِ مَكَّنْ أَداءَ المَأْمُورِ وَسَهَّلَ سَبِيلَ اجْتِنابِ الَمحْظُورِ لَمْ يكَلِّفِ الطّاعَةَ إِلاّ دُونَ الوُسْعِ وَالطّاقَةِ سُبْحانَهُ ما أَبْيَنَ كَرَمَهُ وَأَعْلى شَأْنَهُ سُبْحانَهُ ما أَجَلَّ نَيْلَهُ وَأَعْظَمَ إِحْسانَهُ بعَثَ الأَنْبِياءَ لِيبيِّنَ عَدْلَهُ وَنَصَبَ الأَوْصِياءَ لِيُظْهِرَ طَوْلَهُ وَفَضْلَهُ وَجَعَلَنا مِنْ اُمَّةِ سَيدِ الأَنْبِياءِ وَخَيْرِ الأَوْلِياءِ وَأَفْضَلِ الأَصْفِياءِ وَأَعْليَ الأَزْكِياءِ مُحَمَّدٍ صَلّىَ اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ آمَنّا بِهِ وَبِما دَعانا إِلَيْهِ وَبِالقُرْآنِ الَّذِي‌ أَنْزَلَهُ عَلَيْهِ وَبِوَصِيهِ الَّذِي‌ نَصَبهُ يَوْمَ الغَدِيرِ وَأَشارَ بِقَوْلِهِ هذا عَلي‌ٌّ إِلَيهِ وَأَشْهَدُ أَنَّ الأَئِمَّةَ الأَبرارَ وَالخُلَفاءَ الأَخْيارَ بَعْدَ الرَّسُولِ المُخْتارِ عَلي‌ٌّ قامِعُ الكُفّارِ وَمِنْ بعْدِهِ سَيدُ أَوْلادِهِ الحَسَنُ بْنُ عَلَي‌ٍّ ثُمَّ أَخُوهُ السِّبْطُ التّابِعُ لِمَرْضاتِ اللهِ الحُسَيْنُ ثُمَّ العابِدُ عَلي‌ٌّ ثُمَّ الباقِرُ مُحَمَّدٌ ثُمَّ الصّادقُ جَعْفَرٌ ثُمَّ الكاظِمُ مُوسى ثُمَّ الرِّضا عَلي‌ٌّ ثُمَّ التَّقي‌ُّ مُحَمَّدٌ ثُمَّ النَّقي‌ُّ عَلي‌ٌّ ثُمَّ الزَّكي‌ُّ العَسْكَرِي‌ُّ الحَسَنُ ثُمَّ الحُجَّةُ الخَلَفُ القائِمُ المُنْتَظَرُ المَهْدِي‌ُّ المُرْجى الَّذِي‌ بِبَقائِهِ بَقِيَتِ الدُّنْيا وَبِيُمْنِهِ رُزِقَ الوَرى وَبِوُجُودِهِ ثَبتَتِ الأَرْضُ وَالسَّماءُ وَبِهِ يَمْلأَُ اللهُ الأَرْضَ قِسْطاً وَعَدْلاً بَعْدَما مُلِئَتْ ظُلْماً وَجَوْراً وَأَشْهَدُ أَنَّ أَقْوالَهُمْ حُجَّةٌ وَامْتِثالَهُمْ فَرِيضَةٌ وَطاعَتَهُمْ مَفْرُوضَةٌ وَمَوَدَّتَهُمْ لازِمَةٌ مَقْضِيةٌ وَالاقْتِداءَ بِهِمْ مُنْجِيةٌ وَمُخالَفَتَهُمْ مُرْدِيةٌ وَهُمْ ساداتُ أَهْلِ الجَنَّةِ أَجْمَعِينَ وَشُفَعاءُ يوْمِ الدِّينِ وَأَئِمَّةُ أَهْلِ الأَرْضِ عَليَ اليقِينِ وَأَفْضَلُ الأَوْصِياءِ المَرْضِيينَ وَأَشْهَدُ أَنَّ المَوْتَ حَقٌّ وَمُسائَلَةَ القَبْرِ حَقٌّ وَالبَعْثَ حَقٌّ وَالنُّشُورَ حَقٌّ وَالصِّراطَ حَقٌّ وَالمِيزانَ حَقٌّ وَالحِسابَ حَقٌّ وَالكِتابَ حَقٌّ وَالجَنَّةَ حَقٌّ وَالنّارَ حَقٌّ وَالسّاعَةَ آتِيَةٌ لا رَيْبَ فِيها وَإِنَّ اللهَ يبعَثُ مَنْ في‌ القُبورِ أَللّهُمَّ فَضْلُكَ رَجائي‌ وَكَرَمُكَ وَرَحْمَتُكَ أَمَلي‌ لا عَمَلَ لي‌ أَسْتَحِقُّ بِهِ الجَنَّةَ وَلا طاعَةَ لي‌ أَسْتَوْجِبَ بِهِ الرِّضْوانَ إِلاّ أَنِّي‌ اِعْتَقَدْتُ تَوْحِيدَكَ وَعَدْلَكَ وَارْتَجَيْتُ إِحْسانَكَ وَفَضْلَكَ وَتَشَفَّعْتُ إِلَيْكَ بِالنَّبِي‌ِّ وَآلِهِ مِنْ أَحِبَّتِكَ وَأَنْتَ أَكْرَمُ الأَكْرَمِينَ وَأَرْحَمُ الرّاحِمِينَ وَصَلّيَ اللهُ عَلى نَبِينا مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ الطَّيِّبِينَ الطّاهِرِينَ وَسَلَّمَ تَسْلِيماً كَثِيراً كَثِيراً وَلا حَوْلَ وَلا قُوَّةَ إِلاّ بِاللهِ العَلي‌ِّ العَظِيمِ اللّهُمَّ يا أَرْحَمُ الرّاحِمِينَ إِنِّي‌ أَوْدَعْتُكَ يَقِيني‌ هذا وَثَباتَ دِيني‌ وَأَنْتَ خَيْرُ مُسْتَوْدَعٍ وَقَدْ أَمَرْتَنا بِحِفْظِ الوَدائِعِ فَرُدَّهُ عَلَي‌َّ وَقْتَ حُضُورِ مَوْتي‌ بِرَحْمَتِكَ يا أَرْحَمُ الرّاحِمِينَ  `,

translation:`میں گواہی دیتا ہوں`,

reference:`<b>📚 کتاب:</b> مفاتیح الجنان<br><b>✍️ مصنف:</b> شیخ عباس قمی<br><b>📖 اصل ماخذ:</b> دعائے عدیلہ`
}




,
{
id:15,

title:"دعائے توبہ",

english:"Dua-e-Tawbah",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
أَللَّهُمَّ يَا مَنْ لا يَصِفُهُ نَعْتُ الْوَاصِفِينَ، وَيَا مَنْ لاَ يُجَاوِزُهُ رَجَاءُ الرَّاجِينَ، وَيَا مَنْ لاَ يَضِيعُ لَدَيْهِ أَجْرُ الْمُحْسِنِينَ، وَيَا مَنْ هُوَ مُنْتَهَى خَوْفِ الْعَابِدِيْنَ، وَيَا مَنْ هُوَ غَايَةُ خَشْيَةِ الْمُتَّقِينَ. هَذا مَقَامُ مَنْ تَدَاوَلَتْهُ أَيْدِي الذُّنُوبِ، وَقَادَتْهُ أَزِمَّةُ الْخَطَايَا، وَاسْتَحْوَذَ عَلَيْهِ الشَّيْطَانُ، فَقَصَّرَ عَمَّا أَمَرْتَ بِهِ تَفْرِيطَاً، وَتَعَاطى مَا نَهَيْتَ عَنْهُ تَعْزِيراً، كَالْجاهِلِ بِقُدْرَتِكَ عَلَيْهِ، أَوْ كَالْمُنْكِرِ فَضْلَ إحْسَانِكَ إلَيْهِ، حَتَّى إذَا انْفَتَحَ لَهُ بَصَرُ الْهُدَى، وَتَقَشَّعَتْ عَنْهُ سَحَائِبُ الْعَمَى أَحْصَى مَا ظَلَمَ بِهِ نَفْسَهُ، وَفَكَّرَ فِيمَا خَالَفَ بِهِ رَبَّهُ، فَرَأى كَبِيْرَ عِصْيَانِهِ كَبِيْراً، وَجَلِيل مُخالفَتِهِ جَلِيْلاً، فَأَقْبَلَ نَحْوَكَ مُؤَمِّلاً لَكَ، مُسْتَحْيِيَاً مِنْكَ، وَوَجَّهَ رَغْبَتَهُ إلَيْكَ ثِقَةً بِكَ، فَأَمَّكَ بِطَمَعِهِ يَقِيناً، وَقَصَدَكَ بِخَوْفِهِ إخْلاَصَاً، قَدْ خَلاَ طَمَعُهُ مِنْ كُلِّ مَطْمُوع فِيهِ غَيْرِكَ، وَأَفْرَخَ رَوْعُهُ مِنْ كُلِّ مَحْذُور مِنْهُ سِوَاكَ، فَمَثَّلَ بَيْنَ يَدَيْـكَ مُتَضَرِّعـاً، وَغَمَّضَ بَصَرَهُ إلَى الارْضِ مُتَخَشِّعَاً، وَطَأطَأَ رَأسَهُ لِعِزَّتِكَ مُتَذَلِّلاً، وَأَبَثَّكَ مِنْ سِرِّهِ مَا أَنْتَ أَعْلَمُ بِهِ مِنْهُ خَضُوعاً، وَعَدَّدَ مِنْ ذُنُوبِهِ مَا أَنْتَ أَحْصَى لَهَا خُشُوعاً وَاسْتَغَاثَ بِكَ مِنْ عَظِيمِ مَاوَقَعَ بِهِ فِي عِلْمِكَ وَقَبِيحِ مَا فَضَحَهُ فِي حُكْمِكَ مِنْ ذُنُوب أدْبَرَتْ لَذَّاتُهَا فَذَهَبَتْ، وَأَقَامَتْ تَبِعَاتُهَا فَلَزِمَتْ، لا يُنْكِرُ يَا إلهِي عَدْلَكَ إنْ عَاقَبْتَهُ، وَلا يَسْتَعْظِمُ عَفْوَكَ إنْ عَفَوْتَ عَنْهُ وَرَحِمْتَهُ؛ لاِنَّكَ الرَّبُّ الْكَرِيمُ الَّذِي لا يَتَعَاظَمُهُ غُفْرَانُ الذَّنْبِ الْعَظِيم. أَللَّهُمَّ فَهَا أَنَا ذَا قَدْ جئْتُكَ مُطِيعاً لاِمْرِكَ فِيمَا أَمَرْتَ بِهِ مِنَ الدُّعَاءِ، مَتَنَجِّزاً وَعْدَكَ فِيمَا وَعَدْتَ بِهِ مِنَ الاجَابَةِ إذْ تَقُولُ ﴿اُدْعُونِي أَسْتَجِبْ لَكُمْ﴾. أللَّهُمَّ فَصَلِّ عَلَى مُحَمَّد وَآلِهِ وَالْقَنِي بِمَغْفِـرَتِكَ كَمَا لَقِيتُكَ بِـإقْرَارِي وَارْفَعْنِي عَنْ مَصَارعِ الذُّنُوبِ كَمَا وَضَعْتُ لَكَ نَفْسِي وَاسْتُرْنِي بِسِتْرِكَ كَمَا تَأَنَّيْتَنِي عَنِ الانْتِقَامِ مِنِّي. أللَّهُمَّ وَثَبِّتْ فِي طَاعَتِكَ نِيَّتِيْ، وَأَحْكِمْ فِي عِبَادَتِكَ بَصِيـرَتِي، وَوَفِّقْنِي مِنَ الاَعْمَالِ لِمَا تَغْسِلُ بِهِ دَنَسَ الخَطَايَا عَنِّي، وَتَوَفَّنِي عَلَى مِلَّتِكَ وَمِلَّةِ نَبِيِّكَ مُحَمَّد عَلَيْهِ السَّـلامُ إذَا تَوَفَّيْتَنِي. أللَّهُمَّ إنِّي أَتُـوبُ إلَيْـكَ فِي مَقَامِي هَذَا مِنْ كَبَائِرِ ذُنُوبِي وَصَغَائِرِهَا وَبَوَاطِنِ سَيِّئآتِي وَظَوَاهِرِهَا، وَسَوالِفِ زَلاَّتِي وَحَوَادِثِهَا، تَوْبَةَ مَنْ لا يُحَدِّثُ نَفْسَهُ بِمَعْصِيَة، وَلاَ يُضْمِرُ أَنْ يَعُودَ فِي خَطِيئَة، وَقَدْ قُلْتَ يَا إلهِي فِي مُحْكَمِ كِتابِكَ إنَّكَ تَقْبَلُ التَّوْبَةَ عَنْ عِبَادِكَ، وَتَعْفُوعَنِ السَّيِّئآتِ، وَتُحِبُّ التَّوَّابِينَ، فَاقْبَلْ تَوْبَتِي كَمَا وَعَدْتَ وَأعْفُ عَنْ سَيِّئآتِي كَمَا ضَمِنْتَ، وَأَوْجِبْ لِي مَحَبَّتَكَ كَمَا شَـرَطْتَ، وَلَـكَ يَـا رَبِّ شَـرْطِي أَلاّ أَعُودَ فِي مَكْرُوهِكَ، وَضَمَانِي أَلاّ أَرْجِعَ فِي مَذْمُومِكَ، وَعَهْدِي أَنْ أَهْجُرَ جَمِيعَ مَعَاصِيكَ. أللَّهُمَّ إنَّكَ أَعْلَمُ بِمَا عَمِلْتُ فَاغْفِرْ لِي مَا عَلِمْتَ، وَاصْرِفْنِي بِقُدْرَتِكَ إلَى مَا أَحْبَبْتَ. أللَّهُمَّ وَعَلَيَّ تَبِعَاتٌ قَدْ حَفِظْتُهُنَّ، وَتَبِعَاتٌ قَدْ نَسيتُهُنَّ، وَكُلُّهُنَّ بِعَيْنِكَ الَّتِي لاَ تَنَـامُ، وَعِلْمِكَ الَّذِي لا يَنْسَى فَعَوِّضْ مِنْهَا أَهْلَهَا وَاحْطُطْ عَنّي وِزْرَهَا، وَخَفِّفْ عَنِّي ثِقْلَهَا، وَاعْصِمْنِي مِنْ أَنْ اُقَارِفَ مِثْلَهَا. أللَّهُمَّ وَإنَّهُ لاَ وَفَاءَ لِي بِالتَّوْبَةِ إلاَّ بِعِصْمَتِكَ، وَلا اسْتِمْسَاكَ بِي عَنِ الْخَطَايَا إلاَّ عَنْ قُوَّتِكَ، فَقَوِّنِي بِقُوَّة كَافِيَة، وَتَوَلَّنِي بِعِصْمَة مَانِعَة. أللَّهُمَّ أَيُّما عَبْد تَابَ إلَيْكَ وَهُوَ فِي عِلْمِ الْغَيْبِ عِنْدَكَ فَاسِخٌ لِتَوْبَتِهِ وَعَائِدٌ فِي ذَنْبِهِ وَخَطِيئَتِهِ فَإنِّي أَعُوذُ بِكَ أنْ أَكُوْنَ كَذلِكَ، فَاجْعَلْ تَوْبَتِي هَذِهِ تَوْبَةً لا أَحْتَاجُ بَعْدَهَا إلَى تَوْبَة، تَوْبَةً مُوجِبَةً لِمَحْوِ مَا سَلَفَ، وَالسَّلاَمَةِ فِيمَـا بَقِيَ. أللَّهُمَّ إنِّي أَعْتَـذِرُ إلَيْـكَ مِنْ جَهْلِي، وَأَسْتَـوْهِبُـكَ سُوْءَ فِعْلِي، فَـاضْمُمْنِي إلَى كَنَفِ رَحْمَتِكَ تَطَوُّلاً، وَاسْتُرْنِي بِسِتْرِ عَافِيَتِكَ تَفَضُّلاً. أللَّهُمَّ وَإنِّي أَتُوبُ إلَيْكَ مِنْ كُلِّ مَا خَالَفَ إرَادَتَكَ أَوْ زَالَ عَنْ مَحَبَّتِـكَ مِنْ خَـطَرَاتِ قَلْبِي وَلَحَـظَاتِ عَيْنِي وَحِكَايَاتِ لِسَانِي، تَوْبَةً تَسْلَمُ بِهَا كُلُّ جَارِحَة عَلَى حِيَالِهَا مِنْ تَبِعَاتِكَ، وَتَأْمَنُ مِمَّا يَخَافُ الْمُعْتَدُونَ مِنْ أَلِيْمِ سَطَوَاتِكَ. أَللَّهُمَّ فَارْحَمْ وَحْدَتِي بَيْنَ يَدَيْكَ، وَوَجِيبَ قَلْبِي مِنْ خَشْيَتِكَ، وَاضْطِرَابَ أَرْكَانِي مِنْ هَيْبَتِكَ، فَقَدْ أَقَامَتْنِي يَا رَبِّ ذُنُوبِي مَقَامَ الْخِزْيِ بِفِنَائِكَ، فَإنْ سَكَتُّ لَمْ يَنْطِقْ عَنِّي أَحَدٌ، وَإنْ شَفَعْتُ فَلَسْتُ بِأَهْلِ الشَّفَاعَةِ. أَللَّهُمَّ صَلِّ عَلَى مُحَمَّد وَآلِهِ وَشَفِّعْ فِي خَطَايَـايَ كَرَمَكَ، وَعُدْ عَلَى سَيِّئاتِي بِعَفْوِكَ، وَلاَ تَجْزِنِي جَزَآئِي مِنْ عُقُوبَتِكَ وَابْسُطْ عَلَيَّ طَوْلَكَ وَجَلِّلْنِي بِسِتْرِكَ، وَافْعَلْ بِي فِعْلَ عَزِيز تَضَرَّع إلَيْهِ عَبْدٌ ذَلِيلٌ فَرَحِمَهُ، أَوْ غَنِيٍّ تَعَرَّضَ لَهُ عَبْدٌ فَقِيرٌ فَنَعَشَهُ. أللَّهُمَّ لاَ خَفِيرَ لِي مِنْكَ فَلْيَخْفُرْنِيْ عِزُّكَ، وَلا شَفِيعَ لِيْ إلَيْكَ فَلْيَشْفَعْ لِي فَضْلُكَ، وَقَدْ أَوْجَلَتْنِي خَطَايَايَ فَلْيُؤْمِنِّي عَفْوُكَ، فَمَا كُلُّ مَا نَطَقْتُ بِهِ عَنْ جَهْل مِنِّي بِسُوْءِ أَثَرِي، وَلاَ نِسيَان لِمَا سَبَقَ مِنْ ذَمِيمِ فِعْلِي، وَلكِنْ لِتَسْمَعَ سَمَاؤُكَ وَمَنْ فِيْهَـا، وَأَرْضُكَ وَمَنْ عَلَيْهَا مَا أَظْهَرْتُ لَكَ مِنَ النَّدَمِ، وَلَجَـأتُ إلَيْكَ فِيـهِ مِنَ التَّوْبَـةِ، فَلَعَـلَّ بَعْضَهُمْ بِرَحْمَتِكَ يَرْحَمُنِي لِسُوءِ مَوْقِفِي، أَوْ تُدْرِكُهُ الرِّقَّةُ عَلَىَّ لِسُوءِ حَالِي فَيَنَالَنِي مِنْهُ بِدَعْوَة أَسْمَعُ لَدَيْكَ مِنْ دُعَائِي، أَوْ شَفَاعَـة أَوْكَدُ عِنْـدَكَ مِنْ شَفَاعَتِي تَكُونُ بِهَا نَجَاتِي مِنْ غَضَبِكَ وَفَوْزَتِي بِرضَاكَ. أللَّهُمَّ إنْ يَكُنِ النَّدَمُ تَوْبَةً إلَيْكَ فَأَنَا أَنْدَمُ اْلنَّادِمِينَ، وَإنْ يَكُنِ التَّرْكُ لِمَعْصِيَتِكَ إنَابَةً فَأَنَا أَوَّلُ الْمُنِيبينَ، وَإنْ يَكُنِ الاسْتِغْفَارُ حِطَّةً لِلذُّنُوبِ فَإنَي لَكَ مِنَ الْمُسْتَغْفِرِينَ. اللَّهُمَّ فَكَمَا أَمَرْتَ بِالتَّوْبَةِ وَضَمِنْتَ الْقَبُولَ وَحَثَثْتَ عَلَى الدُّعَـآءِ وَوَعَدْتَ الاجَابَةَ، فَصَلِّ عَلَى مُحَمَّدِ وَآلِهِ وَاقْبَلْ تَوْبَتِي وَلاَ تَرْجِعْني مَرجَعَ الغَيبَةِ منْ رَحْمَتِك إنَّكَ أَنْتَ التَّوَّابُ عَلَى الْمُذْنِبِينَ، وَالرَّحِيمُ لِلْخَاطِئِينَ الْمُنِيبِينَ. أللَّهُمَّ صَلِّ عَلَى مُحَمَّد وَآلِهِ كَمَا هَدَيْتَنَا بِهِ وَصَلِّ عَلَى مُحَمَّد وَآلِهِ كَمَا اسْتَنْقَذْتَنَا بِهِ، وَصَلِّ عَلَى مُحَمَّد وَآلِهِ صَلاَةً تَشْفَعُ لَنَا يَوْمَ الْقِيَامَةِ وَيَوْمَ الْفَاقَةِ إلَيْكَ، إنَّكَ عَلَى كُلِّ شَيْء قَدِيرٌ وَهُوَ عَلَيْكَ يَسِيرٌ.  `,

translation:`میں اللہ سے بخشش چاہتا ہوں`,

reference:`<b>📚 کتاب:</b> الصحیفۃ السجادیہ<br><b>✍️ مصنف:</b> امام زین العابدین علیہ السلام<br><b>📖 اصل ماخذ:</b> دعاء التوبة`
}





,
{
id:16,

title:"دعائے مکارم الاخلاق",

english:"Dua-e-Makarim-ul-Akhlaq",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَبلِّغْ بِإِيماني‌ أَكْمَلَ الإِيمانِ وَاجْعَلْ يَقِيني‌ أَفْضَلَ اليَقِينِ وَانْتَهِ بِنِيَّتي‌ إِلى أَحْسَنِ النِّيّاتِ وَبِعَمَلي‌ إِلى أَحْسَنِ الأَعْمالِ اللّهُمَّ وَفِّرْ بِلُطْفِكَ نِيتي‌ وَصَحِّحْ بِما عِنْدَكَ يقِيني‌ وَاسْتَصْلِحْ بِقُدْرَتِكَ ما فَسَدَ مِنّي‌ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَاكْفِني‌ ما يشْغَلُني‌ الاهْتِمامُ بِهِ وَاسْتَعْمِلْني‌ بِما تَسْئَلُني‌ غَداً عَنْهُ وَاسْتَفْرِغْ أَيّامي‌ فِيما خَلَقَتَني‌ لَهُ وَأَغْنِني‌ وَأَوسِعْ عَلَي‌َّ في‌ رِزْقِكَ وَلا تَفْتِنِّي‌ بِالنَّظَرِ وَأَعِزَّني‌ وَلا تَبْتَليَنِّي‌ بِالكِبْرِ وَعَبِّدْني‌ لَكَ وَلا تُفْسِدْ عِبادَتي‌ بِالعُجْبِ وَأَجْرِ لِلنّاسِ عَلى يدِي‌َ الخَيْرَ وَلا تَمحَقهُ بِالمَنِّ وَهَبْ لي‌ مَعالي‌َ الأَخلاقِ وَاعْصِمْني‌ مِنَ الفَخْرِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَلا تَرفَعْني‌ في‌ النّاسِ دَرَجَةً إِلاّ حَطَطْتَني‌ عِندَ نَفْسي‌ مِثْلَها وَلا تُحْدِث‌ لي‌ عِزّاً ظاهِراً إِلاّ أَحْدَثْتَ لي‌ ذِلَّةً باطِنَةً عِنْدَ نَفْسِي‌ بِقَدَرِها اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمَتِّعْني‌ بِهُديً صالِحٍ لا أَسْتَبْدِلُ بِهِ وَطَرِيقَةِ حَقٍّ لا أَزِيغُ عَنْها وَنِيَّةِ رُشْدٍ لا أَشُكُّ فِيها وَعَمِّرْني‌ ما كان‌ عُمْرِي‌ بِذْلَةً في‌ طاعَتِكَ فَإِذا كانَ عُمْرِي‌ مَرْتَعاً لِلشَّيطانِ فَاقْبِضْني‌ إِلَيكَ قَبلَ أَنْ يسْبِقَ مَقْتُكَ إِلَي‌َّ أَو يَسْتَحْكِمَ غَضَبكَ عَلَي‌َّ اللّهُمَّ لا تَدَعْ خَصْلَةً تُعابُ مِنِّي‌ إِلاّ أَصْلَحْتَها وَلا عائِبةً أُوَنَّبُ بِها إِلاّ حَسَّنْتَها وَلا أُكْرُومَةً فِي‌َّ ناقِصَةً إِلاّ أَتْمَمْتَها اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَبدِلْني‌ مِن‌ بِغْضَةِ أَهْلِ الشَّنَآنِ الَمحَبةَ وَمِنْ حَسَدِ أَهلِ البغْي‌ المَوَدَّةَ وَمِنْ ظِنَّةِ أَهلِ الصَّلاحِ الثِّقَةَ وَمِنْ عَداوَةِ الأَدْنَيْنَ الوَلايةَ وَمِنْ عُقُوقِ ذَوِي‌ الأَرْحامِ المَبَرَّةَ وَمِنْ خِذْلانِ الأَقْرَبِينَ النُّصْرَةَ وَمِنْ حُبِّ المُدارِينَ تَصْحِيحَ المِقَةِ وَمِنْ رَدِّ المُلابِسِينَ كَرَمِ العِشْرَةِ وَمِنْ مَرارَةِ خَوْفِ الظّالِمِينَ حَلاوَةِ الأَمَنَةِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَاجْعَلْ لي‌ يداً عَلى مَنْ ظَلَمَني‌ وَلِساناً عَلى مَنْ خاصَمَني‌ وَظَفَراً بِمَنْ عانَدَني‌ وَهَبْ لي‌ مَكْراً عَلى مَنْ كايدَني‌ وَقُدْرَةً عَلى مَنْ اضْطَهَدَني‌ وَتَكْذِيباً لِمَنْ قَصَبَني‌ وَسَلامَةً مِمَّنْ تَوَعَّدَني‌ وَوَفِّقْني‌ لِطاعَةِ مَنْ سَدَّدَني‌ ومُتابَعَةِ مَنْ أَرْشَدَني‌ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَسَدِّدْني‌ لأَنْ‌ أُعارِضَ مَنْ غَشَّني‌ بِالنُّصْحِ وَأَجْزِي‌َ مَنْ هَجَرَني‌ بِالبَرِّ وَأُثِيبَ مَنْ حَرَمَني‌ بِالبذْلِ وَأُكافي‌َ مَنْ قَطَعَني‌ بِالصِّلَةِ وَأُخالِفَ مَنْ اغْتابني‌ إِلى حُسْنِ الذِّكْرِ وَأَنْ أَشْكُرَ الحَسَنَةَ وَأُغْضِي‌َ عَنِ السَّيئَةِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَحَلِّني‌ بِحِلْيةِ الصّالِحِينَ وَأَلْبِسْني‌ زِينَةَ المُتَّقِينَ في‌ بَسْطِ العَدْلِ وَكَظْمِ الغَيظِ وَإِطْفاءِ النّائِرَةِ وَضَمِّ أَهْلِ الفُرْقَةِ وَإِصْلاحِ ذاتِ البيْنِ وَإِفْشاءِ العارِفَةِ وَسَتْرِ العائِبَةِ وَلِينِ العَرِيكَةِ وَخَفْضِ الجَناحِ وَحُسْنِ السِّيرَةِ وَسُكُونِ الرِّيحِ وَطِيبِ المُخالَقَةِ وَالسَّبْقِ إِلىَ الفَضِيلَةِ وَإِيثارِ التَّفَضُّلِ وَتَركِ التَّعْيِيرِ وَالأَفْضالِ عَلى غَيْرِ المُسْتَحِقِّ وَالقَوْلِ بِالحَقِّ وَإِن‌ عَزَّ وَاسْتِقْلالِ الخَيْرِ وَإِنْ كَثُرَ مِنْ قَوْلي‌ وَفِعْلي‌ وَاسْتِكْثارَ الشَّرِّ وَإِنْ قَلَّ مِنْ قَوْلي‌ وَفِعْلي‌ وَأَكْمِلْ ذلِكَ لي‌ بِدَوامِ الطّاعَةِ وَلُزُومِ الجَماعَةِ وَرَفْضِ أَهلِ البِدَعِ وَمُسْتَعْمِلي‌ الرَّأْي‌ الُمخْتَرَعِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَاجْعَلْ أَوْسَعَ رَزْقِكَ عَلَي‌َّ إِذا كَبَرْتُ وَأَقْوى قُوَّتِكَ فِي‌َّ إِذا نَصَبتُ وَلا تَبْتَلينِّي‌ بِالكَسَلِ عَنْ عِبادَتِكَ وَلا العَمى عَنْ سَبِيلِكَ وَلا بِالتَّعَرُّضِ لِخِلافِ مَحَبَّتِكَ وَلا مُجامَعَةِ مَنْ تَفَرَّقَ عَنْكَ وَلا مُفارَقَةِ مَنِ اجْتَمَعَ إِلَيْكَ اللّهُمَّ اجْعَلْني‌ أَصُولُ بِكَ عِنْدَ الضَّرُورَةِ وَأَسْأَلُكَ عِنْدَ الحاجَةِ وَأَتَضَرَّعُ إِلَيْكَ عِنْدَ المَسْكَنَةِ وَلا تَفْتِنِّي‌ بِالاسْتِعانَةِ بِغَيْرِكَ إِذا اضْطُرِرْتُ وَلا بِالخُضُوعِ لِسُؤالِ غَيْرِكَ إِذا افْتَقَرْتُ وَلا بِالتَّضَرُّعِ إِلى مَنْ دُونَكَ إِذا رَهِبْتُ فَأَسْتَحِقَّ بِذلِكَ خِذْلانَكَ وَمَنْعَكَ وَإِعْراضَكَ يا أَرْحَمَ الرّاحِمِينَ اللّهُمَّ اجْعَلْ ما يُلْقي‌ الشَّيْطانُ في‌ رَوْعِي‌ مِنَ الَّتمَنِّي‌ وَالتَّظَنِّي‌ وَالحَسَدِ ذِكْراً لِعَظَمَتِكَ وَتَفَكُّراً في‌ قُدْرَتِكَ وَتَدْبِيراً عَلى عَدُوِّكَ وَما أَجْرَى عَلَى لِساني‌ مِنْ لَفْظَةِ فُحْشٍ أَو هُجْرٍ أَو شَتْمِ عِرْضٍ أَو شَهادَةِ باطِلٍ أَوِ اغْتِيابِ مُؤْمِنٍ غائِبٍ أَو سَبِّ حاضِرٍ وَما أَشْبَهَ ذلِكَ نُطْقاً بِالحَمْدِ لَكَ وَإِغْراقاً في‌ الثَّناءِ عَلَيْكَ وَذَهاباً في‌ تَمْجِيدِكَ وَشُكْراً لِنِعْمَتِكَ وَاعْتِرافاً بِإِحْسانِكَ وَإِحْصاءً لِمِنَنِكَ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَلا أُظْلَمَنَّ وَأَنْتَ مُطِيقٌ لِلدَّفْعِ عَنِّي‌ وَلا أَظْلِمَنَّ وَأَنْتَ القادِرُ عَلىَ القَبْضِ مِنِّي‌ وَلا أَضِلَّنَّ وَقَدْ أَمْكَنَتْكَ هِدايتي‌ وَلا أَفْتَقِرَنَّ وَمِنْ عِنْدِكَ وُسْعي‌ وَلا أَطْغَيَنَّ وَمِنْ عِنْدِكَ وُجْدِي‌ اللّهُمَّ إِلى مَغْفِرَتِكَ وَفَدْتُ وَإِلى عَفْوِكَ قَصَدْتُ وَإِلى تَجاوُزِكَ اشْتَقْتُ وَبِفَضْلِكَ وَثِقْتُ وَلَيسَ عِنْدِي‌ ما يُوجِبُ لي‌ مَغْفِرَتَكَ وَلا في‌ عَمَلي‌ ما أَسْتَحِقُّ بِهِ عَفْوَكَ وَمالي‌ بعْدَ أَنْ حَكَمْتُ عَلى نَفْسي‌ إِلاّ فَضْلُكَ فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَتَفَضَّلْ عَلَي‌َّ اللّهُمَّ وَأَنْطِقْني‌ بِالهُدى وَأَلْهِمْني‌ التَّقْوى وَوَفِقْني‌ لِلَّتي‌ هي‌َ أَزْكى وَاسْتَعْمِلني‌ بِما هُوَ أَرْضى اللّهُمَّ اسْلُكْ بي‌َ الطَّرِيقَةَ المُثْلى وَاجْعَلْني‌ عَلى مِلَّتِكَ أَمُوتُ وَأَحْيى اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَمَتِّعْني‌ بِالاقْتِصادِ وَاجْعَلْني‌ مِنْ أَهْلِ السَّدادِ وَمِنْ أَدِلَّةِ الرَّشادِ وَمِنْ صالِحي‌ العِبادِ وَارْزُقْني‌ فَوْزَ المَعادِ وَسَلامَةَ المِرْصادِ اللّهُمَّ خُذْ لِنَفْسِكَ مِنْ نَفْسي‌ ما يُخَلِّصُها وَأَبقِ لِنَفْسي‌ مِنْ نَفْسي‌ ما يُصلِحُها فَإِنَّ نَفْسي‌ هالِكَةٌ أَو تَعْصِمَها اللّهُمَّ أَنْتَ عُدَّتي‌ إِنْ حَزِنْتُ وَأَنْتَ مُنْتَجَعي‌ إِنْ حُرِمْتُ وَبِكَ اسْتِغاثَتي‌ إِنْ كَرِثْتُ وَعِنْدَكَ مِمّا فاتَ خَلَفٌ وَلِما فَسَدَ صَلاحٌ وَفِيما أَنْكَرْتَ تَغْيِيرٌ فَامْنُنْ عَلَي‌َّ قَبْلَ البَلاءِ بِالعافِيةِ وَقَبْلَ الطَّلَبِ بِالجِدَةِ وَقَبْلَ الضَّلالِ بِالرَّشادِ وَاكْفِني‌ مَؤُنَةَ مَعَرَّةِ العِبادِ وَهَبْ لي‌ أَمْنَ يَوْمِ المَعادِ وَامْنَحْني‌ حُسْنِ الإِرْشادِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَادْرَأْ عَنِّي‌ بِلُطْفِكَ وَاغْذُني‌ بِنِعْمَتِكَ وَأَصْلِحْني‌ بِكَرَمِكَ وَداوِني‌ بِصُنْعِكَ وَأَظِلَّني‌ في‌ ذَراكَ وَجَلِّلْني‌ رِضاكَ وَوَفِّقْني‌ إِذا اشْتَكَلَتْ عَلَي‌َّ الأُمُورُ لأَهْداها وَإِذا تَشابَهَتِ الأَعْمالُ لأَزْكاها وَإِذا تَناقَضَتِ المِلَلُ لأَرْضاها اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَتَوِّجْني‌ بِالكِفايةِ وَسُمْني‌ حُسْنَ الوِلايةِ وَهَبْ لي‌ صِدْقَ الهِدايةِ وَلا تَفْتِنِّي‌ بِالسِّعَةِ وَامْنَحْني‌ حُسْنَ الدَّعَةِ وَلا تَجْعَلْ عَيْشي‌ كَدّاً كَدّاً وَلا تَرُدَّ دُعائي‌ عَلَي‌َّ ردّاً فَإِنِّي‌ لا أَجْعَلُ لَكَ ضِدّاً وَلا أَدعُو مَعَكَ نِدّاً اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَامْنَعْني‌ مِنَ السَّرَفِ وَحَصِّنْ رِزْقي‌ مِنَ التَّلَفِ وَوَفِّرْ مَلَكَتي‌ بِالبَرَكَةِ فِيهِ وَأَصِبْ بي‌ سَبِيلَ الهِدايةِ لِلبِرِّ فِيما أُنْفِقُ مِنْهُ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَاكْفِني‌ مَؤُنَةِ الاكْتِسابِ وَارْزُقْني‌ مِنْ غَيْرِ احْتِسابِ فَلا أَشْتَغِلَ عَنْ عِبادَتِكَ بِالطَّلَبِ وَلا أَحْتَمِلَ إِصْرَ تَبِعاتَ المَكْسَبِ اللّهُمَّ فَاطْلِبني‌ بِقُدْرَتِكَ ما أَطْلُبُ وَأَجِرْني‌ بِعِزَّتِكَ مِمّا أَرْهَبُ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَصُنْ وَجْهي‌ بِاليسارِ وَلا تَبتَذِل‌ جاهي‌ بِالإِقْتارِ فَأَسْتَرْزِقَ أَهْلَ رِزْقِكَ وَأَسْتَعْطِي‌َ شِرارَ خَلْقِكَ فَأَفْتَتِنَ بِحَمْدِ مَنْ أَعْطاني‌ وَأُبْتَلى بِذَمِّ مَنْ مَنَعَني‌ وَأَنْتَ مِنْ دُونِهِم‌ وَلي‌ُّ الإِعْطاءِ وَالمَنْعِ أَللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَارْزُقْني‌ صِحَّةً في‌ عِبادَةٍ وَفَراغاً في‌ زَهادَةٍ وَعِلْماً في‌ اسْتِعْمالٍ وَوَرَعاً في‌ إِجْمالٍ اللّهُمَّ اخْتِمْ بِعَفْوِكَ أَجَلي‌ وَحَقِّقْ في‌ رَجاءِ رَحْمَتِكَ أَمَلي‌ وَسَهِّلْ إِلى بلُوغِ رِضاكَ سُبُلي‌ وَحَسِّنْ في‌ جَمِيعِ أَحْوالي‌ عَمَلي‌ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَنَبهْني‌ لِذِكْرِكَ في‌ أَوْقاتِ الغَفْلَةِ وَاسْتَعْمِلْني‌ بِطاعَتِكَ في‌ أَيامِ المُهْلَةِ وَانْهَجْ لي‌ إِلى مَحَبتِكَ سَبِيلاً سَهْلَةً أَكْمِلْ لي‌ بِها خَيْرَ الدُّنْيا وَالآخِرَةِ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ كَأَفْضَلِ ما صَلَّيتَ عَلى أَحَدٍ مِنْ خَلْقِكَ قَبلَهُ وَأَنْتَ مُصَلٍ عَلى أَحَدٍ بعْدَهُ وَاتِنا في‌ الدُّنْيا حَسَنَةً وَفي‌ الآخِرَةِ حَسَنَةً وَقِني‌ بِرَحْمَتِكَ عَذابَ النّارِ  `,

translation:`اے اللہ! رحمت نازل فرما`,

reference:`<b>📚 کتاب:</b> الصحیفۃ السجادیہ<br><b>✍️ مصنف:</b> امام علی بن الحسین زین العابدین علیہ السلام<br><b>📖 اصل ماخذ:</b> دعاء مکارم الأخلاق (دعاء 20)`
}





,
{
id:17,

title:"دعائے عرفہ",

english:"Dua-e-Arafah",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اَللّهُمَّ اجْعَلْنى اَخْشاكَ كَاُنّى اَراكَ، وَاَسْعِدْنى بِتَقوايكَ، وَلا تُشْقِنى بِمَعْصِيَتِكَ، وَخِرْلى فى قَضآئِكَ، وَبارِكْ لى فى قَدَرِكَ، حَتّى لا أُحِبَّ تَعْجيلَ ما اَخَّرْتَ وَلا تَأخيرَ ما عَجَّلْتَ، اَللّهُمَّ اجْعَلْ غِناىَ فى نَفْسى، وَالْيَقينَ فى قَلْبى، وَالاِْخْلاصَ فى عَمَلى، وَالنُّورَ فى بَصَرى، وَالْبَصيرَةَ فى دينى، وَمَتِّعْنى بِجَوارِحى، وَاجْعَلْ سَمْعى وَبَصَرىَ الْوارِثَيْنِ مِنّى، وَانْصُرْنى عَلى مَنْ ظَلَمَنى، وَاَرِنى فيهِ ثَاْرى وَمَآرِبى، وَاَقِرَّ بِذلِكَ عَيْنى، اَللَّهُمَّ اكْشِفْ كُرْبَتى، وَاسْتُرْ عَوْرَتى، وَاغْفِرْ لى خَطيئَتى، وَاخْسَأْ شَيْطانى، وَفُكَّ رِهانى، وَاْجَعْلْ لى يا اِلهى الدَّرَجَةَ الْعُلْيا فِى الاْخِرَةِ وَالاُْوْلى، اَللّهُمَّ لَكَ الْحَمْدُ كَما خَلَقْتَنى فَجَعَلْتَنى سَميعاً بَصيراً، وَلَكَ الْحَمْدُ كَما خَلَقْتَنى فَجَعَلْتَنى خَلْقاً سَوِيّاً رَحْمَةً بى، وَقَدْ كُنْتَ عَنْ خَلْقى غَنِيّاً، رَبِّ بِما بَرَأْتَنْى فَعَدَّلْتَ فِطْرَتى، رَبِّ بِما اَنَشَأْتَنى فَاَحْسَنْتَ صُورَتى، رَبِّ بِما اَحْسَنْتَ اِلَىَّ وَفى نَفْسى عافَيْتَنى، رَبِّ بِما كَلاَتَنى وَوَفَّقْتَنى، رَبِّ بِما اَنَعْمَتَ عَلَىَّ فَهَدَيْتَنى، رَبِّ بِما اَوْلَيْتَنى وَمِنْ كُلِّ خَيْر اَعْطَيْتَنى، رَبِّ بِما اَطْعَمْتَنى وَسَقَيْتَنى، رَبِّ بِما اَغْنَيْتَنى وَاَقْنَيْتَنى، رَبِّ بِما اَعَنْتَنى وَاَعْزَزْتَنى، رَبِّ بِما اَلْبَسْتَنى مِنْ سِتْرِكَ الصّافى، وَيَسَّرْتَ لى مِنْ صُنْعِكَ الْكافى، صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَعِنّى عَلى بَوائِقِ الدُّهُورِ، وَصُرُوفِ اللَّيالى وَالاَْيّامِ، وَنَجِّنى مِنْ اَهْوالِ الدُّنْيا وَكُرُباتِ الاْخِرَةِ، وَاكْفِنى شَرَّ ما يَعْمَلُ الظّالِمُونَ فِى الاَْرْضِ، اَللّهُمَّ ما اَخافُ فَاكْفِنى، وَما اَحْذَرُ فَقِنى، وَفى نَفْسى وَدينى فَاحْرُسْنى، وَفى سَفَرى فَاحْفَظْنى، وَفى اَهْلى وَمالى فَاخْلُفْنى، وَفى ما رَزَقْتَنى فَبارِكْ لى، وَفى نَفْسى فَذلِّلْنى، وَفى اَعْيُنِ النّاسِ فَعَظِّمْنى، وَمِنْ شَرِّ الْجِنِّ وَالاِْنْسِ فَسَلِّمْنى، وَبِذُنُوبى فَلا تَفْضَحْنى وَبِسَريرَتى فَلا تُخْزِنى، وَبِعَمَلى فَلا تَبْتَِلْنى، وَنِعَمَكَ فَلا تَسْلُبْنى، وَاِلى غَيْرِكَ فَلا تَكِلْنى، اِلهى اِلى مَنْ تَكِلُنى اِلى قَريب فَيَقطَعُنى، اَمْ اِلى بَعيد فَيَتَجَهَّمُنى، اَمْ اِلَى الْمُسْتَضْعَفينَ لى، وَاَنْتَ رَبّى وَمَليكُ اَمْرى، اَشْكُو اِلَيْكَ غُرْبَتى وَبُعْدَ دارى، وَهَوانى عَلى مَنْ مَلَّكْتَهُ اَمْرى، اِلهى فَلا تُحْلِلْ عَلَىَّ غَضَبَكَ، فَاِنْ لَمْ تَكُنْ غَضِبْتَ عَلَىَّ فَلا اُبالى سُبْحانَكَ غَيْرَ اَنَّ عافِيَتَكَ اَوْسَعُ لى، فَأَسْأَلُكَ يا رَبِّ بِنُورِ وَجْهِكَ الَّذى اَشْرَقَتْ لَهُ الاَْرْضُ وَالسَّماواتُ، وَكُشِفَتْ بِهِ الظُّلُماتُ، وَصَلُحَ بِهِ اَمْرُ الاَْوَّلينَ وَالاْخِرِينَ، اَنْ لا تُميتَنى عَلى غَضَبِكَ، وَلا تُنْزِلْ بى سَخَطَكَ، لَكَ الْعُتْبى لَكَ الْعُتْبى حَتّى تَرْضى قَبْلَ ذلِك، لا اِلهَ اِلاّ اَنْتَ، رَبَّ الْبَلَدِ الْحَرامِ وَالْمَشْعَرِ الْحَرامِ، وَالْبَيْتِ الْعَتيقِ الَّذى اَحْلَلْتَهُ الْبَرَكَةَ، وَجَعَلْتَهُ لِلنّاسِ اَمْنَاً، يا مَنْ عَفا عَنْ عَظيمِ الذُّنُوبِ بِحِلْمِهِ، يا مَنْ اَسْبَغَ النَّعْمآءَ بِفَضْلِهِ، يا مَنْ اَعْطَى الْجَزيلَ بِكَرَمِهِ، يا عُدَّتى فى شِدَّتى، يا صاحِبى فى وَحْدَتى، يا غِياثى فى كُرْبَتى، يا وَلِيّى فى نِعْمَتى، يا اِلهى وَاِلهَ آبائى اِبْراهيمَ وَاِسْماعيلَ وَاِسْحاقَ وَيَعْقُوبَ، وَرَبَّ جَبْرَئيلَ وَميكائيلَ وَاِسْرافيلَ، وَربَّ مُحَمَّد خاتَمِ النَّبِيّيينَ وَآلِهِ الْمُنْتَجَبينَ، مُنْزِلَ التَّوراةِ وَالاِْنْجيلَ، وَالزَّبُورِ وَالْفُرْقانِ، وَمُنَزِّلَ كهيعص، وَطه وَيس، وَالْقُرآنِ الْحَكيمِ، اَنْتَ كَهْفى حينَ تُعيينِى الْمَذاهِبُ فى سَعَتِها، وَتَضيقُ بِىَ الاَْرْضُ بِرُحْبِها، وَلَوْلا رَحْمَتُكَ لَكُنْتُ مِنَ الْهالِكينَ، وَاَنْتَ مُقيلُ عَثْرَتى، وَلَوْلا سَتْرُكَ اِيّاىَ لَكُنْتُ مِنَ الْمَفْضُوحِينَ، وَاَنْتَ مُؤَيِّدى بِالنَّصْرِ عَلى اَعْدآئى، وَلَوْلا نَصْرُكَ اِيّاىَ لَكُنْتُ مِنَ الْمَغْلُوبينَ، يا مَنْ خَصَّ نَفْسَهُ بِالْسُّمُوِّ وَالرِّفْعَةِ، فَاَوْلِيآؤهُ بِعِزِّهِ يَعْتَزُّونَ، يا مَنْ جَعَلَتْ لَهُ الْمُلُوكُ نَيرَ الْمَذَلَّةِ عَلى اَعْناقِهِمْ، فَهُمْ مِنْ سَطَواتِهِ خائِفُونَ، يَعْلَمُ خائِنَةَ الاَْعْيُنِ وَما تُخْفِى الصُّدُورُ، وَغَيْبَ ما تَأتِى بِهِ الاَْزْمِنَةُ وَالدُّهُورُ، يا مَنْ لا يَعْلَمُ كَيْفَ هُوَ اِلاّ هُوَ، يا مَنْ لا يَعْلَمُ ما هُوَ اِلاّ هُوَ، يا مَنْ لا يَعْلَم يَعْلَمُهُ، اِلاّ هُوَ يا مَنْ كَبَسَ الاَْرْضَ عَلَى الْمآءِ، وَسَدَّ الْهَوآءَ بِالسَّمآءِ، يا مَنْ لَهُ اَكْرَمُ الاَْسْمآءِ، يا ذَا الْمَعْرُوفِ الَّذى لا يَنْقَطِعُ اَبَداً، يا مُقَيِّضَ الرَّكْبِ لِيُوسُفَ فِى الْبَلَدِ الْقَفْرِ، وَمُخْرِجَهُ مِنَ الْجُبِّ وَجاعِلَهُ بَعْدَ الْعُبودِيَّةِ مَلِكاً، يا رآدَّهُ عَلى يَعْقُوبَ بَعْدَ اَنِ ابْيَضَّتْ عَيْناهُ مِنَ الْحُزْنِ فَهُوَ كَظيمٌ، يا كاشِفَ الضُّرِّ وَالْبَلْوى عَنْ اَيُّوبَ، وَمُمْسِكَ يَدَىْ اِبْرهيمَ عَنْ ذَبْحِ ابْنِهِ بَعْدَ كِبَرِ سِنِّهِ، وَفَنآءِ عُمُرِهِ، يا مَنِ اسْتَجابَ لِزَكَرِيّا فَوَهَبَ لَهُ يَحْيى، وَلَمْ يَدَعْهُ فَرْداً وَحيداً، يا مَنْ اَخْرَجَ يُونُسَ مِنْ بَطْنِ الْحُوتِ، يا مَنْ فَلَقَ الْبَحْرَ لِبَنى اِسْرآئيلَ فَاَنْجاهُمْ، وَجَعَلَ فِرْعَوْنَ وَجُنُودَهُ مِنَ الْمُغْرَقينَ، يا مَنْ اَرْسَلَ الرِّياحَ مُبَشِّرات بَيْنَ يَدَىْ رَحْمَتِهِ، يا مَنْ لَمْ يَعْجَلْ عَلى مَنْ عَصاهُ مِنْ خَلْقِهِ، يا مَنِ اسْتَنْقَذَ السَّحَرَةَ مِنْ بَعْدِ طُولِ الْجُحُودِ، وَقَدْ غَدَوْا فى نِعْمَتِهِ يَأكُلُونَ رِزْقَهُ، وَيَعْبُدُونَ غَيْرَهُ، وَقَدْ حادُّوهُ وَنادُّوهُ وَكَذَّبُوا رُسُلَهُ، يا اَللهُ يا اَللهُ، يا بَدىُ يا بَديعُ، لا نِدَّلَكَ، يا دآئِماً لا نَفَادَ لَكَ، يا حَيّاً حينَ لا حَىَّ، يا مُحْيِىَ الْمَوْتى، يا مَنْ هُوَ قآئِمٌ عَلى كُلِّ نَفْس بِما كَسَبَتْ، يا مَنْ قَلَّ لَهُ شُكْرى فَلَمْ يَحْرِمْنى، وَعَظُمَتْ خَطيئَتى فَلَمْ يَفْضَحْنى، وَرَآنى عَلَى الْمَعاصى فَلَمْ يَشْهَرْنى، يا مَنْ حَفِظَنى فى صِغَرى، يا مَنْ رَزَقَنى فى كِبَرى، يا مَنْ اَياديهِ عِنْدى لا تُحْصى، وَنِعَمُهُ لا تُجازى، يا مَنْ عارَضَنى بِالْخَيْرِ والاِْحْسانِ، وَعارَضْتُهُ بِالاِْساءَةِ وَالْعِصْيانِ، يا مَنْ هَدانى لِلاْيمانِ مِنْ قَبْلِ اَنْ اَعْرِفَ شُكْرَ الاِْمْتِنانِ، يا مَنْ دَعَوْتُهُ مَريضاً فَشَفانى، وَعُرْياناً فَكَسانى، وَجائِعاً فَاَشْبَعَنى، وَعَطْشاناً فَاَرْوانى، وَذَليلاً فَاَعَزَّنى، وَجاهِلاً فَعَرَّفَنى، وَوَحيداً فَكَثَّرَنى، وَغائِباً فَرَدَّنى، وَمُقِلاًّ فَاَغْنانى، وَمُنْتَصِراً فَنَصَرَنى، وَغَنِيّاً فَلَمْ يَسْلُبْنى، وَاَمْسَكْتُ عَنْ جَميعِ ذلِكَ فَابْتَدَاَنى، فَلَكَ الْحَمْدُ وَالشُّكْرُ، يا مَنْ اَقالَ عَثْرَتى، وَنَفَّسَ كُرْبَتى، وَاَجابَ دَعْوَتى، وَسَتَرَ عَوْرَتى، وَغَفَرَ ذُنُوبى، وَبَلَّغَنى طَلِبَتى، وَنَصَرَنى عَلى عَدُوّى، وَاِنْ اَعُدَّ نِعَمَكَ وَمِنَنَكَ وَكَرائِمَ مِنَحِكَ لا اُحْصيها، يا مَوْلاىَ اَنْتَ الَّذى مَنْنْتَ، اَنْتَ الَّذى اَنْعَمْتَ، اَنْتَ الَّذى اَحْسَنْتَ، اَنْتَ الَّذى اَجْمَلْتَ، اَنْتَ الَّذى اَفْضَلْتَ، اَنْتَ الَّذى اَكْمَلْتَ، اَنْتَ الَّذى رَزَقْتَ، اَنْتَ الَّذى وَفَّقْتَ، اَنْتَ الَّذى اَعْطَيْتَ، اَنْتَ الَّذى اَغْنَيْتَ، اَنْتَ الَّذى اَقْنَيْتَ، اَنْتَ الَّذى آوَيْتَ، اَنْتَ الَّذى كَفَيْتَ، اَنْتَ الَّذى هَدَيْتَ، اَنْتَ الَّذى عَصَمْتَ، اَنْتَ الَّذى سَتَرْتَ، اَنْتَ الَّذى غَفَرْتَ، اَنْتَ الَّذى اَقَلْتَ، اَنْتَ الَّذى مَكَّنْتَ، اَنْتَ الَّذى اَعْزَزْتَ، اَنْتَ الَّذى اَعَنْتَ، اَنْتَ الَّذى عَضَدْتَ، اَنْتَ الَّذى اَيَّدْتَ، اَنْتَ الَّذى نَصَرْتَ، اَنْتَ الَّذى شَفَيْتَ، اَنْتَ الَّذى عافَيْتَ، اَنْتَ الَّذى اَكْرَمْتَ، تَبارَكْتَ وَتَعالَيْتَ، فَلَكَ الْحَمْدُ دآئِماً، وَلَكَ الشُّكْرُ واصِباً اَبَداً، ثُمَّ اَنَا يا اِلهَى الْمُعَتَرِفُ بِذُنُوبى فَاغْفِرْها لى، اَنَا الَّذى اَسَأتُ، اَنَا الَّذى اَخْطَأتُ، اَنَا الَّذى هَمَمْتُ، اَنَا الَّذى جَهِلْتُ، اَنَا الَّذى غَفِلْتُ، اَنَا الَّذى سَهَوْتُ، اَنَا الَّذِى اعْتَمَدْتُ، اَنَا الَّذى تَعَمَّدْتُ، اَنَا الَّذى وَعَدْتُ، وَاَنَا الَّذى اَخْلَفْتُ، اَنَا الَّذى نَكَثْتُ، اَنَا الَّذى اَقْرَرْتُ، اَنَا الَّذِى اعْتَرَفْتُ بِنِعْمَتِكَ عَلَىَّ وَعِنْدى، وَاَبُوءُ بِذُنُوبى فَاغْفِرْها لى، يا مَنْ لا تَضُرُّهُ ذُنُوبُ عِبادِهِ، وهُوَ الَغَنِىُّ عَنْ طاعَتِهِمْ، وَالْمُوَفِّقُ مَنْ عَمِلَ صالِحاً مِنْهُمْ بِمَعُونَتِهِ وَرَحْمَتِه، فَلَكَ الْحَمْدُ اِلهى وَسيِّدى، اِلهى اَمَرْتَنى فَعَصَيْتُكَ، وَنَهَيْتَنى فَارْتَكَبْتُ نَهْيَكَ، فَاَصْبَحْتُ لا ذا بَرآءَة لى فَاَعْتَذِرُ، وَلاذا قُوَّة فَاَنْتَصِرَُ، فَبِأَىِّ شَىء اَسْتَقْبِلُكَ يا مَوْلاىَ، اَبِسَمْعى اَمْ بِبَصَرى، َاْم بِلِسانى، اَمْ بِيَدى اَمْ بِرِجْلى، اَلَيْسَ كُلُّها نِعَمَكَ عِندى، وَبِكُلِّها عَصَيْتُكَ يا مَوْلاىَ، فَلَكَ الْحُجَّةُ وَالسَّبيلُ عَلىَّ، يا مَنْ سَتَرَنى مِنَ الاْباءِ وَالاُْمَّهاتِ اَنْ يَزجُرُونى، وَمِنَ الْعَشائِرِ وَالاِْخْوانِ اَنْ يُعَيِّرُونى، وَمِنَ السَّلاطينِ اَنْ يُعاقِبُونى، وَلَوِ اطَّلَعُوا يا مَوْلاىَ عَلى مَا اطَّلَعْتَ عَلَيْهِ مِنّى اِذاً ما اَنْظَرُونى، وَلَرَفَضُونى وَقَطَعُونى، فَها اَنَا ذا يا اِلهى بَيْنَ يَدَيْكَ يا سَيِّدى خاضِعٌ ذَليلٌ، حَصيرٌ حَقيرٌ، لا ذُو بَرآءَة فَاَعْتَذِرَ، وَلا ذُو قُوَّة فَاَنْتَصِرَُ، وَلا حُجَّة فَاَحْتَجُّ، بِها، وَلا قائِلٌ لَمْ اَجْتَرِحْ، وَلَمْ اَعْمَلْ سُواً، وَما عَسَى الْجُحُودُ وَلَوْ جَحَدْتُ يا مَوْلاىَ يَنْفَعُنى، كَيْفَ وَاَنّى ذلِكَ وَجَوارِحى كُلُّها شاهِدَةٌ عَلَىَّ بِما قَدْ عَمِلْتُ، وَعَلِمْتُ يَقيناً غَيْرَ ذى شَكٍّ اَنَّكَ سآئِلى مِنْ عَظائِمِ الاُْمُورِ، وَاَنَّكَ الْحَكَمُ الْعَدْلُ الَّذى لا تَجُورُ، وَعَدْلُكَ مُهْلِكى، وَمِنْ كُلِّ عَدْلِكَ مَهْرَبى، فَاِنْ تُعَذِّبْنى يا اِلهى فَبِذُنُوبى بَعْدَ حُجَّتِكَ عَلَىَّ، وَاِنْ تَعْفُ عَنّى فَبِحِلْمِكَ وَجُودِكَ وَكَرَمِكَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الظّالِمينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْمُسْتَغْفِرينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْمُوَحِّدينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْخائِفينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْوَجِلينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الَّراجينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الرّاغِبينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْمُهَلِّلينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ السّائِلينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْمُسَبِّحينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ اِنّى كُنْتُ مِنَ الْمُكَبِّرينَ، لا اِلهَ اِلاّ اَنْتَ سُبْحانَكَ رَبّى وَرَبُّ آبائِىَ الاَْوَّلينَ، اَللّهُمَّ هذا ثَنائى عَلَيْكَ مُمَجِّداً، وَاِخْلاصى بِذِكْرِكَ مُوَحِّداً، وَاِقْرارى بِآلائكَ مَعَدِّداً، وَاِنْ كُنْتُ مُقِرّاً اَنّى لَمْ اُحْصِها لِكَثْرَتِها وَسُبوغِها، وَتَظاهُرِها وَتَقادُمِها اِلى حادِث، ما لَمْ تَزَلْ تَتَعَهَّدُنى بِهِ مَعَها مُنْذُ خَلَقْتَنى وَبَرَأتَنى مِنْ اَوَّلِ الْعُمْرِ، مِنَ الاِْغْنآءِ مِنَ الْفَقْرِ، وَكَشْفِ الضُّرِّ، وَتَسْبِيبِ الْيُسْرِ، وَدَفْعِ الْعُسْرِ، وَتَفريجِ الْكَرْبِ، وَالْعافِيَةِ فِى الْبَدَنِ، وَالسَّلامَةِ فِى الدّينِ، وَلَوْ رَفَدَنى عَلى قَدْرِ ذِكْرِ نِعْمَتِكَ جَميعُ الْعالَمينَ مِنَ الاَْوَّلينَ وَالاْخِرينَ،، ما قَدَرْتُ وَلاهُمْ عَلى ذلِكَ، تَقَدَّسْتَ وَتَعالَيْتَ مِنْ رَبٍّ كَريم، عَظيم رَحيم، لا تُحْصى آلاؤُكَ، وَلا يُبْلَغُ ثَنآؤُكَ، وَلا تُكافى نَعْمآؤُكَ، فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَتْمِمْ عَلَيْنا نِعَمَكَ، وَاَسْعِدْنا بِطاعَتِكَ، سُبْحانَكَ لا اِلهَ اِلاّ اَنْتَ، اَللَّهُمَّ اِنَّكَ تُجيبُ الْمُضْطَرَّ، وَتَكْشِفُ السُّوءَ، وَتُغيثُ الْمَكْرُوبَ، وَتَشْفِى السَّقيمَ، وَتُغْنِى الْفَقيرَ، وَتَجْبُرُ الْكَسيرَ، وَتَرْحَمُ الصَّغيرَ، وَتُعينُ الْكَبيرَ، وَلَيْسَ دُونَكَ ظَهيرٌ، وَلا فَوْقَكَ قَديرٌ، وَانْتَ الْعَلِىُّ الْكَبيرُ، يا مُطْلِقَ الْمُكَبِّلِ الاَْسيرِ، يا رازِقَ الطِّفْلِ الصَّغيرِ، يا عِصْمَةَ الْخآئِفِ الْمُسْتَجيرِ، يا مَنْ لا شَريكَ لَهُ وَلا وَزيرَ، صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَعْطِنى فى هذِهِ الْعَشِيَّةِ، اَفْضَلَ ما اَعْطَيْتَ وَاَنَلْتَ اَحَداً مِنْ عِبادِكَ، مِنْ نِعْمَة تُوليها، وَآلاء تُجَدِّدُها، وَبَلِيَّة تَصْرِفُها، وَكُرْبَة تَكْشِفُها، وَدَعْوَة تَسْمَعُها، وَحَسَنَة تَتَقَبَّلُها، وَسَيِّئَة تَتَغَمَّدُها، اِنَّكَ لَطيفٌ بِما تَشاءُ خَبيرٌ، وَعَلى كُلِّ شَىء قَديرٌ، اَللَّهُمَّ اِنَّكَ اَقْرَبُ مَنْ دُعِىَ، وَاَسْرَعُ مَنْ اَجابَ، وَاَكْرَمُ مَنْ عَفى، وَاَوْسَعُ مَنْ اَعْطى، وَاَسْمَعُ مَنْ سُئِلَ، يا رَحمنَ الدُّنْيا والاْخِرَةِ وَرحيمُهُما، لَيْسَ كَمِثْلِكَ مَسْؤولٌ، وَلا سِواكَ مَأمُولٌ، دَعَوْتُكَ فَاَجَبْتَنى، وَسَأَلْتُكَ فَاَعْطَيْتَنى، وَرَغِبْتُ اِلَيْكَ فَرَحِمْتَنى، وَوَثِقْتُ بِكَ فَنَجَّيْتَنى، وَفَزِعْتُ اِلَيْكَ فَكَفَيْتَنى، اَللَّهُمَّ فَصَلِّ عَلى مُحَمَّد عَبْدِكَ وَرَسُولِكَ وَنَبِيِّكَ، وَعَلى آلِهِ الطَّيِّبينَ الطّاهِرينَ اَجْمَعينَ، وَتَمِّمْ لَنا نَعْمآءَكَ، وَهَنِّئْنا عَطآءَكَ، وَاكْتُبْنا لَكَ شاكِرينَ، وَلاِلائِكَ ذاكِرينَ، آمينَ آمينَ رَبَّ الْعالَمينَ، اَللّهُمَّ يا مَنْ مَلَكَ فَقَدَرَ، وَقَدَرَ فَقَهَرَ، وَعُصِىَ فَسَتَرَ، وَاسْتُغْفِرَ فَغَفَرَ، يا غايَةَ الطّالِبينَ الرّاغِبينَ، وَمُنْتَهى اَمَلِ الرّاجينَ، يا مَنْ اَحاطَ بِكُلِّ شَىء عِلْماً، وَوَسِعَ الْمُسْتَقيلينَ رَأفَةً وَحِلْماً، اَللّهُمَّ اِنّا نَتَوَجَّهُ اِلَيْكَ فى هذِهِ الْعَشِيَّةِ الَّتى شَرَّفْتَها وَعَظَّمْتَها بِمُحَمَّد نَبِيِّكَ وَرَسُولِكَ، وَخِيَرَتِكَ مِنْ خَلْقِكَ، وَاَمينِكَ عَلى وَحْيِكَ، الْبَشيرِ النَّذيرِ، السِّراجِ الْمُنيرِ، الَّذى اَنْعَمْتَ بِهِ عَلَى الْمُسْلِمينَ، وَجَعَلْتَهُ رَحْمَةً لِلْعالَمينَ، اَللَّهُمَّ فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، كَما مُحَمَّدٌ اَهْلٌ لِذلِكَ مِنْكَ يا عَظيمُ فَصَلِّ عَلَيْهِ وَعَلى آلِهِ، الْمُنْتَجَبينَ الطَّيِّبينَ الطّاهِرينَ اَجْمَعينَ، وَتَغَمَّدْنا بِعَفْوِكَ عَنّا، فَاِلَيْكَ عَجَّتِ الاَْصْواتُ بِصُنُوفِ اللُّغاتِ، فَاجْعَلْ لَنا اَللّهُمَّ فى هذِهِ الْعَشِيَّةِ نَصيباً مِنْ كُلِّ خَيْر تَقْسِمُهُ بَيْنَ عِبادِكَ، وَنُور تَهْدى بِهِ، وَرَحْمَة تَنْشُرُها، وَبَرَكَة تُنْزِلُها، وَعافِيَة تُجَلِّلُها، وَرِزْق تَبْسُطُهُ، يا اَرْحَمَ الرّاحِمينَ، اَللَّهُمَّ اقْلِبْنا فى هذَا الْوَقْتِ مُنْجِحينَ مُفْلِحينَ مَبْرُورينَ غانِمينَ، وَلا تَجْعَلْنا مِنَ الْقانِطينَ، وَلا تُخْلِنا مِنْ رَحْمَتِكَ، وَلا تَحْرِمْنا ما نُؤَمِّلُهُ مِنْ فَضْلِكَ، وَلا تَجْعَلْنا مِنْ رَحْمَتِكَ مَحْرُومينَ، وَلا لِفَضْلِ ما نُؤَمِّلُهُ مِنْ عَطآئِكَ قانِطينَ، وَلا تَرُدَّنا خائِبينَ وَلا مِنْ بابِكَ مَطْرُودينَ، يا اَجْوَدَ الاَجْوَدينَ، وَاَكْرَمَ الاَْكْرَمينَ، اِلَيْكَ اَقْبَلْنا مُوقِنينَ، وَلِبَيْتِكَ الْحَرامِ آمّينَ قاصِدينَ، فَاَعِنّا عَلى مَناسِكِنا، وَاَكْمِلْ لَنا حَجَّنا، وَاْعْفُ عَنّا وَعافِنا، فَقَدْ مَدَدْنا اِلَيْكَ اَيْديَنا فَهِىَ بِذِلَّةِ الاِْعْتِرافِ مَوْسُومَةٌ، اَللَّهُمَّ فَاَعْطِنا فى هذِهِ الْعَشِيَّةِ ما سَأَلْناكَ، وَاكْفِنا مَا اسْتَكْفَيْناكَ، فَلا كافِىَ لَنا سِواكَ، وَلا رَبَّ لَنا غَيْرُكَ، نافِذٌ فينا حُكْمُكَ، مُحيطٌ بِنا عِلْمُكَ، عَدْلٌ فينا قَضآؤُكَ، اِقْضِ لَنَا الْخَيْرَ، وَاجْعَلْنا مِنْ اَهْلِ الْخَيْرِ، اَللَّهُمَّ اَوْجِبْ لَنا بِجُودِكَ عَظيمَ الاَْجْرِ، وَكَريمَ الذُّخْرِ، وَدَوامَ الْيُسْرِ، وَاغْفِرْ لَنا ذُنُوبَنا اَجْمَعينَ، وَلا تُهْلِكْنا مَعَ الْهالِكينَ، وَلا تَصْرِفْ عَنّا رَأفَتَكَ وَرَحْمَتَك، يا اَرْحَمَ الرّاحِمينَ، اَللّهُمَّ اجْعَلْنا فى هذَا الْوَقْتِ مِمَّنْ سَاَلَكَ فَاَعْطَيْتَهُ، وَشَكَرَكَ فَزِدْتَهُ، وَتابَ اِلَيْكَ فَقَبِلْتَهُ وَتَنَصَّلَ اِلَيْكَ مِنْ ذُنُوبِهِ كُلِّها فَغَفَرْتَها لَهُ يا ذَالْجَلالِ وَالاِْكْرامِ، اَللّهُمَّ وَنَقِّنا وَسَدِّدْنا واقْبَلْ تَضَرُّعَنا، يا خَيْرَ مَنْ سُئِلَ، وَيا اَرْحَمَ مَنِ اسْتُرْحِمَ، يا مَنْ لا يَخْفى عَلَيْهِ اِغْماضُ الْجُفُونِ، َولا لَحْظُ الْعُيُونِ، وَلا مَا اسْتَقَرَّ فِى الْمَكْنُونِ، وَلا مَا انْطَوَتْ عَلَيْهِ مُضْمَراتُ الْقُلُوبِ، اَلا كُلُّ ذلِكَ قَدْ اَحْصاهُ عِلْمُكَ، وَوَسِعَهُ حِلْمُكَ، سُبْحانَكَ وَتَعالَيْتَ عَمّا يَقُولُ الظّالِمُونَ عُلُوّاً كَبيراً، تُسَبِّحُ لَكَ السَّماواتُ السَّبْعُ، وَالاَْرَضُونَ وَمَنْ فيهِنَّ، وَاِنْ مِنْ شَىء اِلاّ يُسَبِّحُ بِحَمْدِكَ، فَلَكَ الْحَمْدُ وَالَْمجْدُ، وَعُلُوُّ الْجَدِّ، يا ذَالْجَلالِ وَالاِْكْرامِ، وَالْفَضْلِ وَالاِْنْعامِ، وَالاَْيادِى الْجِسامِ، وَاَنْتَ الْجَوادُ الْكَريمُ، الرَّؤُوفُ الرَّحيمُ، اَللَّهُمَّ اَوْسِعْ عَلَىَّ مِنْ رِزْقِكَ الْحَلالِ، وَعافِنى فى بَدَنى وَدينى، وَآمِنْ خَوْفى، وَاعْتِقْ رَقَبَتى مِنَ النّارِ، اَللّهُمَّ لا تَمْكُرْ بى، وَلا تَسْتَدْرِجْنى، وَلا تَخْدَعْنى، وَادْرَأ عَنّى شَرَّ فَسَقَةِ الْجِنِّ وَالاِْنْسِ
يا اَسْمَعَ السّامِعينَ، يا اَبْصَرَ النّاظِرينَ، وَيا اَسْرَعَ الْحاسِبينَ، وَيا اَرْحَمَ الرّاحِمينَ، صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد السّادَةِ الْمَيامينَ، وَاَسْأَلُكَ اَللَّهُمَّ حاجَتِى اَّلتى اِنْ اَعْطَيْتَنيها لَمْ يَضُرَّنى ما مَنَعْتَنى، وَاِنْ مَنَعْتَنيها لَمْ يَنْفَعْنى ما اَعْطَيْتَنى، اَسْأَلُكَ فَكاكَ رَقَبَتى مِنَ النّارِ، لا اِلهَ اِلاّ اَنْتَ، وَحْدَكَ لا شَريكَ لَكَ، لَكَ الْمُلْكُ، وَلَكَ الْحَمْدُ، وَاَنْتَ عَلى كُلِّ شَىء قَديرٌ، يا رَبُّ يا رَبُّ
اِلهى اَنَا الْفَقيرُ فى غِناىَ فَكَيْفَ لا اَكُونُ فَقيراً فى فَقْرى، اِلهى اَنَا الْجاهِلُ فى عِلْمى فَكَيْفَ لا اَكُونُ جَهُولاً فى جَهْلى، اِلهى اِنَّ اخْتِلافَ تَدْبيرِكَ، وَسُرْعَةَ طَوآءِ مَقاديرِكَ، مَنَعا عِبادَكَ الْعارِفينَ بِكَ عَنْ السُّكُونِ اِلى عَطآء، وَالْيأْسِ مِنْكَ فى بَلاء، اِلهى مِنّى ما يَليقُ بِلُؤُمى وَمِنْكَ ما يَليقُ بِكَرَمِكَ، اِلهى وَصَفْتَ نَفْسَكَ بِاللُّطْفِ وَالرَّأْفَةِ لى قَبْلَ وُجُودِ ضَعْفى، اَفَتَمْنَعُنى مِنْهُما بَعْدَ وُجُودِ ضَعْفى، اِلهى اِنْ ظَهَرَتِ الَْمحاسِنُ مِنّى فَبِفَضْلِكَ، وَلَكَ الْمِنَّةُ عَلَىَّ، وَاِنْ ظَهَرْتِ الْمَساوىُ مِنّى فَبِعَدْلِكَ، وَلَكَ الْحُجَّةُ عَلَىَّ اِلهى كَيْفَ تَكِلُنى وَقَدْ تَكَفَّلْتَ لى، وَكَيْفَ اُضامُ وَاَنْتَ النّاصِرُ لى، اَمْ كَيْفَ اَخيبُ وَاَنْتَ الْحَفِىُّ بى، ها اَنَا اَتَوَسَّلُ اِلَيْكَ بِفَقْرى اِلَيْكَ، وَكَيْفَ اَتَوَسَّلُ اِلَيْكَ بِما هُوَ مَحالٌ اَنْ يَصِلَ اِلَيْكَ، اَمْ كَيْفَ اَشْكُو اِلَيْكَ حالى وَهُوَ لا يَخْفى عَلَيْكَ، اَمْ كَيْفَ اُتَرْجِمُ بِمَقالى وَهُوَ مِنَكَ بَرَزٌ اِلَيْكَ، اَمْ كَيْفَ تُخَيِّبُ آمالى وَهِىَ قَدْ وَفَدَتْ اِلَيْكَ، اَمْ كَيْفَ لا تُحْسِنُ اَحْوالى وَبِكَ قامَتْ، اِلهى ما اَلْطَفَكَ بى مَعَ عَظيمِ جَهْلى، وَما اَرْحَمَكَ بى مَعَ قَبيحِ فِعْلى، اِلهى ما اَقْرَبَكَ مِنّى وَاَبْعَدَنى عَنْكَ، وَما اَرْاَفَكَ بى فَمَا الَّذى يَحْجُبُنى عَنْكَ، اِلهى عَلِمْتُ بِاِخْتِلافِ الاْثارِ، وَتَنقُّلاتِ الاَْطْوارِ، اَنَّ مُرادَكَ مِنّى اَنْ تَتَعَرَّفَ اِلَىَّ فى كُلِّ شَىء، حَتّى لا اَجْهَلَكَ فى شَىء، اِلهى كُلَّما اَخْرَسَنى لُؤْمى اَنْطَقَنى كَرَمُكَ، وَكُلَّما آيَسَتْنى اَوْصافى اَطْمَعَتْنى مِنَنُكَ، اِلهى مَنْ كانَتْ مَحاسِنُهُ مَساوِىَ، فَكَيْفَ لا تَكُونُ مُساويهِ مَساوِىَ، وَمَنْ كانَتْ حَقايِقُهُ دَعاوِىَ، فَكَيْفَ لا تَكُونُ دَعاوِيَهِ دَعاوِىَ، اِلهى حُكْمُكَ النّافِذُ، وَمَشِيَّتُكَ الْقاهِرَةُ لَمْ يَتْرُكا لِذى مَقال مَقالاً، وَلا لِذى حال حالاً، اِلهى كَمْ مِنْ طاعَة بَنَيْتُها، وَحالَة شَيَّدْتُها، هَدَمَ اِعْتِمادى عَلَيْها عَدْلُكَ، بَلْ اَقالَنى مِنْها فَضْلُكَ، اِلهى اِنَّكَ تَعْلَمُ اَنّى وَاِنْ لَمْ تَدُمِ الطّاعَةُ مِنّى فِعْلاً جَزْماً فَقَدْ دامَتْ مَحَبَّةً وَعَزْماً، اِلهى كَيْفَ اَعْزِمُ وَاَنْتَ الْقاهِرُ، وَكَيْفَ لا اَعْزِمُ وَاَنْتَ الاْمِرُ، اِلهى تَرَدُّدى فِى الاْثارِ يُوجِبُ بُعْدَ الْمَزارِ، فَاجْمَعْنى عَلَيْكَ بِخِدْمَة تُوصِلُنى اِلَيْكَ، كَيْفَ يُسْتَدَلُّ عَلَيْكَ بِما هُوَ فى وُجُودِهِ مُفْتَقِرٌ اِلَيْكَ، اَيَكُونُ لِغَيْرِكَ مِنَ الظُّهُورِ ما لَيْسَ لَكَ، حَتّى يَكُونَ هُوَ الْمُظْهِرَ لَكَ، مَتى غِبْتَ حَتّى تَحْتاجَ اِلى دَليل يَدُلُّ عَليْكَ، وَمَتى بَعُدْتَ حَتّى تَكُونَ الاْثارُ هِىَ الَّتى تُوصِلُ اِلَيْكَ، عَمِيَتْ عَيْنٌ لا تَراكَ عَلَيْها رَقيباً، وَخَسِرَتْ صَفْقَةُ عَبْد لَمْ تَجْعَلْ لَهُ مِنْ حُبِّكَ نَصيباً، اِلهى اَمَرْتَ بِالرُّجُوعِ اِلَى الاْثارِ فَاَرْجِعْنى اِلَيْكَ بِكِسْوَةِ الاَْنْوارِ، وَهِدايَةِ الاِْسْتِبصارِ، حَتّى اَرْجَعَ اِلَيْكَ مِنْها كَما دَخَلْتُ اِلَيْكَ مِنْها، مَصُونَ السِّرِّ عَنِ النَّظَرِ اِلَيْها، وَمَرْفُوعَ الْهِمَّةِ عَنِ الاِْعْتِمادِ عَلَيْها، اِنَّكَ عَلى كُلِّ شَىء قَديرٌ، اِلهى هذا ذُلّى ظاهِرٌ بَيْنَ يَدَيْكَ، وَهذا حالى لا يَخْفى عَلَيْكَ، مِنْكَ اَطْلُبُ الْوُصُولُ اِلَيْكَ، َوِبَكَ اَسْتَدِلُّ عَلَيْكَ، فَاهْدِنى بِنُورِكَ اِلَيْكَ، وَاَقِمْنى بِصِدْقِ الْعُبُودِيَّةِ بَيْنَ يَدَيْكَ، اِلهى عَلِّمْنى مِنْ عِلْمِكَ الَْمخْزُونِ، وَصُنّى بِسِتْرِكَ الْمَصُونِ، اِلهى حَقِّقْنى بِحَقائِقِ اَهْلِ الْقُرْبِ، وَاسْلُكْ بى مَسْلَكَ اَهْلِ الْجَذْبِ، اِلهى اَغْنِنى بِتَدْبيرِكَ لى عَنْ تَدْبيرى، وَبِاخْتِيارِكَ عَنِ اخْتِيارى، وَاَوْقِفْنى عَلى مَراكِزِ اضْطِرارى، اِلهى اَخْرِجْنى مِنْ ذُلِّ نَفْسى، وَطَهِّرْنى مِنْ شَكّى وَشِرْكى قَبْلَ حُلُولِ رَمْسى، بِكَ اَنْتَصِرُ فَانْصُرْنى، وَعَلَيْكَ اَتَوَكَّلُ فَلا تَكِلْنى، وَاِيّاكَ اَسْأَلُ فَلا تُخَيِّبْنى، وَفى فَضْلِكَ اَرْغَبُ فَلا تَحْرِمْنى، وَبِجَنابِكَ اَنْتَسِبُ فَلا تُبْعِدْنى، وَبِبابِكَ اَقِفُ فَلا تَطْرُدْنى، اِلهى تَقَدَّسَ رِضاكَ اَنْ يَكُونَ لَهُ عِلَّةٌ مِنْكَ، فَكَيْفَ يَكُونُ لَهُ عِلَّةٌ مِنّى، اِلهى اَنْتَ الْغِنىُّ بِذاتِكَ اَنْ يَصِلَ اِلَيْكَ النَّفْعُ مِنْكَ، فَكَيْفَ لا تَكُونُ غَنِيّاً عَنّى، اِلهى اِنَّ الْقَضآءَ وَالْقَدَرَ يُمَنّينى، وَاِنَّ الْهَوى بِوَثائِقِ الشَّهْوَةِ اَسَرَنى، فَكُنْ اَنْتَ النَّصيرَ لى، حَتّى تَنْصُرَنى وَتُبَصِّرَنى، وَاَغْنِنى بِفَضْلِكَ حَتّى اَسْتَغْنِىَ بِكَ عَنْ طَلَبى، اَنْتَ الَّذى اَشْرَقْتَ الاَْنْوارَ فى قُلُوبِ اَوْلِيآئِكَ حَتّى عَرَفُوكَ وَوَحَّدوكَ، وَاَنْتَ الَّذى اَزَلْتَ الاَْغْيارَ عَنْ قُلُوبِ اَحِبّائِكَ حَتّى لَمْ يُحِبُّوا سِواكَ، وَلَمْ يَلْجَأوا اِلى غَيْرِكَ، اَنْتَ الْمُوْنِسُ لَهُمْ حَيْثُ اَوْحَشَتْهُمُ الْعَوالِمُ، وَاَنْتَ الَّذى هَدَيْتَهُمْ حَيْثُ اسْتَبانَتْ لَهُمُ الْمَعالِمُ، ماذا وَجَدَ مَنْ فَقَدَكَ، وَمَا الَّذى فَقَدَ مَنْ وَجَدَكَ، لَقَدْ خابَ مَنْ رَضِىَ دُونَكَ بَدَلاً، وَلَقَدْ خَسِرَ مَنْ بَغى عَنْكَ مُتَحَوِّلاً، كَيْفَ يُرْجى سِواكَ وَاَنْتَ ما قَطَعْتَ الاِْحْسانَ، وَكَيْفَ يُطْلَبُ مِنْ غَيْرِكَ وَاَنْتَ ما بَدَّلْتَ عادَةَ الاِْمْتِنانِ، يا مَنْ اَذاقَ اَحِبّآءَهُ حَلاوَةَ الْمُؤانَسَةِ، فَقامُوا بَيْنَ يَدَيْهِ مُتَمَلِّقينَ، وَيا مَنْ اَلْبَسَ اَوْلِياءَهُ مَلابِسَ هَيْبَتِهِ، فَقامُوا بَيْنَ يَدَيْهِ مُسْتَغْفِرينَ، اَنْتَ الذّاكِرُ قَبْلَ الذّاكِرينَ، وَاَنْتَ الْبادى بِالاِْحْسانِ قَبْلَ تَوَجُّهِ الْعابِدينَ، وَاَنْتَ الْجَوادُ بِالْعَطآءِ قَبْلَ طَلَبِ الطّالِبينَ، وَاَنْتَ الْوَهّابُ ثُمَّ لِما وَهَبْتَ لَنا مِنَ الْمُسْتَقْرِضينَ، اِلهى اُطْلُبْنى بِرَحْمَتِكَ حَتّى اَصِلَ اِلَيْكَ، وَاجْذِبْنى بِمَنِّكَ حَتّى اُقْبِلَ عَلَيْكَ، اِلهى اِنَّ رَجآئى لا يَنْقَطِعُ عَنْكَ وَاِنْ عَصَيْتُكَ، كَما اَنَّ خَوْفى لا يُزايِلُنى وَاِنْ اَطَعْتُكَ، فَقَدْ دَفَعْتَنِى الْعَوالِمُ اِلَيْكَ، وَقَدْ اَوْقَعَنى عِلْمى بِكَرَمِكَ عَلَيْكَ، اِلهى كَيْفَ اَخيبُ وَاَنْتَ اَمَلى، اَمْ كَيْفَ اُهانُ وَعَلَيْكَ مُتَكَّلى، اِلهى كَيْفَ اَسْتَعِزُّ وَفِى الذِّلَّةِ اَرْكَزْتَنى، اَمْ كَيْفَ لا اَسْتَعِزُّ وَاِلَيْكَ نَسَبْتَنى، اِلهى كَيْفَ لا اَفْتَقِرُ وَاَنْتَ الَّذى فِى الْفُقَرآءِ اَقَمْتَنى، اَمْ كَيْفَ اَفْتَقِرُ وَاَنْتَ الَّذى بِجُودِكَ اَغْنَيْتَنى، وَاَنْتَ الَّذى لا اِلهَ غَيْرُكَ تَعَرَّفْتَ لِكُلِّ شَىء فَما جَهِلَكَ شَىءُ، وَاَنْتَ الَّذى تَعَرَّفْتَ اِلَىَّ فى كُلِّ شَىء، فَرَاَيْتُكَ ظاهِراً فى كُلِّ شَىء، وَاَنْتَ الظّاهِرُ لِكُلِّ شَىء، يا مَنِ اسْتَوى بِرَحْمانِيَّتِهِ فَصارَ الْعَرْشُ غَيْباً فى ذاِتِهِ، مَحَقْتَ الاْثارَ بِالاْثارِ، وَمَحَوْتَ الاَْغْيارَ بِمُحيطاتِ اَفْلاكِ الاَْنْوارِ، يا مَنِ احْتَجَبَ فى سُرادِقاتِ عَرْشِهِ عَنْ اَنْ تُدْرِكَهُ الاَْبْصارُ، يا مَنْ تَجَلّى بِكَمالِ بَهآئِهِ، فَتَحَقَّقتْ عَظَمَتُهُ مَنْ الاِْسْتِوآءَ، كَيْفَ تَخْفى وَاَنْتَ الظّاهِرُ، اَمْ كَيْفَ تَغيبُ وَاَنْتَ الرَّقيبُ الْحاضِرُ، اِنَّكَ عَلى كُلِّ شَىء قَدير، وَالْحَمْدُ للهِ وَحْدَهُ  `,

translation:`سب تعریف اللہ کے لیے`,

reference:`<b>📚 کتاب:</b> إقبال الأعمال<br><b>✍️ مصنف:</b> سید ابن طاؤس<br><b>📖 اصل ماخذ:</b> دعاء عرفة للإمام الحسين عليه السلام`
}







,
{
id:18,

title:"دعائے ابوحمزہ ثمالی",

english:"Dua-e-Abu Hamza",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`  اِلٰہِیْ لَا تُؤَدِّبْنِيْ بِعُقُوْبَتِكَ، وَ لَا تَمْكُرْ بِيْ فِيْ حِيْلَتِكَ، مِنْ اَيْنَ لِيَ الْخَيْرُ يَا رَبِّ وَ لَا يُوْجَدُ اِلَّا مِنْ عِنْدِكَ، وَ مِنْ اَيْنَ لِيَ النَّجاةُ وَ لَا تُسْتَطَاعُ اِلَّا بِكَ، لَا الَّذِيْ اَحْسَنَ اسْتَغْنٰى عَنْ عَوْنِكَ وَ رَحْمَتِكَ، وَ لَا الَّذِيْ اَسَاۤءَ وَ اجْتَرَا عَلَيْكَ وَ لَمْ يُرْضِكَ خَرَجَ عَنْ قُدْرَتِكَ، يَا رَبِّ يَا رَبِّ يَا رَبِّ بِكَ عَرَفْتُكَ وَ اَنْتَ دَلَلْتَنِيْ عَلَيْكَ وَ دَعَوْتَنِيْ اِلَيْكَ، وَ لَوْلَا اَنْتَ لَمْ اَدْرِ مَا انْتَ۔ اَلْحَمْدُ لِلّٰہِ الَّذِيْ اَدْعُوْهُ فَيُجِيْبُنِيْ وَ اِنْ كُنْتُ بَطِيْئًا حِيْنَ يَدْعُوْنِيْ، وَ الْحَمْدُ لِلّٰهِ الَّذِيْ اَسْاَلُهُ فَيُعْطِيْنِيْ وَ اِنْ كُنْتُ بَخِيْلًا حِيْنَ يَسْتَقْرِضُنِيْ، وَ الْحَمْدُ لِلّٰہِ الَّذِيْ اُنَادِيْهِ كُلَّمَا شِئْتُ لِحَاجَتِيْ، وَ اَخْلُوْ بِهٖ حَيْثُ شِئْتُ لِسِرِّيْ بِغَيْرِ شَفِيْعٍ فَيَقْضِىْ لِيْ حَاجَتِيْ، اَلْحَمْدُ لِلّٰہِ الَّذِيْ لَا اَدْعُوْ غَيْرَهُ وَ لَوْ دَعَوْتُ غَيْرَهُ لَمْ يَسْتَجِبْ لِيْ دُعَاۤئِـيْ، وَالْحَمْدُ لِلّٰہِ الَّذِيْ لَا اَرْجُوْ غَيْرَهُ وَ لَوْ رَجَوْتُ غَيْرَهُ لَاَخْلَفَ رَجَاۤئِـيْ، وَ الْحَمْدُ لِلّٰہِ الَّذِيْ وَكَلَنِيْ اِلَيْهِ فَاَكْرَمَنِيْ وَ لَمْ يَكِلْنِيْ اِلَى النَّاسِ فَيُهِيْنُوْنِيْ، وَ اَلْحَمْدُ لِلّٰہِ الَّذِيْ تَحَبَّبَ اِلَىَّ وَ هُوَ غَنِيٌّ عَنِّيْ، وَ الْحَمْدُ لِلّٰہِ الَّذِيْ يَحْلُمُ عَنِّيْ حَتّٰى كَاَنِّيْ لَا ذَنْبَ لِيْ، فَرَبِّيْ اَحْمَدُ شَيْئٍ عِنْدِيْ وَ اَحَقُّ بِحَمْدِيْ۔ اَللّٰہُمَّ اِنِّيْ اَجِدُ سُبُلَ الْمَطَالِبِ اِلَيْكَ مُشْرَعَةٌ، وَ مَنَاهِلَ الرَّجَاۤءِ اِلَیْكَ مُتْرَعَةً، وَ الْاِسْتِعَانَةَ بِفَضْلِكَ لِمَنْ اَمَّلَكَ مُبَاحَةً، وَ اَبْوابَ الدُّعَاۤءِ اِلَيْكَ لِلصَّارِخِيْنَ مَفْتُوْحَةً، وَ اَعْلَمُ اَنَّكَ لِلرَّاجِيْ بِمَوْضِعِ اِجَابَةٍ، وَ لِلْمَلْهُوْفِيْنَ بِمَرْصَدِ اِغَاثَةٍ، وَ اَنَّ فِي اللهْفِ اِلٰى جُوْدِكَ وَالرِّضَا بِقَضَاۤئِكَ عِوَضًا مِنْ مَنْعِ الْبَاخِلِيْنَ، وَ مَنْدُوْحَةً عَمَّا فِيْ اَيْدِيْ الْمُسْتَاْثِرِيْنَ، وَ اَنَّ الرَّاحِلَ اِلَيْكَ قَرِيْبُ الْمَسَافَةِ، وَ اَنَّكَ لَا تَحْتَجِبُ عَنْ خَلْقِكَ اِلَّاۤ اَنْ تَحْجُبَهُمُ الْاَعْمَالُ دُوْنَكَ، وَ قَدْ قَصَدْتُ اِلَيْكَ بِطَلِبَتِي، وَ تَوَجَّهْتُ اِلَيْكَ بِحَاجَتِي، وَ جَعَلْتُ بِكَ اسْتِغاثَتِيْ، وَ بِدُعَاۤئِكَ تَوَسُّلِيْ مِنْ غَيْرِ اسْتِحْقَاقٍ لِاسْتِمَاعِكَ مِنِّي، وَ لَا اسْتِيْجَابٍ لِعَفْوِكَ عَنِّيْ، بَلْ لِثِقَتِيْ بِكَرَمِكَ، وَ سُكُوْنِيْ اِلٰى صِدْقِ وَعْدِكَ، وَلَجَاۤئِـيْ اِلَى الْاِيْمَانِ بِتَوْحِيْدِكَ، وَ يَقِيْنِيْ بِمَعْرِفَتِكَ مِنِّيْ اَنْ لَا رَبَّ لِيْ غَيْرُكَ، وَ لَاۤ اِلٰهَ اِلَّا اَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ۔ اَللّٰہُمَّ اَنْتَ الْقَاۤئِلُ وَ قَوْلُكَ حَقٌّ، وَ وَعْدُكَ صِدْقٌ وَاسْئَلُوْا اللّٰهَ مِنْ فَضْلِهِ اِنَّ اللّٰهَ كَانَ بِكُمْ رَحِیْمًا، وَ لَيْسَ مِنْ صِفاتِكَ يَا سَيِّدِيْ اَنْ تَاْمُرَ بِالسُّؤَالِ وَ تَمْنَعَ الْعَطِيَّةَ، وَ اَنْتَ الْمَنَّانُ بِالْعَطِيّاتِ عَلٰى اَهْلِ مَمْلِكَتِكَ، وَ الْعَاۤئِدُ عَلَيْهِمْ بِتَحَنُّنِ رَاْفَتِكَ۔ اِلٰہِیْ رَبَّيْتَنِيْ فِيْ نِعَمِكَ وَ اِحْسَانِكَ صَغِيْرًا، وَ نَوَّهْتَ بِاسْمِيْ كَبِيْرًا، فَيَا مَنْ رَبَّانِيْ فِيْ الدُّنْيَا بِاِحْسَانِهِ وَ تَفَضُّلِهِ وَ نِعَمِهِ، وَ اَشارَلِيْ فِي الْاٰخِرَةِ اِلٰى عَفْوِهِ وَ كَرَمِهِ، مَعْرِفَتِيْ يَا مَوْلَايَ دَلِيْلِيْ عَلَيْكَ، وَ حُبِّيْ لَكَ شَفِيْعِيْ اِلَيْكَ، وَ اَنَا وَاثِقٌ مِنْ دَلِيْلِيْ بِدَلَالَتِكَ، وَ سَاكِنٌ مِنْ شَفِيْعِيْ اِلٰى شَفَاعَتِكَ، اَدْعُوْكَ يَا سَيِّدِيْ بِلِسَانٍ قَدْ اَخْرَسَهُ ذَنْبُهُ، رَبِّ اُنَاجِيْكَ بِقَلْبٍ قَدْ اَوْبَقَهُ جُرْمُهُ، اَدْعُوْكَ يا رَبِّ رَاهِبًا رَاغِبًا، رَاجِيًا خَاۤئِفًا، اِذَا رَاَيْتُ مَوْلَايَ ذُنُوْبِيْ فَزِعْتُ، وَ اِذَا رَاَيْتُ كَرَمَكَ طَمِعْتُ، فَاِنْ عَفَوْتَ فَخَيْرُ رَاحِمٍ، وَ اِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ، حُجَّتِيْ يَا اَللهُ فِيْ جُرْاَتِيْ عَلٰى مَسْئَلَتِكَ، مَعَ اِتْيَانِيْ مَا تَكْرَهُ جُوْدُكَ وَ كَرَمُكَ، وَ عُدَّتِيْ فِيْ شِدَّتِيْ مَعَ قِلَّةِ حَيَاۤئِـيْ رَافَتُكَ وَ رَحْمَتُكَ، وَ قَدْ رَجَوْتُ اَنْ لَّا تَخِيْبَ بَيْنَ ذَيْنِ وَ ذَيْنِ مُنْيَتِيْ، فَحَقِّقْ رَجَاۤئِـيْ، وَاسْمَعْ دُعَاۤئِـيْ ياَ خَيْرَ مَنْ دَعَاهُ دَاعٍ، وَ اَفْضَلَ مَنْ رَجَاهُ رَاجٍ، عَظُمَ يا سَيِّدِيْ اَمَلِيْ، وَ سٰۤاۤءَ عَمَلِيْ، فَاَعْطِنِيْ مِنْ عَفْوِكَ بِمِقْدَارِ اَمَلِيْ، وَلَا تُؤَاخِذْنِيْ بِاَسْوَءِ عَمَلِيْ، فَاِنَّ كَرَمَكَ يَجِلُّ عَنْ مُجَازَاةِ الْمُذْنِبِيْنَ، وَ حِلْمَكَ يَكْبُرُ عَنْ مُكَافَاةِ الْمُقَصِّرِيْنَ، وَ اَنَا يَا سَيِّدِيْ عَاۤئِذٌ بِفَضْلِكَ، هَارِبٌ مِنْكَ اِلَيْكَ، مُتَنَجِّزٌ مَا وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ اَحْسَنَ بِكَ ظَنًّا، وَمَا اَنَا يَا رَبِّ وَمَا خَطَرِيْ، هَبْنِيْ بِفَضْلِكَ، وَتَصَدَّقْ عَلَيَّ بِعَفْوِكَ، اَيْ رَبِّ جَلِّلْنِيْ بِسَتْرِكَ، وَاعْفُ عَنْ تَوْبِيْخِيْ بِكَرَمِ وَجْهِكَ، فَلَوِ اطَّلَعَ الْيَوْمَ عَلٰى ذَنْبِيْ غَيْرُكَ مَا فَعَلْتُهُ، وَ لَوْ خِفْتُ تَعْجِيْلَ الْعُقُوْبَةِ لَاجْتَنَبْتُهُ، لَا لِاَنَّكَ اَهْوَنُ النَّاظِرِيْنَ وَ اَخَفُّ الْمُطَّلِعِيْنَ، بَلْ لِاَنَّكَ يَا رَبِّ خَيْرُ السَّاتِرِيْنَ، وَاَحْكَمُ الْحَاكِمِيْنَ، وَ اَكْرَمُ الْاَكْرَمِيْنَ، سَتَّارُ الْعُيُوْبِ، غَفّارُ الذُّنُوْبِ، عَلَّامُ الْغُيُوْبِ، تَسْتُرُ الذَّنْبَ بِكَرَمِكَ، وَ تُؤَخِّرُ الْعُقُوْبَةَ بِحِلْمِكَ، فَلَكَ الْحَمْدُ عَلٰى حِلْمِكَ بَعْدَ عِلْمِكَ، وَ عَلٰى عَفْوِكَ بَعْدَ قُدْرَتِكَ، وَ يَحْمِلُنِيْ وَ يُجَرِّئُنِيْ عَلٰى مَعْصِيَتِكَ حِلْمُكَ عَنِّيْ، وَ يَدْعُوْنِيْ اِلٰى قِلَّةِ الْحَيَاۤءِ سِتْرُكَ عَلَيَّ، وَ يُسْرِعُنِيْ اِلَى التَّوَثُّبِ عَلٰى مَحَارِمِكَ مَعْرِفَتِيْ بِسَعَةِ رَحْمَتِكَ، وَ عَظِيْمِ عَفْوِكَ۔ يَا حَلِيْمُ يَا كَرِيْمُ، يَا حَيُّ يَا قَيُّوْمُ، يَا غَافِرَ الذَّنْبِ، يَا قَابِلَ التَّوْبِ، يَا عَظِيْمَ الْمَنِّ، يَا قَدِيْمَ الْاِحْسَانِ، اَيْنَ سِتْرُكَ الْجَمِيْلُ، اَيْنَ عَفْوُكَ الْجَلِيْلُ، اَيْنَ فَرَجُكَ الْقَرِيْبُ، اَيْنَ غِيَاثُكَ السَّرِيْعُ، اَيْنَ رَحْمَتُكَ الْوَاسِعَةُ، اَيْنَ عَطَايَاكَ الْفَاضِلَةُ، اَيْنَ مَوَاهِبُكَ الْهَنِيْئَةُ، اَيْنَ صَنَاۤئِعُكَ السَّنِيَّةُ، اَيْنَ فَضْلُكَ الْعَظِيْمُ، اَيْنَ مَنُّكَ الْجَسِيْمُ، اَيْنَ اِحْسَانُكَ الْقَدِيْمُ، اَيْنَ كَرَمُكَ يَا كَرِيْمُ، بِهِ فَاسْتَنْقِذْنِيْ، وَ بِرَحْمَتِكَ فَخَلِّصْنِيْ۔ يَا مُحْسِنُ يَا مُجْمِلُ، يَا مُنْعِمُ يَا مُفْضِلُ، لَسْتُ اَتَّكِلُ فِيْ النَّجاةِ مِنْ عِقابِكَ عَلٰى اَعْمَالِنَا، بَلْ بِفَضْلِكَ عَلَيْنَا، لِاَنَّكَ اَهْلُ التَّقْوٰى وَ اَهْلُ الْمَغْفِرَةِ تُبْدِئُ بِالْاِحْسَانِ نِعَمًا، وَ تَعْفُوْ عَنِ الذَّنْبِ كَرَمًا، فَمَا نَدْرِيْ مَا نَشْكُرُ، اَجَمِيْلَ مَا تَنْشُرُ، اَمْ قَبِيْحَ مَا تَسْتُرُ، اَمْ عَظِيْمَ مَا اَبْلَيْتَ وَ اَوْلَيْتَ، اَمْ كَثِيْرَ مَا مِنْهُ نَجَّيْتَ وَ عَافَيْتَ۔ يَا حَبِيْبَ مَنْ تَحَبَّبَ اِلَيْكَ، وَ يَا قُرَّةَ عَيْنِ مَنْ لَّاذَ بِكَ وَانْقَطَعَ اِلَيْكَ، اَنْتَ الْمُحْسِنُ وَ نَحْنُ الْمُسِيْئُوْنَ فَتَجاوَزْ يَا رَبِّ عَنْ قَبِيْحِ مَا عِنْدَنَا بِجَمِيْلِ مَا عِنْدَكَ، وَ اَيُّ جَهْلٍ يَا رَبِّ لَا يَسَعُهُ جُوْدُكَ، اَوْ اَيُّ زَمَانٍ اَطْوَلُ مِنْ اَنَاتِكَ، وَ مَا قَدْرُ اَعْمالِنَا فِيْ جَنْبِ نِعَمِكَ، وَ كَيْفَ نَسْتَكْثِرُ اَعْمالًا نُقَابِلُ بِهَا كَرَمَكَ، بَلْ كَيْفَ يَضِيْقُ عَلَى الْمُذْنِبِيْنَ مَا وَسِعَهُمْ مِنْ رَحْمَتِكَ۔ يَا وَاسِعَ الْمَغْفِرَةِ، يَا بَاسِطَ الْيَدَيْنِ بِالرَّحْمَةِ، فَوَ عِزَّتِكَ يَا سَيِّدِيْ، لَوْ نَهَرْتَنِيْ مَا بَرِحْتُ مِنْ بَابِكَ، وَ لَا كَفَفْتُ عَنْ تَمَلُّقِكَ، لِمَا انْتَهٰى اِلَيَّ مِنَ الْمَعْرِفَةِ بِجُوْدِكَ وَ كَرِمِكَ، وَ اَنْتَ الْفاعِلُ لِمَا تَشَاۤءُ تُعَذِّبُ مَنْ تَشَاۤءُ بِمَا تَشَاۤءُ كَيْفَ تَشَاۤءُ، وَ تَرْحَمُ مَنْ تَشَاۤءُ بِمَا تَشَاۤءُ كَيْفَ تَشَاۤءُ، لَا تُسْئَلُ عَنْ فِعْلِكَ، وَ لَا تُنازَعُ فِيْ مُلْكِكَ، وَ لَا تُشارَكُ فِيْ اَمْرِكَ، وَ لَا تُضَاۤدُّ فِيْ حُكْمِكَ، وَ لَا يَعْتَرِضُ عَلَيْكَ اَحَدٌ فِيْ تَدْبِيْرِكَ، لَكَ الْخَلْقُ وَ الْاَمْرُ، تَبارَكَ اللهُ رَبُّ الْعَالَمِيْنَ۔ يَا رَبِّ هٰذَا مَقَامُ مَنْ لَّاذَبِكَ، وَاسْتَجَارَ بِكَرَمِكَ، وَ اَلِفَ اِحْسَانَكَ وَ نِعَمَكَ، وَ اَنْتَ الْجَوادُ الَّذِيْ لَا يَضِيْقُ عَفْوُكَ، وَ لَا يَنْقُصُ فَضْلُكَ، وَ لَا تَقِلُّ رَحْمَتُكَ، وَ قَدْ تَوَثَّقْنَا مِنْكَ بِالصَّفْحِ الْقَدِيْمِ، وَ الْفَضْلِ الْعَظيمِ، وَ الرَّحْمَةِ الْواسِعَةِ، اَفَتُرَاكَ يَا رَبِّ تُخْلِفُ ظُنُوْنَنَا، اَوْ تُخَيِّبُ اَمَالَنَا، كَلَّا يَا كَرِيْمُ، فَلَيْسَ هٰذَا ظَنُّنَا بِكَ، وَ لَا هٰذَا فِيْكَ طَمَعُنَا يَا رَبِّ، اِنَّ لَنَا فِيْكَ اَمَلًا طَوِيْلًا كَثِيْرًا، اِنَّ لَنَا فِيْكَ رَجَاۤءً عَظِيْمًا، عَصَيْنَاكَ وَ نَحْنُ نَرْجُوْ اَنْ تَسْتُرَ عَلَيْنَا، وَ دَعَوْنَاكَ وَ نَحْنُ نَرْجُوْ اَنْ تَسْتَجِيْبَ لَنَا، فَحَقِّقْ رَجَاۤءَنَا مَوْلَانَا، فَقَدْ عَلِمْنا مَا نَسْتَوْجِبُ بِاَعْمَالِنَا، وَ لٰكِنْ عِلْمُكَ فِيْنَا وَ عِلْمُنَا بِاَنَّكَ لَا تَصْرِفُنَا عَنْكَ وَ اِنْ كُنَّا غَيْرَ مُسْتَوْجِبِيْنَ لِرَحْمَتِكَ، فَاَنْتَ اَهْلٌ اَنْ تَجُوْدَ عَلَيْنَا وَ عَلَى الْمُذْنِبِيْنَ بِفَضْلِ سَعَتِكَ، فَامْنُنْ عَلَيْنَا بِمَا اَنْتَ اَهْلُهُ، وَ جُدْ عَلَيْنَا فَاِنَّا مُحْتَاجُوْنَ اِلٰى نَيْلِكَ۔ يَا غَفَّارُ بِنُوْرِكَ اهْتَدَيْنَا، وَ بِفَضْلِكَ اسْتَغْنَيْنَا، وَ بِنِعْمَتِكَ اَصْبَحْنَا وَ اَمْسَيْنَا، ذُنُوْبُنَا بَيْنَ يَدَيْكَ نَسْتَغْفِرُكَ اللّٰهُمَّ مِنْهَا وَ نَتُوْبُ اِلَيْكَ، تَتَحَبَّبُ اِلَيْنَا بِالنِّعَمِ وَ نُعَارِضُكَ بِالذُّنُوْبِ، خَيْرُكَ اِلَيْنَا نازِلٌ، وَ شَرُّنَا اِلَيْكَ صَاعِدٌ، وَ لَمْ يَزَلْ وَ لَا يَزَالُ مَلَكٌ كَرِيْمٌ يَاْتِيْكَ عَنَّا بِعَمَلٍ قَبِيْحٍ، فَلَا يَمْنَعُكَ ذٰلِكَ مِنْ اَنْ تَحُوْطَنَا بِنِعَمِكَ، وَ تَتَفَضَّلَ عَلَيْنَا بِاٰلَاۤئِكَ، فَسُبْحَانَكَ مَا اَحْلَمَكَ وَ اَعْظَمَكَ وَ اَكْرَمَكَ مُبْدِئًا وَ مُعِيْدًا، تَقَدَّسَتْ اَسْمَاؤُكَ وَ جَلَّ ثَنَاؤُكَ، وَ كَرُمَ صَنَاۤئِعُكَ وَ فِعَالُكَ، اَنْتَ اِلٰہِیْ اَوْسَعُ فَضْلًا، وَ اَعْظَمُ حِلْمًا مِنْ اَنْ تُقَايِسَنِيْ بِفِعْلِيْ وَ خَطِيْئَتِيْ، فَالْعَفْوَ الْعَفْوَ الْعَفْوَ، سَيِّدِيْ سَيِّدِيْ سَيِّدِيْ۔ اَللّٰہُمَّ اشْغَلْنَا بِذِكْرِكَ، وَ اَعِذْنَا مِنْ سَخَطِكَ، وَ اَجِرْنَا مِنْ عَذَابِكَ، وَ ارْزُقْنَا مِنْ مَوَاهِبِكَ، وَ اَنْعِمْ عَلَيْنَا مِنْ فَضْلِكَ، وَ ارْزُقْنَا حَجَّ بَيْتِكَ، وَ زِيَارَةَ قَبْرِ نَبِيِّكَ صَلَوَاتُكَ وَ رَحْمَتُكَ وَ مَغْفِرَتُكَ وَ رِضْوانُكَ عَلَيْهِ وَ عَلٰى اَهْلِ بَيْتِهِ، اِنَّكَ قَرِيْبٌ مُجِيْبٌ، وَارْزُقْنَا عَمَلًا بِطَاعَتِكَ، وَ تَوَفَّنَا عَلٰى مِلَّتِكَ، وَ سُنَّةِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَ اٰلِهِ۔ اَللّٰہُمَّ اغْفِرْلِيْ وَ لِوالِدَيَّ وَارْحَمْهُمَا كَمَا رَبَّيَانِيْ صَغِيْرًا، نِ اجْزِهِمَا بِالْاِحْسَانِ اِحْسَانًا وَ بِالسَّيِّئَاتِ غُفْرَانًا۔ اَللّٰہُمَّ اغْفِرْ لِلْمُؤْمِنينَ وَ الْمُؤْمِنَاتِ الْاَحيَاۤءِ مِنْهُمْ وَالْاَمْوَاتِ، وَ تابِعْ بَيْنَنَا وَ بَيْنَهُمْ بِالْخَيْراتِ۔ اَللّٰہُمَّ اغْفِرْ لِحَيِّنَا وَ مَيِّتِنَا، وَ شَاهِدِنَا وَ غاۤئِبِنَا، ذَكَرِنَا وَ اُنْثَانَا، صَغِيْرِنَا وَ كَبِيْرِنَا، حُرِّنَا وَ مَمْلُوْكِنَا، كَذَبَ الْعادِلُوْنَ بِاللهِ وَ ضَلُّوْا ضَلَالًا بَعِيْدًا، وَ خَسِرُوْا خُسْرَانًا مُبِيْنًا۔ اَللّٰہُمَّ صَلِّ عَلٰى مُحَمَّدٍ وَّ اٰلِ مُحَمَّدٍ، وَ اخْتِمْ لِيْ بِخَيْرٍ، وَ اكْفِنِيْ مَا اَهَمَّني مِنْ اَمْرِ دُنْيَايَ وَ اٰخِرَتِيْ وَلَا تُسَلِّطْ عَلَيَّ مَنْ لَّا يَرْحَمُنِيْ، وَاجْعَلْ عَلَيَّ مِنْكَ وَاقِيَةً بَاقِيَةً، وَلَا تَسْلُبْنِيْ صَالِحَ مَا اَنْعَمْتَ بِهِ عَلَيَّ، وَارْزُقْنِيْ مِنْ فَضْلِكَ رِزْقًا وَاسِعًا حَلَالًا طَيِّبًا۔ اَللّٰہُمَّ احْرُسْنِيْ بِحَرَاسَتِكَ، وَاحْفَظْنِيْ بِحِفْظِكَ، وَاكْلَانِيْ بِكِلٰۤاۤئَتِكَ، وَارْزُقْنِيْ حَجَّ بَيْتِكَ الْحَرَامِ فِيْ عَامِنَا هذَا وَ فِيْ كُلِّ عَامٍ، وَ زِيَارَةَ قَبْرِ نَبِيِّكَ وَالْاَئِمَّةِ عَلَيْهِمُ السَّلَامُ، وَ لَا تُخْلِنِيْ يَا رَبِّ مِنْ تِلْكَ الْمَشَاهِدِ الشَّرِيْفَةِ، وَ الْمَوَاقِفِ الْكَرِيْمَةِ۔ اَللّٰہُمَّ تُبْ عَلَيَّ حَتّٰى لَا اَعْصِيَكَ، وَ اَلْهِمْنِيْ الْخَيْرَ وَ الْعَمَلَ بِهِ، وَ خَشْيَتَكَ بِاللَّيْلِ وَ النَّهارِ مَا اَبْقَيْتَنِيْ يَا رَبَّ الْعَالَمِيْنَ۔ اَللّٰہُمَّ اِنِّيْ كُلَّمَا قُلْتُ قَدْ تَهَيَّاتُ وَ تَعَبَّاتُ وَ قُمْتُ لِلصَّلَاةِ بَيْنَ يَدَيْكَ وَ نَاجَيْتُكَ اَلْقَيْتَ عَلَيَّ نُعَاسًا اِذَا اَنَا صَلَّيْتُ، وَ سَلَبْتَنِيْ مُنَاجَاتَكَ اِذَا اَنَا نَاجَيْتُ، مَالِيْ كُلَّمَا قُلْتُ قَدْ صَلَحَتْ سَرِيْرَتِيْ، وَ قَرُبَ مِنْ مَجَالِسِ التَّوّابِيْنَ مَجْلِسِيْ، عَرَضَتْ لِيْ بَلِيَّةٌ اَزَالَتْ قَدَمِيْ، وَ حَالَتْ بَيْنِيْ وَ بَيْنَ خِدْمَتِكَ سَيِّدِيْ لَعَلَّكَ عَنْ بَابِكَ طَرَدْتَنِيْ، وَ عَنْ خِدْمَتِكَ نَحَّيْتَنِيْ اَوْ لَعَلَّكَ رَاَيْتَنِيْ مُسْتَخِفًّا بِحَقِّكَ فَاَقْصَيْتَنِيْ، اَوْ لَعَلَّكَ رَاَيْتَنِيْ مُعْرِضًا عَنْكَ فَقَلَيْتَنِيْ، اَوْ لَعَلَّكَ وَجَدْتَنِيْ فِيْ مَقَامِ الْكَاذِبِيْنَ فَرَفَضْتَنِيْ، اَوْ لَعَلَّكَ رَاَيْتَنِيْ غَيْرَ شَاكِرٍ لِنَعْمَاۤئِكَ فَحَرَمْتَنِيْ، اَوْ لَعَلَّكَ فَقَدْتَنِيْ مِنْ مَجالِسِ الْعُلَمَاۤءِ فَخَذَلْتَنِيْ، اَوْ لَعَلَّكَ رَاَيْتَنِيْ فِى الْغَافِلِيْنَ فَمِنْ رَحْمَتِكَ اٰيَسْتَنِيْ، اَوْ لَعَلَّكَ رَاَيْتَنِيْ اٰلِفَ مَجَالِسِ الْبَطَّالِيْنَ فَبَيْنِيْ وَ بَيْنَهُمْ خَلَّيْتَنِيْ، اَوْ لَعَلَّكَ لَمْ تُحِبَّ اَنْ تَسْمَعَ دُعَاۤئِیْ فَبَاعَدْتَنِيْ، اَوْ لَعَلَّكَ بِجُرْمِيْ وَ جَرِيْرَتِيْ كَافَيْتَنِيْ، اَوْ لَعَلَّكَ بِقِلَّةِ حَيَاۤئِـيْ مِنْكَ جَازَيْتَنِيْ، فَاِنْ عَفَوْتَ يَا رَبِّ فَطَالَ مَا عَفَوْتَ عَنِ الْمُذْنِبِيْنَ قَبْلِيْ، لِاَنَّ كَرَمَكَ اَيْ رَبِّ يَجِلُّ عَنْ مُكَافَاتِ الْمُقَصِّرِيْنَ، وَ اَنَا عَاۤئِذٌ بِفَضْلِكَ، هَارِبٌ مِنْكَ اِلَيْكَ، مُتَنَجِّزٌ مَا وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ اَحْسَنَ بِكَ ظَنًّا، اِلٰہِیْ اَنْتَ اَوْسَعُ فَضْلًا، وَ اَعْظَمُ حِلْمًا مِنْ اَنْ تُقايِسَنِيْ بِعَمَلِيْ اَوْ اَنْ تَسْتَزِلَّنِيْ بِخَطِيْئَتِيْ، وَ مَا اَنَا يَا سَيِّدِيْ وَ مَا خَطَرِيْ، هَبْنِيْ بِفَضْلِكَ سَيِّدِيْ، وَ تَصَدَّقْ عَلَيَّ بِعَفْوِكَ، وَ جَلِّلْنِيْ بِسِتْرِكَ، وَاعْفُ عَنْ تَوْبِيْخِيْ بِكَرَمِ وَجْهِكَ۔ سَيِّدِي اَنَا الصَّغِيْرُ الَّذِيْ رَبَّيْتَهُ، وَ اَنَا الْجاهِلُ الَّذِيْ عَلَّمْتَهُ، وَ اَنَا الضَّالُّ الَّذِيْ هَدَيْتَهُ، وَ اَنَا الْوَضِيْعُ الَّذِيْ رَفَعْتَهُ، وَ اَنَا الْخَاۤئِفُ الَّذِيْ اٰمَنْتَهُ، وَ الْجَايِعُ الَّذِيْ اَشْبَعْتَهُ، وَ الْعَطْشَانُ الَّذِيْ اَرْوَيْتَهُ، وَ الْعَارِي الَّذِيْ كَسَوْتَهُ، وَ الْفَقيرُ الَّذِيْ اَغْنَيْتَهُ، وَ الضَّعِيْفُ الَّذِيْ قَوَّيْتَهُ، وَ الذَّلِيْلُ الَّذِيْ اَعْزَزْتَهُ، وَ السَّقِيْمُ الَّذِيْ شَفَيْتَهُ، وَ السَّاۤئِلُ الَّذِي اَعْطَيْتَهُ، وَ الْمُذْنِبُ الَّذِيْ سَتَرْتَهُ، وَ الْخَاطِئُ الَّذِيْ اَقَلْتَهُ، وَ اَنَا الْقَلِيْلُ الَّذِيْ كَثَّرْتَهُ، وَ الْمُسْتَضْعَفُ الَّذِيْ نَصَرْتَهُ، وَ اَنَا الطَّرِيْدُ الَّذِيْ اٰوَيْتَهُ، اَنَا يَا رَبِّ الَّذِيْ لَمْ اَسْتَحْيِكَ فِى الْخَلَاۤءِ، وَ لَمْ اُرَاقِبْكَ فِى الْمَلَاۤءِ، اَنَا صَاحِبُ الدَّوَاهِي الْعُظْمٰى، اَنَا الَّذِيْ عَلٰى سَيِّدِهِ اجْتَرٰى، اَنَا الَّذِيْ عَصَيْتُ جَبَّارَ السَّمَاۤءِ، اَنَا الَّذِي اعْطَيْتُ عَلٰى مَعَاصِىْ الْجَلِيْلِ الرُّشَا، اَنَا الَّذِيْ حِيْنَ بُشِّرْتُ بِهَا خَرَجْتُ اِلَيْهَا اَسْعٰى، اَنَا الَّذِيْ اَمْهَلْتَنِيْ فَمَا ارْعَوَيْتُ، وَ سَتَرْتَ عَلَيَّ فَمَا اسْتَحْيَيْتُ، وَ عَمِلْتُ بِالْمَعَاصِيْ فَتَعَدَّيْتُ، وَ اسْقَطْتَنِيْ مِنْ عَيْنِكَ فَمَا بَالَيْتُ، فَبِحِلْمِكَ اَمْهَلْتَنِيْ وَ بِسِتْرِكَ سَتَرْتَنِيْ حَتّٰى كَانَّكَ اَغْفَلْتَنِيْ، وَ مِنْ عُقُوْبَاتِ الْمَعَاصِيْ جَنَّبْتَنِيْ حَتّٰى كَانَّكَ اسْتَحْيَيْتَنِيْ۔ اِلٰہِیْ لَمْ اَعْصِكَ حِيْنَ عَصَيْتُكَ وَ اَنَا بِرُبُوْبِيَّتِكَ جَاحِدٌ، وَ لَا بِاَمْرِكَ مُسْتَخِفٌّ، وَ لَا لِعُقُوْبَتِكَ مُتَعَرِّضٌ، وَ لَا لِوَعِيْدِكَ مُتَهَاوِنٌ، لٰكِنْ خَطِيْۤئَةٌ عَرَضَتْ وَ سَوَّلَتْ لِيْ نَفْسِيْ، وَ غَلَبَنِيْ هَوَايَ، وَ اَعَانَنِيْ عَلَيْهَا شِقْوَتِيْ، وَ غَرَّنِيْ سِتْرُكَ الْمُرْخٰى عَلَيَّ، فَقَدْ عَصَيْتُكَ وَ خَالَفْتُكَ بِجُهْدِيْ، فَالْاٰنَ مِنْ عَذَابِكَ مَنْ يَسْتَنْقِذُنِيْ، وَ مِنْ اَيْدِيْ الْخُصَمَاۤء غَدًا مِنْ يُخَلِّصُنِيْ، وَ بِحَبْلِ مَنْ اَتَّصِلُ اِنْ اَنْتَ قَطَعْتَ حَبْلَكَ عَنِّيْ، فَوَاسَوْاَتَا عَلٰى مَا اَحْصٰى كِتَابُكَ مِنْ عَمَلِي الَّذِيْ لَوْلَا مَا اَرْجُوْ مِنْ كَرَمِكَ وَ سَعَةِ رَحْمَتِكَ وَ نَهْيِكَ اِيَّايَ عَنِ الْقُنُوْطِ لَقَنَطْتُ عِنْدَمَا اَتَذَكَّرُهَا، يَا خَيْرَ مَنْ دَعَاهُ دَاعٍ، وَ اَفْضَلَ مَنْ رَجَاهُ رَاجٍ۔ اَللّٰہُمَّ بِذِمَّةِ الْاِسْلَامِ اَتَوَسَّلُ اِلَيْكَ، وَ بِحُرْمَةِ الْقُرْاٰنِ اَعْتَمِدُ اِلَيْكَ، وَ بِحُبِّي النَّبِيَّ الْاُمِّيَّ الْقُرَشِيَّ الْهَاشِمِيَّ الْعَرَبِيَّ التَّهَامِيَّ الْمَكِّيَّ الْمَدَنِيَّ ارْجُوْ الزُّلْفَةَ لَدَيْكَ، فَلَا تُوْحِشِ اسْتِيْنَاسَ اِيْمَانِيْ، وَلَا تَجْعَلْ ثَوَابِيْ ثَوَابَ مَنْ عَبَدَ سِوَاكَ، فَاِنَّ قَوْمًا اٰمَنُوْا بِاَلْسِنَتِهِمْ لِيَحْقِنُوْا بِهِ دِمَاۤءَهُمْ فَاَدْرَكُوْا مَا اَمَّلُوْا، وَ اِنَّا اٰمَنَّا بِكَ بِاَلْسِنَتِنَا وَ قُلُوْبِنَا لِتَعْفُوَ عَنَّا، فَادْرِكْنَا مَا اَمَّلْنَا، وَ ثَبِّتْ رَجَاۤئَكَ فِيْ صُدُوْرِنَا، وَ لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ هَدَيْتَنَا، وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الْوَهّابُ، فَوَعِزَّتِكَ لَوِ انْتَهَرْتَنِيْ مَا بَرِحْتُ مِنْ بَابِكَ، وَ لَا كَفَفْتُ عَنْ تَمَلُّقِكَ لِمَا اُلْهِمَ قَلْبِيْ مِنَ الْمَعْرِفَةِ بِكَرَمِكَ وَ سَعَةِ رَحْمَتِكَ، اِلٰى مَنْ يَذْهَبُ الْعَبْدُ اِلَّا اِلٰى مَوْلَاهُ، وَ اِلٰى مَنْ يَلْتَجِئُ الْمَخْلُوْقُ اِلَّا اِلٰى خَالِقِهِ۔ اِلٰہِیْ لَوْ قَرَنْتَنِيْ بِالْاَصْفَادِ، وَ مَنَعْتَنِيْ سَيْبَكَ مِنْ بَيْنِ الْاَشْهَادِ، وَ دَلَلْتَ عَلٰى فَضَايِحِيْ عُيُوْنَ الْعِبَادِ، وَ اَمَرْتَ بِيْ اِلَى النَّارِ، وَ حُلْتَ بَيْنِيْ وَ بَيْنَ الْاَبْرَارِ، مَا قَطَعْتُ رَجَاۤئِـيْ مِنْكَ، وَ مَا صَرَفْتُ تَامِيْلِيْ لِلْعَفْوِ عَنْكَ، وَ لَا خَرَجَ حُبُّكَ مِنْ قَلْبِيْ، اَنَا لَا اَنْسٰى اَيَادِيَكَ عِنْدِيْ، وَ سَتْرَكَ عَلَيَّ فِيْ دَارِ الدُّنْيَا۔ سَيِّدِيْ اَخْرِجْ حُبَّ الدُّنْيَا مِنْ قَلْبِيْ، وَاجْمَعْ بَيْني وَ بَيْنَ الْمُصْطَفٰى وَ اٰلِهِ خِيَرَتِكَ مِنْ خَلْقِكَ وَ خَاتَمِ النَّبِيِّيْنَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَ اٰلِهِ، وَ انْقُلْنِيْ اِلٰى دَرَجَةِ التَّوْبَةِ اِلَيْكَ، وَ اَعِنّي بِالْبُكَاۤءِ عَلٰى نَفْسِيْ، فَقَدْ اَفْنَيْتُ بِالتَّسْوِيْفِ وَالْاٰمَالِ عُمْرِيْ، وَ قَدْ نَزَلْتُ مَنْزِلَةَ الاٰيِسِيْنَ مِنْ خَيْرِيْ، فَمَنْ يَكُوْنُ اَسْوَءَ حَالًا مِنِّيْ اِنْ اَنَا نُقِلْتُ عَلٰى مِثْلِ حَالِيْ اِلٰى قَبْرِيْ، لَمْ اُمَهِّدْهُ لِرَقْدَتِيْ، وَ لَمْ اَفْرُشْهُ بِالْعَمَلِ الصّالِحِ لِضَجْعَتِيْ، وَ مَالِيْ لَا اَبْكِيْ وَ لَا اَدْرِيْ اِلٰى مَا يَكُوْنُ مَصِيْرِيْ، وَ اَرٰى نَفْسِيْ تُخادِعُنِيْ، وَ اَيَّامِيْ تُخَاتِلُنِيْ، وَ قَدْ خَفَقَتْ عِنْدَ رَاسِيْ اَجْنِحَةُ الْمَوْتِ، فَمَالِيْ لَا اَبْكِيْ، اَبْكِيْ لِخُرُوْجِ نَفْسِيْ، اَبْكِيْ لِظُلْمَةِ قَبْرِيْ، اَبْكِيْ لِضِيْقِ لَحَدِيْ، اَبْكي لِسُؤَالِ مُنْكَرٍ وَ نَكِيْرٍ اِيَّايَ، اَبْكي لِخُرُوْجِيْ مِنْ قَبْرِيْ عُرْيَانًا ذَلِيْلًا حَامِلًا ثِقْلِيْ عَلٰى ظَهْرِيْ، اَنْظُرُ مَرَّةً عَنْ يَمِيْنِيْ وَ اُخْرٰى عَنْ شِمَالِيْ، اِذِالْخَلَاۤئِقُ فِيْ شَانٍ غَيْرِ شَانِيْ لِكُلِّ امْرِئٍ مِّنْهُمْ يَوْمَئِذٍ شَانٌ يُغْنِيْهِ وُجُوْهٌ يَوْمَئِذٍ مُّسْفِرَةٌ ضَاحِكَةٌ مُّسْتَبْشِرَةٌ وَوُجُوْهٌ يَّوْمَئِذٍ عَلَيْهَا غَبَرَةٌ تَرْهَقُهَا قَتَرَةٌ وَ ذِلَّةٌ۔ سَيِّدِيْ عَلَيْكَ مُعَوَّلِيْ وَ مُعْتَمَدِيْ وَ رَجَاۤئِـيْ وَ تَوَكُّلِيْ، وَ بِرَحْمَتِكَ تَعَلُّقِيْ، تُصِيْبُ بِرَحْمَتِكَ مَنْ تَشَاۤءُ وَ تَهْدِيْ بِكَرَامَتِكَ مَنْ تُحِبُّ، فَلَكَ الْحَمْدُ عَلٰى مَا نَقَّيْتَ مِنَ الشِّرْكِ قَلْبِيْ، وَ لَكَ الْحَمْدُ عَلٰى بَسْطِ لِسَانِيْ، اَفَبِلِسَانِيْ هٰذَا الْكَالِّ اَشْكُرُكَ، اَمْ بِغايَةِ جَهْدِيْ فِيْ عَمَلِيْ اُرْضِيْكَ، وَ مَا قَدْرُ لِسَانِيْ يَا رَبِّ في جَنْبِ شُكْرِكَ، وَ مَا قَدْرُ عَمَلِيْ فِيْ جَنْبِ نِعَمِكَ وَ اِحْسانِكَ۔ اِلٰہِیْ اِنَّ جُوْدَكَ بَسَطَ اَمَلِيْ، وَ شُكْرَكَ قَبِلَ عَمَلِيْ، سَيِّدِيْ اِلَيْكَ رَغْبَتِيْ، وَ اِلَيْكَ رَهْبَتِيْ، وَ اِلَيْكَ تَامِيْلِيْ، وَ قَدْ سَاقَنِيْ اِلَيْكَ اَمَلِيْ، وَ عَلَيْكَ يَا وَاحِدِيْ عَكَفَتْ هِمَّتِيْ، وَ فِيْمَا عِنْدَكَ انْبَسَطَتْ رَغْبَتِيْ، وَ لَكَ خالِصُ رَجَاۤئِـيْ وَ خَوْفِيْ، وَ بِكَ اَنِسَتْ مَحَبَّتِيْ، وَ اِلَيْكَ اَلْقَيْتُ بِيَدِيْ، وَ بِحَبْلِ طَاعَتِكَ مَدَدْتُ رَهْبَتِيْ، يَا مَوْلَايَ بِذِكْرِكَ عَاشَ قَلْبِيْ، وَ بِمُنَاجَاتِكَ بَرَّدْتُ اَلَمَ الْخَوْفِ عَنِّيْ، فَيَا مَوْلَايَ وَ يَا مُؤَمَّلِيْ وَ يَا مُنْتَهٰى سُؤْلِيْ فَرِّقْ بَيْنِيْ وَ بَيْنَ ذَنْبِيَ الْمَانِعِ لِيْ مِنْ لُزُوْمِ طَاعَتِكَ، فَاِنَّمَا اَسْئَلُكَ لِقَدِيْمِ الرَّجَاۤءِ فِيْكَ، وَ عَظِيْمِ الطَّمَعِ مِنْكَ، الَّذِيْ اَوْجَبْتَهُ عَلٰى نَفْسِكَ مِنَ الرَّافَةِ وَ الرَّحْمَةِ، فَالْاَمْرُ لَكَ، وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ الْخَلْقُ كُلُّهُمْ عِيالُكَ وَ فِيْ قَبْضَتِكَ، وَ كُلُّ شَيْئٍ خاضِعٌ لَكَ، تَبارَكْتَ يَا رَبَّ الْعَالَمِيْنَ۔ اِلٰہِیْ اِرْحَمْنِيْ اِذَا انْقَطَعَتْ حُجَّتِيْ وَ كَلَّ عَنْ جَوابِكَ لِسَانِيْ، وَ طَاشَ عِنْدَ سُؤالِكَ اِيَّايَ لُبِّيْ، فَيَا عَظِيْمَ رَجَاۤئِـيْ لَا تُخَيِّبْنِيْ اِذََا اشْتَدَّتْ فَاقَتِيْ، وَ لَا تَرُدَّنِيْ لِجَهْلِيْ، وَ لَا تَمْنَعْنِيْ لِقِلَّةِ صَبْرِيْ، اَعْطِنِيْ لِفَقْرِيْ وَارْحَمْنِيْ لِضَعْفِيْ، سَيِّدِيْ عَلَيْكَ مُعْتَمَدِيْ وَ مُعَوَّلِيْ وَ رَجاۤئِـيْ وَ تَوَكُّلِيْ، وَ بِرَحْمَتِكَ تَعَلُّقي، وَ بِفَنَاۤئِكَ اَحُطُّ رَحْلِيْ، وَ بِجُوْدِكَ اَقْصِدُ طَلِبَتِيْ، وَ بِكَرَمِكَ اَيْ رَبِّ اَسْتَفْتِحُ دُعَاۤئِـيْ، وَ لَدَيْكَ اَرْجُوْ فَاقَتِيْ، وَ بِغِنَاكَ اَجْبُرُ عَيْلَتِيْ، وَ تَحْتَ ظِلِّ عَفْوِكَ قِيَامِيْ، وَ اِلٰى جُوْدِكَ وَ كَرَمِكَ اَرْفَعُ بَصَرِيْ، وَ اِلٰى مَعْرُوْفِكَ اُدِيْمُ نَظَرِيْ، فَلَا تُحْرِقْنِيْ بِالنَّارِ وَ اَنْتَ مَوْضِعُ اَمَلي، وَ لَا تُسْكِنِّىِ الْهاوِيَةَ فَاِنَّكَ قُرَّةُ عَيْنِيْ، يَا سَيِّدِيْ لَا تُكَذِّبْ ظَنِّيْ بِاِحْسَانِكَ وَ مَعْرُوْفِكَ فَاِنَّكَ ثِقَتِيْ، وَ لَا تَحْرِمْنِيْ ثَوَابَكَ فَاِنَّكَ الْعَارِفُ بِفَقْرِيْ۔ اِلٰہِیْ اِنْ كَانَ قَدْ دَنَا اَجَلِيْ وَ لَمْ يُقَرِّبْنِيْ مِنْكَ عَمَلِيْ فَقَدْ جَعَلْتُ الْاِعْتِرَافَ اِلَيْكَ بِذَنْبِيْ وَسَاۤئِلَ عِلَلِيْ، اِلٰہِیْ اِنْ عَفَوْتَ فَمَنْ اَوْلٰى مِنْكَ بِالْعَفْوِ، وَ اِنْ عَذَّبْتَ فَمَنْ اَعْدَلُ مِنْكَ فِي الْحُكْمِ، اِرْحَمْ فِيْ هٰذِهِ الدُّنْيَا غُرْبَتِيْ، وَ عِنْدَ الْمَوْتِ كُرْبَتِيْ، وَ فِي الْقَبْرِ وَحْدَتِيْ، وَ فِيْ اللَّحْدِ وَحْشَتِيْ، وَ اِذَا نُشِرْتُ لِلْحِسَابِ بَيْنَ يَدَيْكَ ذُلَّ مَوْقِفِيْ، وَاغْفِرْ لِيْ مَا خَفِيَ عَلَى الْاٰدَمِيِّيْنَ مِنْ عَمَلِيْ، وَ اَدِمْ لِيْ مَا بِهِ سَتَرْتَنِيْ، وَ ارْحَمْنِيْ سَرِيْعًا عَلَى الْفِرَاشِ تُقَلِّبُنِيْ اَيْدِيْ اَحِبَّتِيْ، وَ تَفَضَّلْ عَلَيَّ مَمْدُوْدًا عَلَى الْمُغْتَسَلِ يُقَلِّبُنِيْ صَالِحُ جِيْرَتِيْ، وَ تَحَنَّنْ عَلَيَّ مَحْموُلًا قَدْ تَنَاوَلَ الْاَقْرِبَاۤءُ اَطْرَافَ جَنَازَتِيْ، وَ جُدْ عَلَيَّ مَنْقُوْلًا قَدْ نَزَلْتُ بِكَ وَحِيْدًا فِيْ حُفْرَتِيْ، وَ ارْحَمْ في ذٰلِكَ الْبَيْتِ الْجَدِيْدِ غُرْبَتِيْ، حَتّٰى لَا اَسْتَانِسَ بِغَيْرِكَ۔ يَا سَيِّدِيْ اِنْ وَكَلْتَنِيْ اِلٰى نَفْسِيْ هَلَكْتُ، سَيِّدِيْ فَبِمَنْ اَسْتَغِيْثُ اِنْ لَمْ تُقِلْنِيْ عَثَرْتِيْ، فَاِلىٰ مَنْ اَفْزَعُ اِنْ فَقَدْتُ عِنَايَتَكَ فِيْ ضَجْعَتِيْ، وَ اِلٰى مَنْ اَلْتَجِئُ اِنْ لَمْ تُنَفِّسْ كُرْبَتِيْ سَيِّدِيْ مَنْ لِيْ وَ مَنْ يَرْحَمُنِيْ اِنْ لَمْ تَرْحَمْنِيْ، وَ فَضْلَ مَنْ اُؤَمِّلُ اِنْ عَدِمْتُ فَضْلَكَ يَوْمَ فَاقَتِيْ، وَ اِلٰى مَنِ الْفِرَارُ مِنَ الذُّنُوْبِ اِذََا انْقَضٰى اَجَلِيْ، سَيِّدِيْ لَا تُعَذِّبْنِيْ وَ اَنَا اَرْجُوْكَ، اِلٰہِیْ حَقِّقْ رَجَاۤئِـيْ، وَ اٰمِنْ خَوْفِيْ، فَاِنَّ كَثْرَةَ ذُنُوْبِيْ لَا اَرْجُوْ فِيْهَا اِلَّا عَفْوَكَ، سَيِّدِيْ اَنَا اَسْئَلُكَ مَا لَا اَسْتَحِقُّ وَ اَنْتَ اَهْلُ التَّقْوٰى وَ اَهْلُ الْمَغْفِرَةِ، فَاغْفِرْ لِيْ وَ اَلْبِسْنِيْ مِنْ نَظَرِكَ ثَوْبًا يُغَطِّيْ عَلَيَّ التَّبِعَاتِ، وَ تَغْفِرُهَا لِيْ وَ لَا اُطَالَبُ بِهَا، اِنَّكَ ذُوْ مَنٍّ قَدِيْمٍ، وَ صَفْحٍ عَظِيْمٍ، وَ تَجَاوُزٍ كَرِيْمٍ۔ اِلٰہِیْ اَنْتَ الَّذِيْ تُفيضُ سَيْبَكَ عَلٰى مَنْ لَّا يَسْئَلُكَ وَ عَلَى الْجَاحِدِيْنَ بِرُبُوْبِيَّتِكَ، فَكَيْفَ سَيِّدِيْ بِمَنْ سَئَلَكَ وَ اَيْقَنَ اَنَّ الْخَلْقَ لَكَ، وَ الْاَمْرَ اِلَيْكَ، تَبَارَكْتَ وَ تَعَالَيْتَ يَا رَبَّ الْعَالَمِيْنَ۔ سَيِّدِيْ عَبْدُكَ بِبَابِكَ اَقَامَتْهُ الْخَصَاصَةُ بَيْنَ يَدَيْكَ يَقْرَعُ بَابَ اِحْسَانِكَ بِدُعَاۤئِهِ، فَلَا تُعْرِضْ بِوَجْهِكَ الْكَرِيْمِ عَنِّيْ، وَاقْبَلْ مِنِّيْ مَا اَقُوْلُ، فَقَدْ دَعَوْتُ بِهٰذَا الدُّعَاۤءِ وَ اَنَا اَرْجُوْ اَنْ لَّا تَرُدَّنِيْ، مَعْرِفَةً مِنِّيْ بِرَافَتِكَ وَ رَحْمَتِكَ، اِلٰہِیْ اَنْتَ الَّذِيْ لَا يُحْفِيْكَ سَاۤئِلٌ، وَ لَا يَنْقُصُكَ نَاۤئِلٌ، اَنْتَ كَمَا تَقُوْلُ وَ فَوْقَ مَا نَقُوْلُ۔ اَللّٰہُمَّ اِنِّيْ اَسْئَلُكَ صَبْرًا جَمِيْلًا، وَ فَرَجًا قَرِيْبًا، وَ قَوْلًا صَادِقًا، وَ اَجْرًا عَظِيْمًا، اَسْئَلُكَ يَا رَبِّ مِنَ الْخَيْرِ كُلِّهِ مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ اَعْلَمْ، اَسْئَلُكَ اللّٰہُمَّ مِنْ خَيْرِ مَا سَئَلَكَ مِنْهُ عِبَادُكَ الصَّالِحُوْنَ، يَا خَيْرَ مَنْ سُئِلَ، وَ اَجْوَدَ مَنْ اَعْطٰى، اَعْطِني سُؤْلِيْ فِيْ نَفْسِيْ وَ اَهْلِيْ وَ وَالِدَيَّ وَ وَلَدِيْ وَ اَهْلِ حُزَانَتِيْ وَ اِخْوَانِيْ فِيْكَ، وَ اَرْغِدْ عَيْشِيْ، وَ اَظْهِرْ مُرُوَّتِيْ، وَ اَصْلِحْ جَمِيْعَ اَحْوَالِيْ، وَاجْعَلْنِيْ مِمَّنْ اَطَلْتَ عُمْرَهُ، وَ حَسَّنْتَ عَمَلَهُ، وَ اَتْمَمْتَ عَلَيْهِ نِعْمَتَكَ، وَ رَضِيْتَ عَنْهُ وَ اَحْيَيْتَهُ حَيٰوةً طَيِّبَةً فِيْ اَدْوَمِ السُّرُوْرِ، وَ اَسْبَغِ الْكَرَامَةِ، وَ اَتَمِّ الْعَيْشِ، اِنَّكَ تَفْعَلُ مَا تَشَاۤءُ وَ لَا يَفْعَلُ مَا يَشَاۤءُ غَيْرُكَ۔ اَللّٰہُمَّ خُصَّنِيْ مِنْكَ بِخَاۤصَّةِ ذِكْرِكَ، وَ لَا تَجْعَلْ شَيْئًا مِمَّا اَتَقَرَّبُ بِهِ فِيْ اٰنَاۤءِ اللَّيْلِ وَ اَطْرَافِ النَّهَارِ رِيَاۤءً وَ لَا سُمْعَةً وَ لَا اَشَرًا وَ لَا بَطَرًا، وَ اجْعَلْنِيْ لَكَ مِنَ الْخَاشِعِيْنَ۔ اَللّٰہُمَّ اَعْطِنِى السِّعَةَ فِي الرِّزْقِ، وَ الْاَمْنَ فِي الْوَطَنِ، وَ قُرَّةَ الْعَيْنِ فِي الْاَهْلِ وَ الْمَالِ وَ الْوَلَدِ، وَ الْمُقَامَ فِيْ نِعَمِكَ عِنْدِيْ، وَ الصِّحَّةَ فِى الْجِسْمِ، وَ الْقُوَّةَ فِي الْبَدَنِ، وَ السَّلَامَةَ فِى الدِّيْنِ، وَاسْتَعْمِلْنِيْ بِطَاعَتِكَ وَ طَاعَةِ رَسُوْلِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَ اٰلِهِ اَبَدًا مَّا اسْتَعْمَرَتْنِيْ، وَاجْعَلْنِيْ مِنْ اَوْفَرِ عِبَادِكَ عِنْدَكَ نَصِيْبًا في كُلِّ خَيْرٍ اَنْزَلْتَهُ وَ تُنْزِلُهُ فِيْ شَهْرِ رَمَضَانَ فِيْ لَيْلَةِ الْقَدْرِ، وَ مَا اَنْتَ مُنْزِلُهُ فِيْ كُلِّ سَنَةٍ مِنْ رَحْمَةٍ تَنْشُرُهَا، وَ عَافِيَةٍ تُلْبِسُهَا، وَ بَلِيَّةٍ تَدْفَعُهَا، وَ حَسَنَاتٍ تَتَقَبَّلُهَا، وَ سَيِّئَاتٍ تَتَجَاوَزُ عَنْهَا، وَ ارْزُقْنِيْ حَجَّ بَيْتِكَ الْحَرَامِ فِيْ عَامِنَا هٰذَا وَ فِيْ كُلِّ عَامٍ، وَارْزُقْنِيْ رِزْقًا وَاسِعًا مِنْ فَضْلِكَ الْوَاسِعِ، وَ اصْرِفْ عَنِّيْ يَا سَيِّدِي الْاَسْوَاۤءَ، وَ اقْضِ عَنِّي الدَّيْنَ وَ الظُّلَامَاتِ، حَتّٰى لَا اَتَاَذّٰى بِشَيْئٍ مِنْهُ، وَ خُذْ عَنِّيْ بِاَسْمَاعِ وَ اَبْصَارِ اَعْدَاۤئِـيْ وَ حُسَّادِيْ وَ الْبَاغِيْنَ عَلَيَّ، وَ انْصُرْنِيْ عَلَيْهِمْ، وَ اَقِرَّ عَيْنِيْ وَ فَرِّحْ قَلْبِيْ، وَ اجْعَلْ لِيْ مِنْ هَمِّيْ وَ كَرْبِيْ فَرَجًا وَ مَخْرَجًا، وَ اجْعَلْ مَنْ اَرَادَنِيْ بِسُوْۤءٍ مِنْ جَمِيْعِ خَلْقِكَ تَحْتَ قَدَمَيَّ، وَاكْفِنِيْ شَرَّ الشَّيْطَانِ، وَ شَرَّ السُّلْطَانِ، وَ سَيِّئَاتِ عَمَلِيْ، وَ طَهِّرْنِيْ مِنَ الذُّنُوْبِ كُلِّهَا، وَ اَجِرْنِيْ مِنَ النَّارِ بِعَفْوِكَ، وَ اَدْخِلْنِى الْجَنَّةَ بِرَحْمَتِكَ، وَ زَوِّجْنِيْ مِنَ الْحُوْرِالْعِيْنِ بِفَضْلِكَ، وَ اَلْحِقْنِيْ بِاَوْلِيَاۤئِكَ الصَّالِحِيْنَ مُحَمَّدٍ وَ اٰلِهِ الْاَبْرَارِ الطَّيِّبِيْنَ الطَّاهِرِيْنَ الْاَخْيَارِ، صَلَوَاتُكَ عَلَيْهِمْ وَ عَلٰۤى اَجْسَادِهِمْ وَ اَرْوَاحِهِمْ وَ رَحْمَةُ اللهِ وَ بَرَكاتُهُ۔ اِلٰہِیْ وَ سَيِّدِيْ وَ عِزَّتِكَ وَ جَلَالِكَ لَئِنْ طَالَبَتْنِيْ بِذُنُوْبِيْ لَاُطَالِبَنَّكَ بِعَفْوِكَ، وَ لَئِنْ طَالَبَتْنِيْ بِلُؤْمِيْ لَاُطَالِبَنَّكَ بِكَرَمِكَ، وَ لَئِنْ اَدْخَلْتَنِى النَّارَ لَاُخْبِرَنَّ اَهْلَ النَّارِ بِحُبِّيْ لَكَ، اِلٰہِیْ وَ سَيِّدِيْ اِنْ كُنْتَ لَا تَغْفِرُ اِلَّا لِاَوْلِيَاۤئِكَ وَ اَهْلِ طَاعَتِكَ فَاِلٰى مَنْ يَفْزَعُ الْمُذْنِبُوْنَ، وَ اِنْ كُنْتَ لَا تُكْرِمُ اِلَّۤا اَهْلَ الْوَفَاۤءِ بِكَ فَبِمَنْ يَسْتَغيثُ الْمُسِيْۤئُوْنَ، اِلٰہِیْ اِنْ اَدْخَلْتَنِى النَّارَ فَفِيْ ذٰلِكَ سُرُوْرُ عَدُوِّكَ، وَ اِنْ اَدْخَلْتَنِىْ الْجَنَّةَ فَفِيْ ذٰلِكَ سُرُوْرُ نَبِيِّكَ، وَ اَنَا وَاللهِ اَعْلَمُ اَنَّ سُرُوْرَ نَبِيِّكَ اَحَبُّ اِلَيْكَ مِنْ سُرُوْرِ عَدُوِّكَ۔ اَللّٰہُمَّ اِنِّيْ اَسْئَلُكَ اَنْ تَمْلَاَ قَلْبِيْ حُبًّا لَكَ، وَ خَشْيَةً مِّنْكَ، وَ تَصْدِيْقًا بِكِتَابِكَ، وَ اِيْمَانًا بِكَ، وَ فَرَقًا مِنْكَ، وَ شَوْقًا اِلَيْكَ، يَا ذَاالْجَلَالِ وَ الْاِكْرَامِ حَبِّبْ اِلَيَّ لِقَاۤءَكَ وَ اَحْبِبْ لِقَاۤئِـيْ، وَ اجْعَلْ لِيْ فِيْ لِقَاۤئِكَ الرّاحَةَ وَ الْفَرَجَ وَ الْكَرَامَةَ۔ اَللّٰہُمَّ اَلْحِقْنِيْ بِصَالِحِ مَنْ مَضٰى، وَ اجْعَلْنِيْ مِنْ صَالِحِ مَنْ بَقِيَ وَ خُذْ بِيْ سَبِيْلَ الصّالِحِيْنَ، وَ اَعِنِّيْ عَلٰى نَفْسِيْ بِمَا تُعِيْنُ بِهِ الصَّالِحِيْنَ عَلٰى اَنْفُسِهِمْ، وَاخْتِمْ عَمَلِيْ بِاَحْسَنِهِ، وَاجْعَلْ ثَوَابِيْ مِنْهُ الْجَنَّةَ بِرَحْمَتِكَ، وَ اَعِنّي عَلٰى صَالِحٍ مَا اَعْطَيْتَنِيْ، وَ ثَبِّتْنِيْ يَا رَبِّ، وَ لَا تَرُدَّنِيْ فِيْ سُوْءٍ اِسْتَنْقَذْتَنِيْ مِنْهُ يَا رَبِّ الْعالَمِيْنَ۔ اَللّٰہُمَّ اِنِّيْ اَسْئَلُكَ اِيْمَانًا لَا اَجَلَ لَهُ دُوْنَ لِقَاۤئِكَ، اَحْيِنِيْ مَا اَحْيَيْتَنِيْ عَلَيْهِ وَ تَوَفَّنِيْ اِذَا تَوَفَّيْتَنِيْ عَلَيْهِ، وَ ابْعَثْنِيْ اِذَا بَعَثْتَنِيْ عَلَيْهِ وَاَبْرِءْ قَلْبِيْ مِنَ الرِّيَاۤءِ وَ الشَّكِّ وَ السُّمْعَةِ فِيْ دِيْنِكَ، حَتّٰى يَكُوْنَ عَمَلِيْ خَالِصًا لَكَ۔ اَللّٰہُمَّ اَعْطِنِيْ بَصِيْرَةً فِيْ دِيْنِكَ، وَ فَهْمًا فِيْ حُكْمِكَ، وَ فِقْهًا فِيْ عِلْمِكَ، وَ كِفْلَيْنِ مِنْ رَحْمَتِكَ، وَ وَرَعًا يَحْجُزُنِيْ عَنْ مَعَاصِيْكَ، وَ بَيِّضْ وَجْهِيْ بِنُوْرِكَ، وَاجْعَلْ رَغْبَتِيْ فِيْمَا عِنْدَكَ، وَ تَوَفَّنِيْ فِيْ سَبِيْلِكَ، وَ عَلٰى مِلَّةَ رَسُوْلِكَ صَلَّى اللهُ عَلَيْهِ وَ اٰلِهِ۔ اَللّٰہُمَّ اِنِّيْ اَعُوْذُبِكَ مِنَ الْكَسَلِ وَالْفَشَلِ وَالْهَمِّ وَ الْجُبْنِ وَ الْبُخْلِ وَ الْغَفْلَةِ وَ الْقَسْوَةِ وَ الْمَسْكَنَةِ وَ الْفَقْرِ وَ الْفاقَةِ وَ كُلِّ بَلِيَّةٍ، وَالْفَوٰاحِشِ مَا ظَهَرَ مِنْهَا وَ مَا بَطَنَ، وَ اَعُوْذُبِكَ مِنْ نَفْسٍ لَّا تَقْنَعُ، وَ بَطْنٍ لَّا يَشْبَعُ، وَ قَلْبٍ لَّا يَخْشَعُ، وَ دُعَاۤءٍ لَّا يُسْمَعُ، وَ عَمَلٍ لَّا يَنْفَعُ، وَ اَعُوْذُ بِكَ يَا رَبِّ عَلٰى نَفْسِيْ وَ دِيْنِيْ وَ مَالِيْ وَ عَلٰى جَمِيْعِ مَا رَزَقْتَنِيْ مِنَ الشَّيْطانِ الرَّجِيْمَ اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْمُ۔ اَللّٰہُمَّ اِنَّهُ لَا يُجِيْرُنِيْ مِنْكَ اَحَدٌ، وَ لَا اَجِدُ مِنْ دُوْنِكَ مُلْتَحَدًا، فَلَا تَجْعَلْ نَفْسِيْ فِيْ شَيْئٍ مِنْ عَذَابِكَ، وَ لَا تَرُدَّنِيْ بِهَلَكَةٍ وَ لَا تَرُدَّنِيْ بِعَذًابٍ اَلِيْمٍ۔ اَللّٰہُمَّ تَقَبَّلْ مِنِّيْ وَ اَعْلِ ذِكْرِيْ، وَارْفَعْ دَرَجَتِيْ، وَ حُطَّ وِزْرِيْ، وَلَا تَذْكُرْنِيْ بِخَطِيْئَتِيْ، وَاجْعَلْ ثَوَابَ مَجْلِسِيْ وَ ثَوَابَ مَنْطِقِيْ وَ ثَوابَ دُعَاۤئِـيْ رِضَاكَ وَالْجَنَّةَ، وَاعْطِنِيْ يَا رَبِّ جَمِيْعَ مَا سَئَلْتُكَ، وَ زِدْنِيْ مِنْ فَضْلِكَ، اِنِّيْ اِلَيْكَ رَاغِبٌ يَا رَبَّ الْعَالَمِيْنَ۔ اَللّٰہُمَّ اِنَّكَ اَنْزَلْتَ فِيْ كِتابِكَ اَنْ نَعْفُوَ عَمَّنْ ظَلَمَنَا، وَ قَدْ ظَلَمْنَا اَنْفُسَنَا فَاعْفُ عَنَّا، فَاِنَّكَ اَوْلٰى بِذٰلِكَ مِنَّا، وَ اَمَرْتَنَا اَنْ لَّا نَرُدَّ سَاۤئِلًا عَنْ اَبْوَابِنَا، وَ قَدْ جِئْتُكَ سَاۤئِلًا فَلَا تَرُدَّنِيْ اِلَّا بِقَضَاۤءِ حَاجَتِيْ، وَ اَمَرْتَنَا بِالْاِحْسَانِ اِلٰى مَا مَلَكَتْ اِيْمَانُنَا، وَ نَحْنُ اَرِقَّاۤؤُكَ فَاَعْتِقْ رِقَابَنَا مِنَ النَّارِ۔ يَا مَفْزَعِيْ عِنْدَ كُرْبَتِيْ، وَ يَا غَوْثِيْ عِنْدَ شِدَّتِيْ، اِلَيْكَ فَزِعْتُ وَ بِكَ اسْتَغَثْتُ وَ لُذْتُ، لَاۤ اَلُوْذُ بِسِوَاكَ وَلَا اَطْلُبُ الْفَرَجَ اِلَّا مِنْكَ، فَاَغِثْنِيْ وَ فَرِّجْ عَنِّيْ، يَا مَنْ يَّفُكُّ الْاَسِيْرَ، وَ يَعْفُوْ عَنِ الْكَثِيْرِ اِقْبِلْ مِنِّى الْيَسِيْرَ وَاعْفُ عَنِّى الْكَثِيْرَ، اِنَّكَ اَنْتَ الرَّحِيْمُ الْغَفُوْرُ۔ اَللّٰہُمَّ اِنِّيْ اَسْئَلُكَ اِيْمَانًا تُبَاشِرُ بِهِ قَلْبِيْ وَ يَقِيْنًا صَادِقًا حَتّٰى اَعْلَمَ اَنَّهُ لَنْ يُّصِيْبَنِيْ اِلَّا مَا كَتَبْتَ لِيْ، وَ رَضِّنِيْ مِنَ الْعَيْشِ بِمَا قَسَمْتَ لِيْ يَا اَرْحَمَ الرَّاحِمِيْنَ۔  `,

translation:`اے میرے معبود`,

reference:`<b>📚 کتاب:</b> مصباح المتهجد<br><b>✍️ مصنف:</b> شیخ الطوسی<br><b>📖 اصل ماخذ:</b> دعاء أبي حمزة الثمالي`
}




,
{
id:19,

title:"دعائے نور",

english:"Dua-e-Noor",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اَللّهُمَّ یانُورَ النَّورِ تَنَوَّرْتَ بِالنُّورِوَالنُّورُفی نُورِکَ یا نُورُ ، اللّهمَّ یاعَزیزُ تَعَزَّزْتَ بِالعَِّزةِ والعِزَّةُ فی عِزَّةِ عِزَّتِکَ یاعَزیزُ ، اَللّهُمَّ یا جَلیلُ تَجَلَّلْتَ بِالْجَلالِ والجَلالُ فی جَلالِ جَلالِکَ یا جَلیلُ اَللّهُمَّ یا قَدیمُ تَقَدَّمْتَ بِالْقِدَمِ وَالْقِدَمُ فی قِدَمِ قِدَمِکَ یاقَدیمُ ، اَللّهُمَّ یا قَدیرُ تَقَدَّرْتَ بِالْقُدْرَةِ وَالْقُدْرَةُ فی قُدْرَةِ قُدْرَتِکَ یا قَدیرُ اَللّهُمَّ یاوَهّابُ تَوَهَّبْتَ بِالْهَیْبَةِ وَالْهَیْبَةُ فِی هَیْبَةِ هَیْبَتِکَ یا وَهّاب اَللّهُمَّ یا عَلیْمُ تَعَلَّمْتَ بِالْعِلْمِ وَالْعِلْمُ فِی عِلْمِ عِلْمِکَ یا عَلیمُ اَللّهُمَّ یا حَکیمُ تَحَکَّمْتَ بِالْحِکْمَةِ وَالْحِکْمَةُ فِی حِکْمَةِ حِکْمَتِکَ یا حَکیمُ اَللّهُمَّ یامالِکُ تَمَلَّکْتَ بِالْمُلْکِ وَالْمَلَکُوتُ فِی مَلَکوتِ مَلَکوتِکَ یا مالِکُ اَللّهُمَّ یا قُدُّوسُ تَقَدَّسْتَ بِالْقُدْسِ وَالقُدْسُ فِی قُدْسِ قُدْسِکَ یا قُدّوسُ اَللّهُمَّ یا صَبُورُ تَصَبَّرْتَ بِالْصَبْرِ وَالْصَبْرُ فِی صَبْرِ صَبْرِکَ یا صَبور ، اَللّهُمَّ یا مَنّانُ تَمَنَّنْتَ بِالْمِنَّةِ وَالْمِنَّةُ فِی مِنَّتِ مِنَّتِکَ یا مَنّانُ اَللّهُمَّ یا فَرْدُ تَفَرَّدْتَ بِالْفَرْدِ وَالْفَرْدُ فِی فَرْدِ فَرْدِکَ یا فَرْدُ اَللّهُمَّ یا واحِِِِدُ تَوَحَّدْتَ بِالْوَحْدانِیَّةِ والْوَحْدانِیَّةُ فِی وَحدانیَّةِ وَحْدانیَّتِکَ یا واحِدُ اَللّهُمَّ یا جَمیلُ تَجَمَّلْتَ بِالْجَمالِ وَالْجَمالُ فِی جَمالِ جَمالِکَ یا جَمیلُ، اَللّهُمَّ یاسَلامُ تَسَلَّمْتَ بِالْسَّلامِ وَالْسَّلامُ فِی سَلامِ سَلامِکَ یا سَلامُ ، اَللّهُمَّ یارَبِّ تَرََبَّیْتَ بِالْرُّبُوبِیَّةِ والْرُّبُوبِیَّةُ فِی رُبُوبِیَّةِ رُبوبِیَّتِکَ یا رَبُُّ، اَللّهُمَّ یاقَهّارُ تَقَهَّرْتَ بِالْقَهْرِ وَالْقَهْرُ فِی قَهْرِ قَهْرُکَ یا قَهّارُ ، اَللّهُمَّ یا جَبّارُتَجَبَّرْتَ بِالْجَبَروتِ وَالْجَبَروتُ فِی جَبَروتِ جَبَروتِکَ یاجَبّارُ، اَللّهُمَّ یا کَریمُ تَکَرَّمْتَ بِالْکَرَمِ وَالْکَرَمُ فِی کَرَمِ کَرَمِکَ یا کَریمُ، اَللّهُمَّ یاکَبیرُتَکَبَّرْتَ بِالْکِبْرِیاءِ وَالْکِبْرِیاءُ فِی کِبْرِیاءِ کِبْرِیائِکَ یا کَبیرُ، اَللّهُمَّ یا رَحیمُ تَرَحَّمْتَ بِالرَّحْمَةِ وَالرَحْمَةُ فِی رَحْمَةِ رَحْمَتِکَ یا رَحیمُ ،اَللّهُمَّ یا عَظیمُ تَعَظَّمْتَ بِالْعَظَمَةِ والعَظَمَةُ فی عَظَمَةِ عَظَمَتِکَ یا عَظیمُ ، اَللّهُمَّ یا مَجیدُ تَمَجَّدْتَ بِالْمَجْدِ وَالْمَجْدُ فِی مَجْدِ مَجْدِکَ یا مَجیدُ ، اَللّهُمَّ یا حَلیمُ تَحَمَّلْتَ بِالْحِلمِ وَالْحِلْمُ فِی حِلْمِ حِلْمِکَ یا حَلیمُ ، اَللّهُمَّ لااله الّا اَنْتَ ،اِنَّکَ عَلی کُلِّ شَیءٍ قَدیرٌ، سُبْحانَ الْقَهّارِ ،سُبحانَ الْغَفّارِ، سُبحانَ الْقادِرِ، سُبحانَ العزیزِ، سُبحانَ الحَیِّ، سُبحانَ القیومِ سُبحانَ القاهرِ، سُبحانَ الجَبّارِ، سُبحانَ الصَّبِیرِ، سُبحانَ الجَبّارِالْوَهّابِ، سُبحانَ المانِع، سُبحانَ المُبِینِ ، سُبحانَ الشّافِیِ، سُبحانَ الْکافِیِ، سُبحانَ الْمُعافِیِ ، سُبحانَ الْمؤمِنِ، سُبحانَ المُهَیْمِنِ سُبحانَ الْماجِدِ، سُبحانَ الواحِدِ، سُبحانَ الاَحَدِ، سُبحانَ الرَّحْمنِ، سُبحانَ الجَلِیلِ، سُبحانَ الکَریمِ، سُبحانَ المُقَدِّمِ، سُبحانَ الْمُؤَخِّرِ، سُبحانَ الَاوَّلِ، سُبحانَ الْآخِِِرِ، سُبحانَ الظّاهِرِ، سُبحانَ الْباطِنِ ،سُبحانَ الْوافِیِ ، سُبحانَ الغَنیِّ، سُبحانَ المُغنِیِّ، سُبحانَ المُقَدِّرِ، سُبحانَ النُّورِ، سُبحانَ الْهادیِ، سُبحانَ الجَلیلِ، سُبحانَ المُجِیبِ، سُبحانَ اللهِ وَالْحَمْدُلِلّهِ ولااِلهَ الّااللهُ وَاللهُ اَکبر، سُبحانَ اللهِ المُسَمّی قَبْلَ اَنْ یُسَمّی سُبحانَ الْعَلِیِّ الْاَعْلی ، سُبحانَ اللهِ وتَعالی عَمّا یَقولُونَ عُلُواً کَبیرا، سُبحانَ ذِی الْمُلْکِ وَالْمَلَکوتِ، سُبحانَ ذِی الْعِزَّةِ وَالعَظَمَةِ وَالْهَیْبَةِ وَالْقُدْرَةِ وَالْکِبرِیاءِ وَالْجَلالِ وَالْجَبَروتِ، سُبحانَ الْمَلِکِ الْمَعْبود، سُبحانَ الْمَلِکِ المَقصود، سُبحانَ الْمَلِکِ الْحَیِّ الْعَلیمِ الْحَکیمِ الَّذی لایَنامُ ولایَفوتُ اَبَداً دائِماً باقِیاً سُبُّوحٌ قُدُّوسٌ رَبُّنا وَ رَبُّ الْمَلائِکَةِ وَالْرّوحِ لاِالهَ اِلّااللهُ وَحْدَهُ لاشَریکَ لَه , لَهُ الْمُلْکُ وَلَهُ الْحَمْدُ وَهوَعَلی کُلِّ شَی ءٍ قَدیرٌ، یاحَیُّ یاقَیُّومُ یاذَالْجَلالِ وَالْاِکرامِ لاالهَ اِلّا هُوَ ،عَلیهِ وَتَوَکَّلْتُ وَهُوَرَبُّ الْعَرْشِ الْعَظیمِ وَلاحَوْلَ وَلاقُوَّةَ اِلّابِاللهِ الْعَلِیِّ الْعَظیمِ بِرَحْمَتِکَ یااَرْحَمَ اْلراحِمِینَ ،لااِلهَ اِلّااللهُ الْحَلِیمُ الْکَریمُ لااِلهَ اِلّااللهُ العَلِیُّ الْعَظیمُ سُبحانَ اللهِ رَبِّ الْسَّمواتِ السَّبْعِ وَرَبِّ الْاَرَضینَ الْسَّبْعِ وَما فِیهِنَّ وَمابَینَهُنَّ وَرَبِّ الْعَرْشِ الْعَظیمِ وَالْْحَمدُ لِلّهِ رَبِّ الْعالَمِینِ . یا مَن اَظْهَرَالْجَمیلَ وَسَتَرَ الْقَبِیحَ، یا مَنْ لَمْ یُؤاخِذْ بِالْجَریرَةِ وَلَم یَهْتِکِ الْسِِّتْرَ یا عَظیمَ الْعَفو یا حَسَنَ التَّجاوُزِ یا واسِعَ الْمَغفِرَةِ وَ یا باسِطَ الْیَدَیْنِ بِالرََّحْمَةِ یا صاحِبَ کُلِّ نَجْوی وَیا مُنْتَهی کُلِّ شَکْوی وَ یا مُفَرِّجَ کُلِّ کُرْبَةٍ یا مُقِیلَ کُلِّّ عَثْرَةٍ یا کَریمَ الصَفْحِ یا عَظیمَ الْمَنِّ یا مُبْتَدِءً بِالنِّعَمِ قَبْلَ اِسْتِحْقاقِها یا رَ بّاهُ یا سَیّداهُ یا غَایَةَ رَغْبَتاهُ اَسْئَلُکَ بِکَ وَبِمُحَمَّدٍ وَعَلِیٍٍّ وَفاطِمَةَ وَالْحَسَنِ وَالْحُسینِ وَعَلی بنِ الْحُسَین وَمُحَمَّد بنِ عَلی وَجَعْفَرِبنِ مُحَمَّدٍ وَمُوسَی بنِ جَعْفَرٍ وَعَلیِّ بنِ مُوسی وَمُحَمَّدٍ بن عَلیٍٍّ وعَلیِّ بنِ مُحَمَّدٍ والحَسَنِ بن عَلیٍِ وَالْقائِمِ المَهْدِیِّ، اَلْاَئِمَّةِ الْهادِیةِ عَلَیْهِمُ الْسَّلامُ اَنْ تُصَلّیَ عَلی مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَاَسْئَلُکَ یا اللهُ یااللهُ لاتُشَوِّهَ خَلْقِی بِالْنّارِ وَ اَن تَفْعَلَ بِی ما اَنْتَ اَهْلُهُ بِرَحْمَتِکَ یا اَرْحَمَ الرّاحِمِینَ.  `,

translation:`اللہ نور ہے`,

reference:`<b>📚 کتاب:</b> بلد الأمین<br><b>✍️ مصنف:</b> ابراہیم بن علی کفعمی<br><b>📖 اصل ماخذ:</b> دعاء النور`
}




,
{
id:20,

title:"دعائے حزب البحر",

english:"Dua-e- Baha",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` 
اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ بَهائِكَ بأَبْهاهُ وَكُلُّ بَهائِكَ بَهِيٌّ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِبَهائِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ جَمالِكَ بِأَجْمَلِهِ وَكُلُّ جَمالِكَ جَميلٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِجَمالِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ جَلالِكَ بِأَجَلِّهِ وَكُلُّ جَلالِكَ جَليلٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِجَلالِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عَظَمَتِكَ بِأَعْظَمِها وَكُلُّ عَظَمَتِكَ عَظَيمَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِعَظَمَتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسَأَلُكَ مِنْ نُورِكَ بِأَنْوَرِهِ وَكُلُّ نُورِكَ نَيِّرٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِنُورِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ رَحْمَتِكَ بِأَوْسَعِها وَكُلُّ رَحْمَتِكَ واسِعَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كَلِماتِكَ بِأَتَمِّها وَكُلُّ كَلِماتِكَ تامَّةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِكَلِماتِكَ كُلِّهَا، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كَمالِكَ بِأَكْمَلِهِ وَكُلُّ كَمَالِكَ كامِلٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِكَمالِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ أَسمائِكَ بِأَكْبَرِها وَكُلُّ أَسْمائِكَ كَبيرَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِأَسْمائِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عِزَّتِكَ بأَعَزِّها وَكُلُّ عِزَّتِكَ عَزيزَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِعِزَّتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَشِيْئَتِكَ بِأَمْضاها وَكُلُّ مَشِيْئَتِكَ ماضِيَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِمَشِيْئَتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ قُدْرَتِكَ بِالْقُدْرَةِ الَّتي اسْتَطَلْتَ بِها عَلَى كُلِّ شَيْءٍ وَكُلُّ قُدْرَتِكَ مُسْتَطيلَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِقُدْرَتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عِلْمِكَ بِأَنْفَذِهِ وَكُلُّ عِلْمِكَ نافِذٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِعِلْمِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ قَوْلِكَ بِأَرْضاهُ وَكُلُّ قَوْلِكَ رَضِيٌّ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِقَوْلِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَسائِلِكَ بِأَحَبِّها اِلَيْكَ وَكُلُّ مَسائِلِكَ اِلَيْكَ حَبيبَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِمَسائِلِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ شَرَفِكَ بِأَشْرَفِهِ وَكُلُّ شَرَفِكَ شَريفٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِشَرَفِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ سُلْطانِكَ بِأَدْوَمِهِ وَكُلُّ سُلْطانِكَ دائِمٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِسُلْطانِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مُلْكِكَ بِأَفْخَرِهِ وَكُلُّ مُلْكِكَ فاخِرٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِمُلْكِكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عُلُوِّكَ بِأَعْلاهُ وَكُلُّ عُلُوِّكَ عالٍ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِعُلُوِّكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَنِّكَ بِأَقْدَمِهِ وَكُلُّ مَنِّكَ قَديمٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِمَنِّكَ كُلِّهِ، اَللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ آياتِكَ بِأَكْرَمِها وَكُلُّ آياتِكَ كَريمَةٌ، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِآياتِكَ كُلِّها، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِما أَنْتَ فيهِ مِنَ الشَّأنِ وَالْجَبَرُوتِ، وَأَسْأَلُكَ بِكُلِّ شَأْنٍ وَحْدَهُ وجَبَرُوتٍ وَحْدَها، اَللّهُمَّ إِنِّي أَسْأَلُكَ بِما تُجيبُني بِهِ حينَ أَسْأَلُكَ فَأَجِبْني يا اَللهُ.  `,

translation:`اللہ میرے لیے کافی ہے`,

reference:`<b>📚 کتاب:</b> مہج الدعوات<br><b>✍️ مصنف:</b> سید ابن طاؤس<br><b>📖 اصل ماخذ:</b> دعاء حزب البحر`
}






,
{
id:21,

title:"دعائے عشرات",

english:"Dua-e-Asharat",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`  
سُبحانَ اللهِ وَالحَمدُ للهِ وَلا إلهَ إلاّ الله وَاللهُ أكبَرُ، وَلا حَولَ وَلا قُوَّةَ إلاّ بِاللهِ العَليِّ العَظيمِ، سُبحانَ اللهِ آناءَ اللَّيلِ وَأطرافَ النَّهارِ، سُبحانَ اللهِ بِالغُدُوِّ وَالآصالِ، سُبحانَ اللهِ بِالعَشيِّ وَالإبكارِ، سُبحانَ اللهِ حينَ تُمسونَ وَحينَ تُصبِحونَ، وَلَهُ الحَمدُ في السَّماواتِ وَالأرضِ وَعَشياً وَحينَ تُظهِرونَ، يُخرِجُ الحَيَّ مِنَ المَيِّتِ ، وَيُخرِجُ المَيِّتَ مِنَ الحَيِّ، وَيُحيي الأرضَ بَعدَ مَوتِها، وَكَذلِكَ تُخرَجونَ، سُبحانَ رَبِّكَ رَبِّ العِزَّةِ عَمّا يَصِفونَ، وَسَلامٌ عَلى المُرسَلينَ، وَالحَمدُ للهِ رَبِّ العالَمينَ، سُبحانَ ذي المُلكِ وَالمَلَكوتِ، سُبحانَ ذي العِزَّةِ وَالجَبَروتِ، سُبحانَ ذي الكِبرياءِ وَالعَظَمَةِ المَلِكِ الحَقِّ المُهَيمِنِ القُدّوسِ، سُبحانَ اللهِ المَلِكِ الحَيِّ الَّذي لا يَموتُ، سُبحانَ اللهِ المَلِكِ الحَيِّ القُدّوسِ، سُبحانَ القائِمِ الدَّائِمِ، سُبحانَ الدَّائِمِ القائِمِ، سُبحانَ رَبّيَ العَظيمِ، سُبحانَ رَبّيَ الأعلى، سُبحانَ الحَيِّ القَيّومِ، سُبحانَ العَليِّ الأعلى، سُبحانَهُ وَتَعالى، سُبّوحٌ قُدّوسٌ رَبُّنا وَرَبُّ المَلائِكَةِ وَالرّوحِ، سُبحانَ الدائِمِ غَيرِ الغافِلِ، سُبحانَ العالِمِ بِغَيرِ تَعليمٍ، سُبحانَ خالِقِ ما يُرى وَما لا يُرى، سُبحانَ الَّذي يُدرِكُ الأبصارَ وَلا تُدرِكُهُ الأبصارُ، وَهُوَ اللَّطيفُ الخَبيرُ.
اللَّهُمَّ إنّي أصبَحتُ مِنكَ في نِعمَةٍ وَخَيرٍ وَبَرَكَةٍ وَعافيَةٍ فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ، وَأتمِم عَلَيَّ نِعمَتَكَ وَخَيرَكَ وَبَرَكاتِكَ وَعافيَتِكَ بِنَجاةٍ مِنَ النَّارِ، وَارزُقني شُكرَكَ وَعافيَتِكَ وَفَضلَكَ وَكَرامَتَكَ أبَداً ما أبقَيتَني.
اللَّهُمَّ بِنورِكَ اهتَدَيتُ، وَبِفَضلِكَ استَغنَيتُ، وَبِنِعمَتِكَ أصبَحتُ وَأمسَيتُ. اللَّهُمَّ إنّي اُشهِدُكَ وَكَفى بِكَ شَهيداً، وَاُشهِدُ مَلائِكَتَكَ وَأنبيائَكَ وَرُسُلَكَ، وَحَمَلَةَ عَرشِكَ، وَسُكّانَ سَماواتِكَ وَأرضِكَ وَجَميعَ خَلقِكَ، بِأنَّكَ أنتَ اللهُ لا إلهَ إلاّ أنتَ، وَحدَكَ لا شَريكَ لَكَ، وَأنَّ مُحَمَّداً (صلّى الله عليه و آله) عَبدُكَ وَرَسولُكَ، وَأنَّكَ عَلى كُلِّ شَيءٍٍ قَديرٌ، تُحيي وَتُميتُ، وَتُميتُ وَتُحيي، وَأشهَدُ أنَّ الجَنَّةَ حَقٌ، وَأنَّ النّارَ حَقٌ وَالنُشورَ حَقُّ، وَالسّاعَةَ آتيَةٌ لارَيبَ فيها وَأنَّ الله يَبعَثُ مَن في القُبورِ وَأشهَدُ أنَّ عَليَّ ابنَ أبي طالِبٍ أميرُ المؤُمِنينَ حَقّاً حَقّاً، وَأنَّ الأئِمَّةَ مِن وُلدِهِ هُمُ الأئِمَّةُ الهُداةُ المَهديّونَ، غَيرُ الضّالّينَ وَلا المُضِلّينَ، وَأنَّهُم أولياؤُكَ المُصطَفَونَ، وَحِزبُكَ الغالِبونَ، وَصَفوَتُكَ وَخِيَرَتُكَ مِن خَلقِكَ، وَنُجَباؤُكَ الَّذينَ انتَجَبتَهُم لِدينِكَ، وَاختَصَصَتُهم مِن خَلقِكَ، وَاصطَفَيتَهُم عَلى عِبادِكَ، وَجَعَلتَهُم حُجَّةً عَلى العالَمينَ صَلَواتُكَ عَلَيهِم وَالسَّلامُ وَرَحمَةُ الله وَبَرَكاتُهُ. اللَّهُمَّ اكتُب لي هذِهِ الشَّهادَةَ عِندَكَ حَتَّى تُلَقِّنِّيها يَومَ القيامة وَأنتَ عَنّي راضٍ إنَّكَ عَلى ما تَشاءُ قَديرٌ.
اللَّهُمَّ لَكَ الحَمدُ حَمداً يَصعَدُ أوَّلُهُ وَلا يَنفَدُ آخِرُهُ. اللَّهُمَّ لَكَ الحَمدُ حَمداً تَضَعُ لَكَ السَّماء كَنَفَيها ، وَتُسَبِّحُ لَكَ الأرضُ وَمَن عَلَيها. اللَّهُمَّ لَكَ الحَمدُ حَمداً سَرمَداً أبَداً لا انقِطاعَ لَهُ وَلا نَفادَ وَلَكَ يَنبَغي وإلَيكَ يَنتَهي، فيَّ وَعَلَيَّ وَلَدَيَّ وَمَعي وَقَبلي وَبَعدي وَأمامي وَفَوقي وَتَحتي، وَإذا مِتُّ وَبَقيتُ فَرداً وَحيداً ثمّ فَنيتُ، وَلَكَ الحَمدُ إذا نُشِرتُ وَبُعِثتُ، يا مَولايَ. اللَّهُمَّ وَلَكَ الحَمدُ وَلَكَ الشُّكرُ بِجَميعِ مَحامِدِكَ كُلِّها عَلى جَميعِ نَعمائِكَ كُلِّها حَتَّى يَنتَهي الحَمدُ إلى ما تُحِبُّ رَبَّنا وَتَرضى.
اللَّهُمَّ لَكَ الحَمدُ عَلى كُلِّ أكلَّةٍ وَشَربَةٍ وَبَطشَةٍ وَقَبضَةٍ وبَسطَةٍ، وَفي كُلِّ مَوضِعِ شَعرَةٍ. اللَّهُمَّ لَكَ الحَمدُ حَمداً خالِداً مَعَ خُلودِكَ وَلَكَ الحَمدُ حَمداً لا مُنتَهى لَهُ دونَ عِلمِكَ وَلَكَ الحَمدُ حَمداً لا أمَدَ لَهُ دونَ مَشيئَتِكَ وَلَكَ الحَمدُ حَمداً لا أجرَ لِقائِلِهِ إلاّ رِضاكَ، وَلَكَ الحَمدُ عَلى حِلمِكَ بَعدَ عِلمِكَ، وَلَكَ الحَمدُ عَلى عَفوِكَ بَعدَ قُدرَتِكَ، وَلَكَ الحَمدُ باعِثَ الحَمدِ، وَلَكَ الحَمدُ وَارِثَ الحَمدِ، وَلَكَ الحَمدُ بَديعَ الحَمدِ، وَلَكَ الحَمدُ مُنتَهى الحَمدِ، وَلَكَ الحَمدُ مُبتَدِعَ الحَمدِ، وَلَكَ الحَمدُ مُشتَريَ الحَمدِ، وَلَكَ الحَمدُ وَليَّ الحَمدِ، وَلَكَ الحَمدُ قِديمَ الحَمدِ، وَلَكَ الحَمدُ صادِقَ الوَعدِ، وَفيَّ العَهدِ، عَزيزَ الجُندِ، قائِمَ المَجدِ، وَلَكَ الحَمدُ رَفيعَ الدَّرَجاتِ مُجيبَ الدَّعَواتِ، مُنزِلَ الآيات مِن فَوقِ سَبعِ سَماواتٍ عَظيمَ البَرَكاتِ، مُخرِجَ النّورِ مِنَ الظُّلُماتِ، وَمُخرِجَ مَن في الظُّلُماتِ إلى النّورِ، مُبَدِّلَ السَّيِّئاتِ حَسَناتٍ وَجاعِلَ الحَسَناتِ دَرَجاتٍ.
اللَّهُمَّ لَكَ الحَمدُ غافِرَ الذَّنبِ وَقابِلَ التَّوبِ، شَديدَ العِقابِ ذا الطَّولِ لا إلهَ إلاّ أنتَ إلَيكَ المَصيرُ. اللَّهُمَّ لَكَ الحَمدُ في اللَّيلِ إذا يَغشى، وَلَكَ الحَمدُ في النَّهارِ إذا تَجَلَى وَلَكَ الحَمدُ في الآخرةِ وَالاُولى، وَلَكَ الحَمدُ عَدَدَ كُلِّ نَجمٍ وَمَلَكٍ في السَّماء، وَلَكَ الحَمدُ عَدَدَ الثَّرى وَالحَصى وَالنَّوى، وَلَكَ الحَمدُ عَدَدَ ما في جَوِّ السَّماء، وَلَكَ الحَمدُ عَدَدَ ما في جَوفِ الأرضِ، وَلَكَ الحَمدُ عَدَدَ أوزانِ ميا هِ البِحارِ، وَلَكَ الحَمدُ عَدَدَ أوراقِ الأشجارِ، وَلَكَ الحَمدُ عَدَدَ ما عَلى وَجهِ الأرضِ، وَلَكَ الحَمدُ عَدَدَ ما أحصى كِتابُكَ، وَلَكَ الحَمدُ عَدَدَ ما أحاطَ بِهِ عِلمُكَ، وَلَكَ الحَمدُ عَدَدَ الإنسِ وَالجِنِّ، وَالهَوامِّ وَالطَّيرِ وَالبَهائِمِ والسِّباعِ حَمداً كَثيراً طَيِّباً مُبارَكاً فيهِ كَما تُحِبُّ رَبَّنا وَتَرضى، وَكَما يَنبَغي لِكَرَمِ وَجهِكَ وَعِزِّ جَلالِكَ.

ثمّ تقول عشراً: لا إلهَ إلاّ الله وَحدَهُ لا شَريكَ لَهُ، لَهُ المُلكُ وَلَهُ الحَمدُ، وَهُوَ اللَطيفُ الخَبيرُ.
وعشراً: لا إلهَ إلاّ الله وَحدَهُ لا شَريكَ لَهُ، لَهُ المُلكُ وَلَهُ الحَمدُ، يُحيي وَيُميتُ، وَيُميتُ وَيُحيي، وَهُوَ حَيُّ لا يَموتُ بيَدِهِ الخَيرُ وَهُوَ عَلى كُلِّ شيءٍ قَديرٌ.
وعشراً: أستَغفِرُ اللهَ الَّذي لا إلهَ إلاّ هُوَ الحَيُّ القَيّومُ وَأتوبُ إلَيهِ.
وعشراً: يا اللهُ يا اللهُ
وعشراً: يا رَحمنُ يا رَحمنُ
وعشراً: يا رَحيمُ يا رَحيمُ
وعشراً: يا بَديعَ السَّماواتِ وَالأرضِ
وعشراً: يا ذا الجَلالِ وَالإكرامِ
وعشراً: يا حَنّانُ يا مَنَّانُ
وعشراً: يا حَيُّ يا قَيّومُ
وعشراً: يا حَيُّ لا إلهَ إلاّ أنتَ
وعشراً: يا اللهُ يا لا إلهَ إلاّ أنتَ
وعشراً: بِسمِ الله الرَّحمنِ الرَّحيمِ
وعشراً: اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ
وعشراً: اللَّهُمَّ افعَل بي ما أنتَ أهلُهُ
وعشراً: آمينَ آمينَوعشراً: قُلْ هُوَ اللهُ أحَدٌ.

ثمّ تقول:
اللَّهُمَّ اصنَع بي ما أنتَ أهلُهُ ، وَلا تَصنَع بي ما أنا أهلُهُ، فَإنَّكَ أهلُ التَّقوى وَأهلُ المَغفِرَةِ، وَأنا أهلُ الذُّنوبِ وَالخطايا، فَارحَمني يا مولايَ وَأنتَ أرحَمُ الرَّاحِمينَ.
وأيضاً تقول عشراً: لاحَولَ وَلا قوَّةَ إلاّ بِالله ، تَوَكَّلتُ عَلى الحَيّ الَّذي لايَموتُ، وَالحَمدُ للهِ الَّذي لَم يَتَّخِذ وَلَداً، وَلَم يَكُن لَهُ شَريكٌ في المُلكِ، وَلَم يَكُن لَهُ وَليُّ مِنَ الذُّلِّ وَكَبِّرهُ تَكبيراً.  `,

translation:`اللہ پاک ہے`,

reference:`<b>📚 کتاب:</b> مصباح المتهجد<br><b>✍️ مصنف:</b> شیخ الطوسی<br><b>📖 اصل ماخذ:</b> دعاء العشرات`
}






,
{
id:22,

title:"دعائے قنوت",

english:"Dua-e-Qunut",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` لَا إِلٰهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ
لَا إِلٰهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ
سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَرَبِّ الْأَرَضِينَ السَّبْعِ وَمَا فِيهِنَّ وَمَا بَيْنَهُنَّ وَرَبِّ الْعَرْشِ الْعَظِيمِ
وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ  `,

translation:` اللہ کے سوا کوئی معبود نہیں وہ نہایت بردبار اور بہت بزرگی والا ہے۔

اللہ کے سوا کوئی معبود نہیں وہ بلند مرتبہ اور عظمت والا ہے۔

پاک ہے اللہ جو ساتوں آسمانوں کا رب ہے اور ساتوں زمینوں کا رب ہے اور جو کچھ ان کے اندر ہے اور جو کچھ ان کے درمیان ہے سب کا رب ہے اور عرشِ عظیم کا رب ہے۔

اور تمام تعریفیں اللہ ہی کے لیے ہیں جو تمام جہانوں کا پروردگار ہے۔ `,

reference:`<b>📚 کتاب:</b> من لا يحضره الفقيه<br><b>✍️ مصنف:</b> شیخ صدوق<br><b>📖 اصل ماخذ:</b> أدعية القنوت`
}


,
{
id:23,

title:"دعائے حفظ",

english:"Dua-e-Hifz",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` أَعُوذُ بِعِزَّةِ اللَّهِ
وَأَعُوذُ بِقُدْرَةِ اللَّهِ
وَأَعُوذُ بِجَلَالِ اللَّهِ
وَأَعُوذُ بِجَمَالِ اللَّهِ
وَأَعُوذُ بِسُلْطَانِ اللَّهِ
وَأَعُوذُ بِرَحْمَةِ اللَّهِ
وَأَعُوذُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ
مِنْ شَرِّ مَا أَحْذَرُ وَمِنْ شَرِّ مَا لَا أَحْذَرُ`,

translation:`  اللہ کے نام سے جو نہایت مہربان ہمیشہ رحم کرنے والا ہے۔

میں اللہ کی عزت کی پناہ مانگتا ہوں۔
میں اللہ کی قدرت کی پناہ مانگتا ہوں۔
میں اللہ کی جلالت کی پناہ مانگتا ہوں۔
میں اللہ کے جمال کی پناہ مانگتا ہوں۔
میں اللہ کے اقتدار کی پناہ مانگتا ہوں۔
میں اللہ کی رحمت کی پناہ مانگتا ہوں۔
اور میں اللہ کے رسول صلی اللہ علیہ وآلہ وسلم کی پناہ لیتا ہوں۔
ہر اس چیز کے شر سے جس سے میں ڈرتا ہوں اور ہر اس چیز کے شر سے بھی جس سے میں نہیں ڈرتا۔   `,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء للحفظ`
}




,
{
id:24,

title:"دعائے رزق",

english:"Dua-e-Rizq",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` اللَّهُمَّ ارْزُقْنِي رِزْقًا وَاسِعًا حَلَالًا طَيِّبًا مِنْ غَيْرِ كَدٍّ
وَاسْتَجِبْ دُعَائِي مِنْ غَيْرِ رَدٍّ
وَأَعُوذُ بِكَ مِنَ الْفَقْرِ وَالدَّيْنِ  `,

translation:` اے اللہ! مجھے وسیع پاکیزہ اور حلال رزق عطا فرما بغیر مشقت کے۔
میری دعا کو قبول فرما بغیر رد کیے۔
اور مجھے محتاجی اور قرض سے اپنی پناہ میں رکھ۔      `,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء لطلب الرزق`
}







,
{
id:25,

title:"دعائے شفا",

english:"Dua-e-Shifa",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` اللَّهُمَّ اشْفِنِي بِشِفَائِكَ
وَدَاوِنِي بِدَوَائِكَ
وَعَافِنِي مِنْ بَلَائِكَ  `,

translation:` اے اللہ!
مجھے اپنی شفا سے شفا عطا فرما۔
اپنی دوا سے میرا علاج فرما۔
اور مجھے اپنی طرف سے آنے والی آزمائشوں سے عافیت عطا فرما۔      `,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء للمريض والشفاء`
}




,
{
id:26,

title:"دعائے سفر",

english:"Dua-e-Safar",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` بِسْمِ اللَّهِ آمَنْتُ بِاللَّهِ
تَوَكَّلْتُ عَلَى اللَّهِ
مَا شَاءَ اللَّهُ
لَا قُوَّةَ إِلَّا بِاللَّهِ
اللَّهُمَّ إِنِّي أَسْأَلُكَ فِي سَفَرِي هَذَا السَّلَامَةَ
وَالْعَافِيَةَ
وَالْحِفْظَ فِي نَفْسِي وَأَهْلِي وَمَالِي  `,

translation:`       اللہ کے نام سے۔
میں اللہ پر ایمان لایا۔
میں نے اللہ پر بھروسہ کیا۔
جو اللہ چاہے وہی ہوتا ہے۔
اللہ کے سوا کوئی طاقت اور قوت نہیں۔
اے اللہ! میں اپنے اس سفر میں تجھ سے سلامتی عافیت اور اپنی جان اپنے اہل و عیال اور اپنے مال کی حفاظت کا سوال کرتا ہوں۔`,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء عند السفر`
}





,
{
id:27,

title:"دعائے رفعِ کرب",

english:"Dua-e-Karb",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` لَا إِلٰهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ
لَا إِلٰهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ
سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ
وَرَبِّ الْأَرَضِينَ السَّبْعِ
وَمَا فِيهِنَّ وَمَا بَيْنَهُنَّ
وَرَبِّ الْعَرْشِ الْعَظِيمِ
وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ  `,

translation:` اللہ کے سوا کوئی معبود نہیں، جو نہایت بردبار اور بہت بزرگی والا ہے۔

اللہ کے سوا کوئی معبود نہیں، جو بلند مرتبہ اور عظمت والا ہے۔

اللہ پاک ہے، جو ساتوں آسمانوں کا رب ہے، ساتوں زمینوں کا رب ہے، اور جو کچھ ان میں ہے اور ان کے درمیان ہے سب کا رب ہے، اور عرشِ عظیم کا رب ہے۔

اور تمام تعریفیں اللہ ہی کے لیے ہیں، جو تمام جہانوں کا پروردگار ہے۔      `,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء عند الكرب`
}







,
{
id:28,

title:"دعائے حاجت",

english:"Dua-e-Hajat",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ
بِنَبِيِّكَ نَبِيِّ الرَّحْمَةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ
يَا مُحَمَّدُ يَا رَسُولَ اللَّهِ
إِنِّي أَتَوَجَّهُ بِكَ إِلَى اللَّهِ رَبِّي وَرَبِّكَ
لِيَقْضِيَ لِي حَاجَتِي
اللَّهُمَّ فَشَفِّعْهُ فِيَّ  `,

translation:`  اے اللہ! میں تجھ سے سوال کرتا ہوں اور تیرے حضور متوجہ ہوتا ہوں
تیرے نبی حضرت محمد صلی اللہ علیہ وآلہ وسلم کے وسیلے سے جو رحمت کے نبی ہیں۔
اے محمد! اے اللہ کے رسول!
میں آپ کے وسیلے سے اللہ کی بارگاہ میں متوجہ ہوتا ہوں
تاکہ وہ میری حاجت پوری فرمائے۔
اے اللہ! ان کی شفاعت میرے حق میں قبول فرما۔   `,

reference:`<b>📚 کتاب:</b> مصباح المتهجد<br><b>✍️ مصنف:</b> شیخ الطوسی<br><b>📖 اصل ماخذ:</b> دعاء الحاجة`
}





,
{
id:29,

title:"دعائے وداع",

english:"Wahsht-e-Qabar",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:` اللَّهُمَّ ارْحَمْ وَحْدَتِي
وَآنِسْ وَحْشَتِي
وَآمِنْ رَوْعَتِي
وَاسْكُنْ إِلَيَّ مِنْ رَحْمَتِكَ رَحْمَةً
أَسْتَغْنِي بِهَا عَنْ رَحْمَةِ مَنْ سِوَاكَ
وَاحْشُرْنِي مَعَ مَنْ كُنْتُ أَتَوَلَّاهُ  `,

translation:`   اے اللہ!
میری تنہائی پر رحم فرما۔
میری قبر کی وحشت کو مونس بنا۔
میرے خوف کو امن میں بدل دے۔
اپنی ایسی رحمت نازل فرما کہ مجھے تیرے سوا کسی کی رحمت کی ضرورت نہ رہے۔
اور مجھے ان لوگوں کے ساتھ محشور فرما جن سے میں محبت اور ولایت رکھتا تھا۔    `,

reference:`<b>📚 کتاب:</b> الصحیفۃ السجادیہ<br><b>✍️ مصنف:</b> امام علی بن الحسین زین العابدین علیہ السلام<br><b>📖 اصل ماخذ:</b> دعاء وداع شهر رمضان`
}









,
{
id:30,

title:"دعائے اولاد",

english:"Dua-e-Farzand",

bismillah:"بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم",

arabic:`اللَّهُمَّ ارْزُقْنِي وَلَدًا
وَاجْعَلْهُ تَقِيًّا زَكِيًّا
لَيْسَ فِي خَلْقِهِ زِيَادَةٌ وَلَا نُقْصَانٌ
وَاجْعَلْ عَاقِبَتَهُ إِلَى خَيْرٍ  `,

translation:`   اے اللہ! مجھے اولاد عطا فرما۔

اور اسے پرہیزگار اور پاکیزہ بنا۔

اس کی پیدائش اور خلقت میں نہ کوئی زیادتی ہو اور نہ کوئی کمی (یعنی اسے ہر جسمانی و روحانی نقص سے محفوظ رکھ)۔

اور اس کا انجام خیر و بھلائی پر فرما۔   `,

reference:`<b>📚 کتاب:</b> الكافي<br><b>✍️ مصنف:</b> شیخ کلینی<br><b>📖 اصل ماخذ:</b> باب الدعاء للولد`
}








];












const taqibat = [

{
id:1,

english:"Morning Taqeebat",

urdu:"تعقیبات نمازِ صبح",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تعقیبات نمازِ صبح`
},

{
id:2,

english:"Zuhr Taqeebat",

urdu:"تعقیبات نمازِ ظہر",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تعقیبات نمازِ ظہر`
},

{
id:3,

english:"Asr Taqeebat",

urdu:"تعقیبات نمازِ عصر",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تعقیبات نمازِ عصر`
},

{
id:4,

english:"Maghrib Taqeebat",

urdu:"تعقیبات نمازِ مغرب",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تعقیبات نمازِ مغرب`
},

{
id:5,

english:"Isha Taqeebat",

urdu:"تعقیبات نمازِ عشاء",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تعقیبات نمازِ عشاء`
},
{
id:6,

english:"Common Taqeebat",

urdu:"مشترکہ تعقیبات",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، مشترکہ تعقیبات`
},

{
id:7,

english:"Tasbeeh Zahra (sa)",

urdu:"تسبیح حضرت زہراءؑ",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تسبیح حضرت زہراءؑ`
},

{
id:8,

english:"Ayat-ul-Kursi",

urdu:"آیت الکرسی",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`قرآن کریم، سورۃ البقرہ، آیت 255`
},

{
id:9,

english:"Tasbeehat Arba",

urdu:"تسبیحات اربعہ",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، تسبیحات اربعہ`
},

{
id:10,

english:"Dua-e-Hifazat",

urdu:"دعائے حفاظت",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`مفاتیح الجنان، دعائے حفاظت`
},

{
id:11,

english:"Ayat-e-Hifazat",

urdu:"آیاتِ حفاظت",

bismillah:true,

arabic:`GG`,

translation:`GG`,

reference:`قرآن کریم، آیاتِ حفاظت`
},

];



/* =======================================
   OPEN TAQIBAT
======================================= */

function openTaqibat(id){

const item = taqibat.find(t => t.id === id);

if(!item){
return;
}

openPage("taqibatReadingPage");

document.getElementById("readingTitle").textContent =
item.urdu;

document.getElementById("readingEnglishTitle").textContent =
item.english;

document.getElementById("readingArabic").innerHTML =
item.arabic;

document.getElementById("readingUrdu").innerHTML =
item.translation;

document.getElementById("readingReference").innerHTML =
item.reference;
const bismillahBox =
document.querySelector("#taqibatReadingPage .readingBismillah");

if(item.bismillah){
bismillahBox.textContent = "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيمِ";
if(item.bismillah){
    bismillahBox.style.display = "block";
}else{
    bismillahBox.style.display = "none";
}
}
}